[
  {
    "pid": 10,
    "title": "A Quantum Money Solution to the Blockchain Scalability Problem",
    "authors": [
      {
        "email": "andrea.coladangelo@gmail.com",
        "first": "Andrea",
        "last": "Coladangelo",
        "affiliation": "Caltech",
        "contact": true
      },
      {
        "email": "sattath@gmail.com",
        "first": "Or",
        "last": "Sattath",
        "affiliation": "Ben-Gurion University",
        "contact": true
      }
    ],
    "abstract": "We put forward the idea that classical blockchains and smart contracts are potentially useful primitives not only for classical cryptography, but for quantum cryptography as well. Abstractly, a smart contract is a functionality that allows parties to deposit funds, and release them upon fulfillment of algorithmically checkable conditions, and can thus be employed as a formal tool to enforce monetary incentives.\r\nIn this work, we give the first example of the use of smart contracts in a quantum setting. We describe a simple hybrid classical-quantum payment system whose main ingredients are a classical blockchain capable of handling stateful smart contracts, and quantum lightning, a strengthening of public-key quantum money introduced by Zhandry (Eurocrypt'19). Our hybrid payment system employs quantum states as banknotes and a classical blockchain to settle disputes and to keep track of the valid serial numbers. It has several desirable properties: it is decentralized, requiring no trust in any single entity; payments are as quick as quantum communication, regardless of the total number of users; when a quantum banknote is damaged or lost, the rightful owner can recover the lost value."
  },
  {
    "pid": 16,
    "title": "Quantum encryption with certified deletion",
    "authors": [
      {
        "email": "abroadbe@uottawa.ca",
        "first": "Anne",
        "last": "Broadbent",
        "affiliation": "University of Ottawa",
        "contact": true
      },
      {
        "email": "risla028@uottawa.ca",
        "first": "Rabib",
        "last": "Islam",
        "affiliation": "University of Ottawa",
        "contact": true
      }
    ],
    "abstract": "Given a ciphertext, is it possible to prove the deletion of the underlying plaintext? Since\r\nclassical ciphertexts can be copied, clearly such a feat is impossible using classical information alone. In stark contrast to this, we show that quantum encodings enable certified deletion. More precisely speaking, we show that it is possible to encrypt classical data into a quantum ciphertext such that the recipient of the ciphertext can produce a classical string which proves to the originator that the recipient has relinquished any chance of recovering the plaintext should the decryption key be revealed. Our scheme is feasible with current quantum technology: the honest\r\nparties only require quantum devices for single-qubit preparation and measurements; the scheme is also robust against noise in these devices. Furthermore, we provide an analysis that is suitable in the finite-key regime"
  },
  {
    "pid": 17,
    "title": "Succinct Blind Quantum Computation Using a Random Oracle",
    "authors": [
      {
        "email": "jyz16@bu.edu",
        "first": "Jiayu",
        "last": "Zhang",
        "affiliation": "Boston University",
        "contact": true
      }
    ],
    "abstract": "In the universal blind quantum computation problem, a client wants to make use of a single quantum server to evaluate $C\\ket{0}$ where $C$ is an arbitrary quantum circuit while keeping $C$ secret. The client's goal is to use as few resources as possible. This problem, first raised by Broadbent, Fitzsimons and Kashefi\\cite{UBQC}, has become fundamental to the study of quantum cryptography, not only because of its own importance, but also because it provides a testbed for new techniques that were later applied to related problems (for example, quantum computation verification). Previous works on this problem mainly focused on either information-theoretically (IT) secure protocols or techniques based on trapdoor assumptions (public key encryptions).\\par\r\n\t In this paper we study how the availability of symmetric-key primitives, modeled by a random oracle, changes the complexity of universal blind quantum computation. We give a new universal blind quantum computation protocol. Similar to previous works on IT-secure protocols (for example, BFK\\cite{UBQC}), our protocol has an offline phase and an online phase. In the offline phase the client prepares some quantum gadgets with relatively simple quantum gates and sends them to the server, and in the online phase the client is entirely classical --- it does not even need quantum storage. Crucially, the protocol's offline phase is \\emph{succinct}, that is, its complexity is independent of the circuit size. Its complexity is only $poly(\\kappa)$ where $poly$ is a fixed polynomial, and can be used to evaluate any circuit (or several circuits) of size up to $subexp(\\kappa)$. In contrast, known schemes either require the client to perform quantum computations that scale with the size of the circuit \\cite{UBQC}, or require trapdoor assumptions \\cite{Mahadev2017}."
  },
  {
    "pid": 18,
    "title": "High-Speed Measurement-Device-Independent Quantum Key Distribution with Integrated Silicon Photonics",
    "authors": [
      {
        "email": "jeromelw@mail.ustc.edu.cn",
        "first": "Wei",
        "last": "Li",
        "affiliation": "University of Science and Technology of China",
        "contact": true
      },
      {
        "email": "kjwei@gxu.edu.cn",
        "first": "Kejin",
        "last": "Wei",
        "affiliation": "University of Science and Technology of China",
        "contact": true
      },
      {
        "first": "Hao",
        "last": "Tan",
        "affiliation": "University of Science and Technology of China"
      },
      {
        "first": "Yang",
        "last": "Li",
        "affiliation": "University of Science and Technology of China"
      },
      {
        "first": "Hao",
        "last": "Min",
        "affiliation": "University of Science and Technology of China"
      },
      {
        "first": "Wei-Jun",
        "last": "Zhang",
        "affiliation": "Shanghai Institute of Microsystem and Information Technology"
      },
      {
        "first": "Hao",
        "last": "Li",
        "affiliation": "Shanghai Institute of Microsystem and Information Technology"
      },
      {
        "first": "Lixing",
        "last": "You",
        "affiliation": "Shanghai Institute of Microsystem and Information Technology"
      },
      {
        "first": "Zhen",
        "last": "Wang",
        "affiliation": "Shanghai Institute of Microsystem and Information Technology"
      },
      {
        "first": "Xiao",
        "last": "Jiang",
        "affiliation": "University of Science and Technology of China"
      },
      {
        "first": "Teng Yun",
        "last": "Chen",
        "affiliation": "University of Science and Technology of China"
      },
      {
        "first": "Sheng-Kai",
        "last": "Liao",
        "affiliation": "University of Science and Technology of China"
      },
      {
        "first": "Cheng-Zhi",
        "last": "Peng",
        "affiliation": "University of Science and Technology of China"
      },
      {
        "email": "feihuxu@ustc.edu.cn",
        "first": "Feihu",
        "last": "Xu",
        "affiliation": "University of Science and Technology of China",
        "contact": true
      },
      {
        "first": "Jian-Wei",
        "last": "Pan",
        "affiliation": "University of Science and Technology of China"
      }
    ],
    "abstract": "Measurement-device-independent quantum key distribution (MDI-QKD) removes all detector side channels and enables secure QKD with an untrusted relay. It is suitable for building a star-type quantum access network, where the complicated and expensive measurement devices are placed in the central untrusted relay and each user requires only a low-cost transmitter, such as an integrated photonic chip. Here, we experimentally demonstrate a 1.25 GHz silicon photonic chip-based MDI-QKD system using polarization encoding. The photonic chip transmitters integrate the necessary encoding components for a standard QKD source. We implement random modulations of polarization states and decoy intensities, and demonstrate a finite-key secret rate of 31 bps over 36 dB channel loss (or 180 km standard fiber). This key rate is higher than state-of-the-art MDI-QKD experiments. The results show that silicon photonic chip-based MDI-QKD, benefiting from miniaturization, low-cost manufacture and compatibility with CMOS microelectronics, is a promising solution for future quantum secure networks."
  },
  {
    "pid": 21,
    "title": "Experimental Measurement-Device-Independent Quantum Key Distribution with Uncharacterized Sources",
    "authors": [
      {
        "email": "13770524973@163.com",
        "first": "Xing-Yu",
        "last": "Zhou",
        "affiliation": "Nanjing University of Posts & Telecommunications"
      },
      {
        "email": "qinw@njupt.edu.cn",
        "first": "Qin",
        "last": "Wang",
        "affiliation": "Nanjing University of Posts & Telecommunications",
        "contact": true
      }
    ],
    "abstract": "The measurement-device-independent quantum key distribution (MDI-QKD) protocol plays an important role in quantum communications due to its high level of security and  practicability. It can be immune to all side-channel attacks directed on the detecting devices. However, the protocol still contains strict requirements during state preparation in most existing MDI-QKD schemes, e.g., perfect state preparation or perfectly characterized sources, which are very hard to realize in practice. In this letter, we investigate uncharacterized MDI-QKD by utilizing a three-state method, greatly reducing the finite-size effect. The only requirement for state preparation is that the state are prepared in a  bidimensional Hilbert space. Furthermore, a proof-of-principle demonstration over a 170 km transmission distance is achieved, representing the longest transmission distance  under the same security level on record."
  },
  {
    "pid": 29,
    "title": "On Security Notions for Encryption in a Quantum World",
    "authors": [
      {
        "email": "celine.chevalier@ens.fr",
        "first": "Céline",
        "last": "Chevalier",
        "affiliation": "University of Paris II",
        "contact": true
      },
      {
        "email": "ebrahimi.math@gmail.com",
        "first": "Ehsan",
        "last": "Ebrahimi",
        "affiliation": "University of Luxembourg",
        "contact": true
      },
      {
        "email": "qhvu@ens.fr",
        "first": "Quoc-Huy",
        "last": "Vu",
        "affiliation": "University of Paris II",
        "contact": true
      }
    ],
    "abstract": "Indistinguishability against adaptive chosen-ciphertext attacks (IND-CCA2) is usually considered the most desirable security notion for classical encryption. In this work, we investigate its adaptation in the quantum world, when an adversary can perform superposition queries. The security of quantum-secure classical encryption has first been studied by Boneh and Zhandry (CRYPTO'13), but they restricted the adversary to classical challenge queries, which makes the indistinguishability only hold for classical messages (IND-qCCA2).\r\nIn this work, we give the first security notions for fully quantum indistinguishability under quantum adaptive chosen-ciphertext attacks, where the indistinguishability holds for superposition of plaintexts (qIND-qCCA2). This resolves an open problem asked by Gagliardoni et al. (CRYPTO'16).\r\n\r\nThe qCCA2 security is defined in Boneh-Zhandry's paper using string copying and comparison, which is inherent in the classical setting. Quantumly, it is unclear what it means for a ciphertext to be different from the challenge ciphertext, and how the challenger can check the equality. The classical approach would either violate the no-cloning theorem or lead to perturbing the adversary's state, which may be detectable. To remedy these problems, from the recent groundbreaking compressed oracle technique introduced by Zhandry (CRYPTO'19), we develop a generic framework that allows to record quantum queries for probabilistic functions. We then give definitions for fully quantum real-or-random indistinguishability under adaptive chosen-ciphertext attacks (qIND-qCCA2).\r\n\r\nIn the symmetric setting, we show that various classical modes of encryption are trivially broken in our security notions. We then provide the first formal proof for quantum security of the Encrypt-then-MAC paradigm, which also answers an open problem posed by Boneh and Zhandry.\r\n\r\nIn the public-key setting, we show how to achieve these stronger security notions (qIND-qCCA2) from any encryption scheme secure in the sense of Boneh-Zhandry (IND-qCCA2). Along the way, we also give the first definitions of non-malleability for classical encryption in the quantum world and show that the picture of the relations between these notions is essentially the same as in the classical setting."
  },
  {
    "pid": 30,
    "title": "Secure Multi-party Quantum Computation with a Dishonest Majority",
    "authors": [
      {
        "email": "yfkedulek@gmail.com",
        "first": "Yfke",
        "last": "Dulek",
        "affiliation": "QuSoft and University of Amsterdam",
        "contact": true
      },
      {
        "email": "abgrilo@gmail.com",
        "first": "Alex",
        "last": "Grilo",
        "affiliation": "QuSoft and CWI Amsterdam",
        "contact": true
      },
      {
        "email": "smjeffery@gmail.com",
        "first": "Stacey",
        "last": "Jeffery",
        "affiliation": "QuSoft and CWI Amsterdam",
        "contact": true
      },
      {
        "email": "c.majenz@uva.nl",
        "first": "Christian",
        "last": "Majenz",
        "affiliation": "QuSoft and CWI Amsterdam",
        "contact": true
      },
      {
        "email": "c.schaffner@uva.nl",
        "first": "Christian",
        "last": "Schaffner",
        "affiliation": "QuSoft and University of Amsterdam",
        "contact": true
      }
    ],
    "abstract": "The cryptographic task of secure multi-party (classical) computation has received a lot of attention in the last decades. Even in the extreme case where a computation is performed be- tween k mutually distrustful players, and security is required even for the single honest player if all other players are colluding adversaries, secure protocols are known. For quantum com- putation, on the other hand, protocols allowing arbitrary dishonest majority have only been proven for k = 2. In this work, we generalize the approach taken by Dupuis, Nielsen and Salvail (CRYPTO 2012) in the two-party setting to devise a secure, efficient protocol for multi- party quantum computation for any number of players k, and prove security against up to k − 1 colluding adversaries. The quantum round complexity of the protocol for computing a quantum circuit of {CNOT, T} depth d is O(k · (d + log n)), where n is the security parameter. To achieve efficiency, we develop a novel public verification protocol for the Clifford authen- tication code, and a testing protocol for magic-state inputs, both using classical multi-party computation."
  },
  {
    "pid": 36,
    "title": "Experimental quantum key distribution secure against malicious devices",
    "authors": [
      {
        "email": "vzapatero@com.uvigo.es",
        "first": "Víctor",
        "last": "Zapatero",
        "affiliation": "University of Vigo, Spain",
        "contact": true
      },
      {
        "email": "jeromelw@mail.ustc.edu.cn",
        "first": "Wei",
        "last": "Li",
        "affiliation": "University of Science and Technology of China, Hefei, China",
        "contact": true
      },
      {
        "email": "feihuxu@ustc.edu.cn",
        "first": "Feihu",
        "last": "Xu",
        "affiliation": "University of Science and Technology of China, Hefei, China",
        "contact": true
      },
      {
        "email": "mcurty@com.uvigo.es",
        "first": "Marcos",
        "last": "Curty",
        "affiliation": "University of Vigo, Spain"
      }
    ],
    "abstract": "The fabrication of quantum key distribution (QKD) systems typically involves several parties, thus providing Eve with multiple opportunities to meddle with the devices. As a consequence, conventional hardware and/or software hacking attacks pose natural threats to the security of practical QKD. Fortunately, if the number of corrupted devices is limited, the security can be restored by using redundant apparatuses. Here, we report on the demonstration of a secure QKD setup with optical devices and classical post-processing units possibly controlled by an eavesdropper. We implement a 1.25 GHz chip-based measurement-device-independent QKD system secure against malicious devices on both the measurement and the users' sides. The secret key rate reaches 137 bps over a 24 dB channel loss. Our setup, benefiting from high clock rate, miniaturized transmitters and a cost-effective structure, provides a promising solution for widespread applications requiring uncompromising communication security."
  },
  {
    "pid": 38,
    "title": "Security proof of practical quantum key distribution with detection-efficiency mismatch",
    "authors": [
      {
        "email": "yanbaoz@gmail.com",
        "first": "Yanbao",
        "last": "Zhang",
        "affiliation": "NTT Basic Research Lab",
        "contact": true
      },
      {
        "email": "patrickcoles@gmail.com",
        "first": "Patrick J.",
        "last": "Coles",
        "affiliation": "Los Alamos National Laboratory"
      },
      {
        "email": "adam.b.winick@gmail.com",
        "first": "Adam",
        "last": "Winick",
        "affiliation": "Institute for Quantum Computing, Waterloo"
      },
      {
        "email": "jie.lin@uwaterloo.ca",
        "first": "Jie",
        "last": "Lin",
        "affiliation": "Institute for Quantum Computing, Waterloo",
        "contact": true
      },
      {
        "email": "nlutkenhaus@uwaterloo.ca",
        "first": "Norbert",
        "last": "Lutkenhaus",
        "affiliation": "Institute for Quantum Computing, Waterloo",
        "contact": true
      }
    ],
    "abstract": "Quantum key distribution (QKD) protocols with threshold detectors are driving high-performance QKD demonstrations.  The corresponding security proofs usually assume that all physical detectors have the same detection efficiency. However, the efficiencies of the detectors used in practice might show a mismatch depending on the manufacturing and setup of these detectors. A mismatch can also be induced as the different spatial-temporal modes of an incoming \r\nsignal might couple differently to a detector. Here we develop a method that allows to provide security proofs without the usual assumption. Our method can take the detection-efficiency mismatch into account without having to restrict the attack strategy of the adversary. Especially, we do not rely on any photon-number cut-off of incoming signals such that our security proof is complete. Though we consider polarization encoding in the demonstration of our method, the method applies to a variety of coding mechanisms, including time-bin encoding, and also allows for general manipulations of the spatial-temporal modes by the adversary. We thus can close the long-standing question how to provide a valid, complete security proof of a QKD setup with characterized efficiency mismatch. Our method also shows that in the absence of efficiency mismatch, the key rate increases if the loss due to detection inefficiency is assumed to be outside of the adversary's control, as compared to the view where for a security proof \r\nthis loss is attributed to the action of the adversary."
  },
  {
    "pid": 40,
    "title": "Device-independent Randomness Expansion with Entangled Photons",
    "authors": [
      {
        "email": "yanbaoz@gmail.com",
        "first": "Yanbao",
        "last": "Zhang",
        "affiliation": "NTT Basic Research Lab",
        "contact": true
      },
      {
        "email": "lks@nist.gov",
        "first": "Lynden K.",
        "last": "Shalm",
        "affiliation": "NIST-Boulder"
      },
      {
        "email": "joshua.bienfang@nist.gov",
        "first": "Joshua C.",
        "last": "Bienfang",
        "affiliation": "NIST-Maryland"
      },
      {
        "email": "collin.schlager@nist.gov",
        "first": "Collin",
        "last": "Schlager",
        "affiliation": "NIST-Boulder"
      },
      {
        "email": "martin.stevens@nist.gov",
        "first": "Martin J.",
        "last": "Stevens",
        "affiliation": "NIST-Boulder"
      },
      {
        "email": "michael.mazurek@nist.gov",
        "first": "Michael D.",
        "last": "Mazurek",
        "affiliation": "NIST-Boulder"
      },
      {
        "email": "cabellan@quside.com",
        "first": "Carlos",
        "last": "Abellan",
        "affiliation": "Barcelona Institute of Science and Technology"
      },
      {
        "email": "wamaya@quside.com",
        "first": "Waldimar",
        "last": "Amaya",
        "affiliation": "Barcelona Institute of Science and Technology"
      },
      {
        "email": "morgan.mitchell@icfo.eu",
        "first": "Morgan W.",
        "last": "Mitchell",
        "affiliation": "Barcelona Institute of Science and Technology"
      },
      {
        "email": "mohammad.alhejji@colorado.edu",
        "first": "Mohammad A.",
        "last": "Alhejji",
        "affiliation": "University of Colorado Boulder"
      },
      {
        "email": "h7fu@umd.edu",
        "first": "Honghao",
        "last": "Fu",
        "affiliation": "University of Maryland"
      },
      {
        "email": "joel.ornstein@colorado.edu",
        "first": "Joel",
        "last": "Ornstein",
        "affiliation": "University of Colorado Boulder"
      },
      {
        "email": "richard.mirin@nist.gov",
        "first": "Richard P.",
        "last": "Mirin",
        "affiliation": "NIST-Boulder"
      },
      {
        "email": "saewoo.nam@nist.gov",
        "first": "Sae Woo",
        "last": "Nam",
        "affiliation": "NIST-Boulder"
      },
      {
        "email": "emanuel.knill@nist.gov",
        "first": "Emanuel",
        "last": "Knill",
        "affiliation": "NIST-Boulder"
      }
    ],
    "abstract": "With the growing availability of experimental loophole-free Bell tests, \r\nit has become possible to implement a new class of device-independent \r\nrandom number generators whose output can be certified to be uniformly \r\nrandom without requiring a detailed model of the quantum devices used.\r\nHowever, all previous experiments require many input bits in order to \r\ncertify a small number of output bits, and it is an outstanding challenge \r\nto develop a system that generates more randomness than is used. \r\nHere, we devise a device-independent spot-checking protocol which uses only \r\nuniform bits as input. Implemented with a photonic loophole-free Bell test, \r\nwe can produce 24% more certified output bits (1,181,264,237 bits) than \r\nconsumed input bits (953,301,640 bits), which is 5 orders of magnitude \r\nmore efficient than our previous work [Phys. Rev. Lett. 124, 010505 (2020)]. \r\nThe experiment ran for 91.0 hours, creating randomness at an average rate \r\nof 3,606 bits/second with a soundness error bounded by 5.7e-7 in the \r\npresence of classical side information. Our system will allow for greater \r\ntrust in public sources of randomness, such as randomness beacons, and \r\nthe protocol may one day enable high-quality sources of private randomness \r\nas the device footprint shrinks."
  },
  {
    "pid": 41,
    "title": "The Measure-and-Reprogram Technique 2.0: Multi-Round Fiat-Shamir and More",
    "authors": [
      {
        "email": "jelle.don@cwi.nl",
        "first": "Jelle",
        "last": "Don",
        "affiliation": "CWI",
        "contact": true
      },
      {
        "email": "serge.fehr@cwi.nl",
        "first": "Serge",
        "last": "Fehr",
        "affiliation": "CWI & Leiden University",
        "contact": true
      },
      {
        "email": "c.majenz@uva.nl",
        "first": "Christian",
        "last": "Majenz",
        "affiliation": "CWI & QuSoft",
        "contact": true
      }
    ],
    "abstract": "We revisit recent works by Don, Fehr, Majenz and Schaffner and by Liu and Zhandry on the security of the Fiat-Shamir transformation of sigma-protocols in the quantum random oracle model (QROM). Two natural questions that arise in this context are: (1) whether the results extend to the Fiat-Shamir transformation of *multi-round* interactive proofs, and (2) whether Don et al.'s O(q^2) loss in security is optimal.\r\n    \r\n    Firstly, we answer question (1) in the affirmative. As a byproduct of solving a technical difficulty in proving this result, we slightly improve the result of Don et al., equipping it with a cleaner bound and an even simpler proof. We apply our result to digital signature schemes showing that it can be used to prove strong  security for schemes like MQDSS in the QROM. As another application we prove QROM-security of a non-interactive OR proof by Liu, Wei and Wong. \r\n    \r\n    As for question (2), we show via a Grover-search based attack that Don et al.'s quadratic security loss for the Fiat-Shamir transformation of sigma-protocols is optimal up to a small constant factor. This extends to our new multi-round result, proving it tight up to a factor that depends on the number of rounds only, i.e. is constant for any constant-round interactive proof."
  },
  {
    "pid": 44,
    "title": "Broadband Detector-Integrated On-Chip QKD Receiver for GHz Clock Rates",
    "authors": [
      {
        "email": "fabian.beutel@uni-muenster.de",
        "first": "Fabian",
        "last": "Beutel",
        "affiliation": "University of Münster, Institute of Physics, 48149 Münster, Germany",
        "contact": true
      },
      {
        "first": "Helge",
        "last": "Gehring",
        "affiliation": "University of Münster, Institute of Physics, 48149 Münster, Germany"
      },
      {
        "first": "Martin A.",
        "last": "Wolff",
        "affiliation": "University of Münster, Institute of Physics, 48149 Münster, Germany"
      },
      {
        "first": "Carsten",
        "last": "Schuck",
        "affiliation": "University of Münster, Institute of Physics, 48149 Münster, Germany"
      },
      {
        "first": "Wolfram",
        "last": "Pernice",
        "affiliation": "University of Münster, Institute of Physics, 48149 Münster, Germany"
      }
    ],
    "abstract": "We present an on-chip receiver for time-based quantum key distribution (QKD) protocols such as the three-state time-bin protocol. The device features fully integrated superconducting nanowire single-photon detectors (SNSPD), low-loss delay lines and broadband 3D fiber-to-chip couplers with a total footprint of 800x800µm^2 on a single chip. By using waveguide-integrated SNSPDs featuring small dead times and low dark-count rates we are able to operate at 2.5 GHz clock rates and achieve high performance without saturating the detector at short distances. The device is demonstrated to work for wavelengths from 1480 nm to 1610 nm, but can be easily adapted to also work at visible light (on the same chip)."
  },
  {
    "pid": 46,
    "title": "Analytic quantum weak coin flipping protocols with arbitrarily small bias",
    "authors": [
      {
        "email": "atul.singh.arora@ulb.ac.be",
        "first": "Atul Singh",
        "last": "Arora",
        "affiliation": "Universite libre de Bruxelles"
      },
      {
        "email": "jroland@ulb.ac.be",
        "first": "Jeremie",
        "last": "Roland",
        "affiliation": "Universite libre de Bruxelles"
      },
      {
        "email": "Chrysoula.Vlachou@ulb.ac.be",
        "first": "Chrysoula",
        "last": "Vlachou",
        "affiliation": "Universite libre de Bruxelles",
        "contact": true
      }
    ],
    "abstract": "Weak coin flipping (WCF) is a fundamental cryptographic primitive, where two distrustful parties need to remotely establish a shared random bit, whilst having opposite preferred outcomes. A WCF protocol is said to have bias ε if neither party can force their preferred outcome with probability greater than 1/2+ε. Classical WCF protocols are shown to have bias 1/2, i.e., a cheating party can always force their preferred outcome. A lower bias can only be achieved by employing extra assumptions, such as computational hardness. On the other hand, there exist quantum WCF protocols with arbitrarily small bias, as Mochon showed in his seminal work in 2007 [arXiv:0711.4114]. In particular, he proved the existence of a family of WCF protocols approaching bias ε(k) = 1/(4k + 2) for arbitrarily large k and proposed a protocol with bias 1/6. Last year, Arora, Roland and Weis presented a protocol with bias 1/10 and to go below this bias, they designed an algorithm that numerically constructs unitary matrices corresponding to WCF protocols with arbitrarily small bias [STOC’19, p.205-216]. In this work, we present new techniques which yield a fully analytical construction of WCF protocols with bias arbitrarily close to zero, thus achieving a solution that has been missing for more than a decade. Furthermore, our new techniques lead to a simplified proof of existence of WCF protocols by circumventing the non-constructive part of Mochon’s proof. The construction of an explicit WCF protocol approaching bias 1/14 is illustrated as an example."
  },
  {
    "pid": 49,
    "title": "Fast and simple qubit-based synchronization for quantum key distribution",
    "authors": [
      {
        "email": "luca.calderaro@unipd.it",
        "first": "Luca",
        "last": "Calderaro",
        "affiliation": "Dipartimento di Ingegneria dell'Informazione, Università degli Studi di Padova, via Gradenigo 6B, 35131 Padova, Italy"
      },
      {
        "email": "andrea.stanco@unipd.it",
        "first": "Andrea",
        "last": "Stanco",
        "affiliation": "Dipartimento di Ingegneria dell'Informazione, Università degli Studi di Padova, via Gradenigo 6B, 35131 Padova, Italy",
        "contact": true
      },
      {
        "email": "costantino.agnesi@unipd.it",
        "first": "Costantino",
        "last": "Agnesi",
        "affiliation": "Dipartimento di Ingegneria dell'Informazione, Università degli Studi di Padova, via Gradenigo 6B, 35131 Padova, Italy",
        "contact": true
      },
      {
        "email": "avesani@dei.unipd.it",
        "first": "Marco",
        "last": "Avesani",
        "affiliation": "Dipartimento di Ingegneria dell'Informazione, Università degli Studi di Padova, via Gradenigo 6B, 35131 Padova, Italy"
      },
      {
        "email": "daniele.dequal@asi.it",
        "first": "Daniele",
        "last": "Dequal",
        "affiliation": "Matera Laser Ranging Observatory, Agenzia Spaziale Italiana, Matera, Italy"
      },
      {
        "email": "paolo.villoresi@dei.unipd.it",
        "first": "Paolo",
        "last": "Villoresi",
        "affiliation": "Dipartimento di Ingegneria dell'Informazione, Università degli Studi di Padova, via Gradenigo 6B, 35131 Padova, Italy"
      },
      {
        "email": "vallone@dei.unipd.it",
        "first": "Giuseppe",
        "last": "Vallone",
        "affiliation": "Dipartimento di Ingegneria dell'Informazione, Università degli Studi di Padova, via Gradenigo 6B, 35131 Padova, Italy",
        "contact": true
      }
    ],
    "abstract": "We propose Qubit4Sync, a synchronization method for Quantum Key Distribution (QKD) setups, based on the same qubits exchanged during the protocol and without requiring additional hardware other than the one necessary to prepare and measure the quantum states, in a similar fashion to the clock recovery used in classical communications. Our approach introduces a new cross-correlation algorithm achieving the lowest computational complexity, to our knowledge, for high channel losses. We tested the robustness of our scheme in a real QKD implementation, and we believe it may find application in other quantum communication protocols",
    "mergedwith": 55
  },
  {
    "pid": 52,
    "title": "Experimental quantum conference key agreement",
    "authors": [
      {
        "email": "a.fedrizzi@hw.ac.uk",
        "first": "Alessandro",
        "last": "Fedrizzi",
        "affiliation": "Heriot-Watt University",
        "contact": true
      },
      {
        "email": "mp68@hw.ac.uk",
        "first": "Massimiliano",
        "last": "Proietti",
        "affiliation": "Heriot-Watt University"
      },
      {
        "email": "joseph.ho@hw.ac.uk",
        "first": "Joseph",
        "last": "Ho",
        "affiliation": "Heriot-Watt University"
      },
      {
        "email": "federico.grasselli@uni-duesseldorf.de",
        "first": "Federico",
        "last": "Grasselli",
        "affiliation": "Heinrich-Heine University Duesseldorf"
      },
      {
        "email": "pb31@hw.ac.uk",
        "first": "Peter",
        "last": "Barrow",
        "affiliation": "Heriot-Watt University"
      },
      {
        "email": "m.malik@hw.ac.uk",
        "first": "Mehul",
        "last": "Malik",
        "affiliation": "Heriot-Watt University"
      }
    ],
    "abstract": "Paradigmatic QKD protocols establish secure keys between pairs of users, however when more than two parties want to communicate, recently introduced quantum conference quantum key agreement (CKA) protocols can outperform 2-party primitives in terms of resource cost. In this contribution we report an implementation of a four-user quantum CKA protocol using polarisation-encoded multi-partite GHZ states at telecom wavelength. We distribute these states over up to 50km of optical fibre and implement custom multiparty error correction and privacy amplification on the resulting raw keys. From a finite-key analysis, we establish an information-theoretic secure key of up to 1.15 × 10^6 bits, which is used to encrypt and securely share an image between the four users. Surpassing the previous maximum distance for GHZ state transmission by more than an order of magnitude, these results demonstrate the viability of network protocols relying on multi-partite-entanglement. Future applications beyond quantum CKA include entanglement-assisted remote clock-synchronization, quantum secret sharing, and GHZ-based repeater protocols."
  },
  {
    "pid": 54,
    "title": "Overcoming qubit-based QKD with efficient high-dimensional encoding",
    "authors": [
      {
        "email": "vagniluca@lens.unifi.it",
        "first": "Ilaria",
        "last": "Vagniluca",
        "affiliation": "CNR - Istituto Nazionale di Ottica and University of Naples “Federico II\"",
        "contact": true
      },
      {
        "first": "Beatrice",
        "last": "DaLio",
        "affiliation": "CoE SPOC, DTU Fotonik, Technical University of Denmark"
      },
      {
        "first": "Davide",
        "last": "Rusca",
        "affiliation": "Group of Applied Physics, Université de Genève"
      },
      {
        "first": "Daniele",
        "last": "Cozzolino",
        "affiliation": "CoE SPOC, DTU Fotonik, Technical University of Denmark"
      },
      {
        "first": "Yunhong",
        "last": "Ding",
        "affiliation": "CoE SPOC, DTU Fotonik, Technical University of Denmark"
      },
      {
        "first": "Hugo",
        "last": "Zbinden",
        "affiliation": "Group of Applied Physics, Université de Genève"
      },
      {
        "first": "Alessandro",
        "last": "Zavatta",
        "affiliation": "CNR - Istituto Nazionale di Ottica and University of Florence"
      },
      {
        "first": "Leif Katsuo",
        "last": "Oxenløwe",
        "affiliation": "CoE SPOC, DTU Fotonik, Technical University of Denmark"
      },
      {
        "email": "dabac@fotonik.dtu.dk",
        "first": "Davide",
        "last": "Bacco",
        "affiliation": "CoE SPOC, DTU Fotonik, Technical University of Denmark",
        "contact": true
      }
    ],
    "abstract": "We experimentally tested an alternative fiber-based setup for 4D-QKD, with time and phase encoding and one-decoy technique. We evaluated the secret key rate achievable in a finite-key scenario and we compared it with the binary-encoded BB84 protocol, which was tested with the same experimental setup. Our 4D-QKD system makes it possible to improve the secret key rate by more than a factor 2 in the saturation-regime of single-photon detectors, without requiring additional expensive resources to the 2D-QKD setup. In comparison to previous works, our scheme allows to measure the 4D states with a simplified and compact receiver, thus making it a cost-effective solution for practical and fiber-based QKD.",
    "mergedwith": 57
  },
  {
    "pid": 55,
    "title": "Simple and robust QKD system with Qubit4Sync temporal synchronization and the POGNAC polarization encoder",
    "authors": [
      {
        "email": "costantino.agnesi@unipd.it",
        "first": "Costantino",
        "last": "Agnesi",
        "affiliation": "Università degli Studi di Padova",
        "contact": true
      },
      {
        "email": "marco.avesani@phd.unipd.it",
        "first": "Marco",
        "last": "Avesani",
        "affiliation": "Università degli Studi di Padova"
      },
      {
        "email": "luca.calderaro@phd.unipd.it",
        "first": "Luca",
        "last": "Calderaro",
        "affiliation": "Università degli Studi di Padova"
      },
      {
        "email": "andrea.stanco@unipd.it",
        "first": "Andrea",
        "last": "Stanco",
        "affiliation": "Università degli Studi di Padova",
        "contact": true
      },
      {
        "email": "foletto@dei.unipd.it",
        "first": "Giulio",
        "last": "Foletto",
        "affiliation": "Università degli Studi di Padova"
      },
      {
        "email": "mujtaba.zahidy@studenti.unipd.it",
        "first": "Mujtaba",
        "last": "Zahidy",
        "affiliation": "Università degli Studi di Padova"
      },
      {
        "email": "alessia.scriminich@phd.unipd.it",
        "first": "Alessia",
        "last": "Scriminich",
        "affiliation": "Università degli Studi di Padova"
      },
      {
        "email": "francesco.vedovato@phd.unipd.it",
        "first": "Francesco",
        "last": "Vedovato",
        "affiliation": "Università degli Studi di Padova"
      },
      {
        "email": "vallone@dei.unipd.it",
        "first": "Giuseppe",
        "last": "Vallone",
        "affiliation": "Università degli Studi di Padova",
        "contact": true
      },
      {
        "email": "paolo.villoresi@unipd.it",
        "first": "Paolo",
        "last": "Villoresi",
        "affiliation": "Università degli Studi di Padova"
      }
    ],
    "abstract": "Here we present a simple and robust polarization encoded QKD experiment where\r\nsynchronization, polarization compensation and QKD are all performed with the same optical setup, without requiring any changes or any additional hardware, by exploiting only the transmission of quantum states. Furthermore, the developed polarization encoder exhibits high stability and the lowest intrinsic Quantum Bit Error Rate ever reported.",
    "mergedwith": 49
  },
  {
    "pid": 56,
    "title": "Securing practical quantum cryptography with optical power limiters",
    "authors": [
      {
        "email": "zhanggong@nus.edu.sg",
        "first": "Gong",
        "last": "Zhang",
        "affiliation": "Department of Electrical & Computer Engineering, National University of Singapore, Singapore",
        "contact": true
      },
      {
        "email": "william_primaatmaja@u.nus.edu",
        "first": "Ignatius William",
        "last": "Primaatmaja",
        "affiliation": "Centre for Quantum Technologies, National University of Singapore, Singapore",
        "contact": true
      },
      {
        "email": "elehjy@nus.edu.sg",
        "first": "Jing Yan",
        "last": "Haw",
        "affiliation": "Department of Electrical & Computer Engineering, National University of Singapore, Singapore",
        "contact": true
      },
      {
        "email": "elegong@nus.edu.sg",
        "first": "Xiao",
        "last": "Gong",
        "affiliation": "Department of Electrical & Computer Engineering, National University of Singapore, Singapore"
      },
      {
        "email": "wang.chao@nus.edu.sg",
        "first": "Chao",
        "last": "Wang",
        "affiliation": "Department of Electrical & Computer Engineering, National University of Singapore, Singapore",
        "contact": true
      },
      {
        "email": "charles.lim@nus.edu.sg",
        "first": "Charles C.-W.",
        "last": "Lim",
        "affiliation": "Department of Electrical & Computer Engineering, National University of Singapore, Singapore; Centre for Quantum Technologies, National University of Singapore, Singapore",
        "contact": true
      }
    ],
    "abstract": "Given that most implementations of quantum cryptography systems require low light operations for security reasons, limiting the energy of incoming/outgoing optical signals is a central task. In this submission, we propose and demonstrate a novel and practical power limiter using the thermo-optical defocusing effect of an acrylic prism. The results show that a power limiting in the regime of mW or lower can be achieved, and at the same time possess desirable features like compactness, robustness, polarization and spectrum dimension independence, etc. Our work provides an effective way for limiting the incoming/outgoing optical energy, which is important for practical quantum cryptographic protocols. We believe it will attract much interest and possess the potential to become a standard tool for practical quantum applications."
  },
  {
    "pid": 57,
    "title": "Towards high-dimensional quantum key distribution over a 2 km long multicore fiber",
    "authors": [
      {
        "email": "bdali@fotonik.dtu.dk",
        "first": "Beatrice",
        "last": "Da Lio",
        "affiliation": "enter for Silicon Photonics for Optical Communication (SPOC), Department of Photonics Engineering, Technical University of Denmark, 2800 Kgs. Lyngby, Denmark",
        "contact": true
      },
      {
        "email": "dabac@fotonik.dtu.dk",
        "first": "Davide",
        "last": "Bacco",
        "affiliation": "enter for Silicon Photonics for Optical Communication (SPOC), Department of Photonics Engineering, Technical University of Denmark, 2800 Kgs. Lyngby, Denmark",
        "contact": true
      },
      {
        "email": "dacoz@fotonik.dtu.dk",
        "first": "Daniele",
        "last": "Cozzolino",
        "affiliation": "enter for Silicon Photonics for Optical Communication (SPOC), Department of Photonics Engineering, Technical University of Denmark, 2800 Kgs. Lyngby, Denmark"
      },
      {
        "email": "biagi@lens.unifi.it",
        "first": "Nicola",
        "last": "Biagi",
        "affiliation": "CNR - Istituto Nazionale di Ottica (CNR-INO), Largo E. Fermi, 6 - 50125 Firenze, Italy"
      },
      {
        "email": "yudin@fotonik.dtu.dk",
        "first": "Yunhong",
        "last": "Ding",
        "affiliation": "enter for Silicon Photonics for Optical Communication (SPOC), Department of Photonics Engineering, Technical University of Denmark, 2800 Kgs. Lyngby, Denmark"
      },
      {
        "email": "karo@fotonik.dtu.dk",
        "first": "Karsten",
        "last": "Rottwitt",
        "affiliation": "enter for Silicon Photonics for Optical Communication (SPOC), Department of Photonics Engineering, Technical University of Denmark, 2800 Kgs. Lyngby, Denmark"
      },
      {
        "email": "alessandro.zavatta@ino.cnr.it",
        "first": "Alessandro",
        "last": "Zavatta",
        "affiliation": "CNR - Istituto Nazionale di Ottica (CNR-INO), Largo E. Fermi, 6 - 50125 Firenze, Italy"
      },
      {
        "email": "lkox@fotonik.dtu.dk",
        "first": "Leif K.",
        "last": "Oxeløwe",
        "affiliation": "enter for Silicon Photonics for Optical Communication (SPOC), Department of Photonics Engineering, Technical University of Denmark, 2800 Kgs. Lyngby, Denmark"
      }
    ],
    "abstract": "High-dimensional quantum key distribution (QKD) with path-encoded qudits can largely benefit from the slower phase drifts characteristic of multicore fibers: however, such channels still require phase stabilisation systems to effectively transmit quantum states with an acceptable error rate. We propose a scheme that multiplexes a co-propagating wavelength to use as reference signal in a phase locked loop system, and simultaneously achieves state of the art repetition rates for the high-dimensional QKD system. These factors allow us to design a system that can reach a much higher secret key generation rate over a propagation distance that is order of magnitudes longer than what shown in previous results, making our path-encoded QKD system appealing and comparable in terms of performance with current quantum systems.",
    "mergedwith": 54
  },
  {
    "pid": 58,
    "title": "Non-interactive classical verification of quantum computation",
    "authors": [
      {
        "email": "galagic@gmail.com",
        "first": "Gorjan",
        "last": "Alagic",
        "affiliation": "University of Maryland and NIST",
        "contact": true
      },
      {
        "email": "amchilds@umd.edu",
        "first": "Andrew M.",
        "last": "Childs",
        "affiliation": "University of Maryland",
        "contact": true
      },
      {
        "email": "abgrilo@gmail.com",
        "first": "Alex B.",
        "last": "Grilo",
        "affiliation": "CWI and QuSoft",
        "contact": true
      },
      {
        "email": "shung@umd.edu",
        "first": "Shih-Han",
        "last": "Hung",
        "affiliation": "University of Maryland",
        "contact": true
      }
    ],
    "abstract": "In a recent breakthrough, Mahadev constructed an interactive protocol that enables a purely classical party to delegate any quantum computation to an untrusted quantum prover. In this work, we show that this same task can in fact be performed non-interactively and in zero-knowledge.\r\n\r\n  Our protocols result from a sequence of significant improvements to the original four-message protocol of Mahadev. We begin by making the first message instance-independent and moving it to an offline setup phase. We then establish a parallel repetition theorem for the resulting three-message protocol, with an asymptotically optimal rate. This, in turn, enables an application of the Fiat-Shamir heuristic, eliminating the second message and giving a non-interactive protocol. Finally, we employ classical non-interactive zero-knowledge (NIZK) arguments and classical fully homomorphic encryption (FHE) to give a zero-knowledge variant of this construction. This yields the first purely classical NIZK argument system for QMA, a quantum analogue of NP.\r\n\r\nWe establish the security of our protocols under standard assumptions in quantum-secure cryptography. Specifically, our protocols are secure in the Quantum Random Oracle Model, under the assumption that Learning with Errors is quantumly hard. The NIZK construction also requires circuit-private FHE."
  },
  {
    "pid": 59,
    "title": "Experimental realisation of quantum oblivious transfer",
    "authors": [
      {
        "email": "amiri.ryan@gmail.com",
        "first": "Ryan",
        "last": "Amiri",
        "affiliation": "IPaQS, Heriot-Watt University, Edinburgh, UK",
        "contact": true
      },
      {
        "email": "starek@optics.upol.cz",
        "first": "Robert",
        "last": "Stárek",
        "affiliation": "Department of Optics, Palacky University, Olomouc, Czech Republic",
        "contact": true
      },
      {
        "email": "micuda@optics.upol.cz",
        "first": "Michal",
        "last": "Mičuda",
        "affiliation": "Department of Optics, Palacky University, Olomouc, Czech Republic",
        "contact": true
      },
      {
        "email": "mista@optics.upol.cz",
        "first": "Ladislav",
        "last": "Mišta",
        "affiliation": "Department of Optics, Palacky University, Olomouc, Czech Republic",
        "contact": true
      },
      {
        "email": "dusek@optics.upol.cz",
        "first": "Miloslav",
        "last": "Dušek",
        "affiliation": "Department of Optics, Palacky University, Olomouc, Czech Republic",
        "contact": true
      },
      {
        "email": "petros.wallden@ed.ac.uk",
        "first": "Petros",
        "last": "Wallden",
        "affiliation": "School of Informatics, University of Edinburgh, Edinburgh, UK",
        "contact": true
      },
      {
        "email": "E.Andersson@hw.ac.uk",
        "first": "Erika",
        "last": "Andersson",
        "affiliation": "IPaQS, Heriot-Watt University, Edinburgh, UK",
        "contact": true
      }
    ],
    "abstract": "Oblivious transfer (OT) is a cryptographic primitive which is universal for multiparty computation. Unfortunately, perfect information-theoretically secure (ITS) quantum oblivious transfer is impossible. Imperfect information-theoretically secure quantum oblivious transfer is possible, but the smallest possible cheating probabilities are not known. \r\nWe present an imperfect information-theoretically secure quantum oblivious transfer protocol with no restrictions on dishonest parties, and its experimental implementation. The cheating probabilities are 0.75 and 0.729 for sender and receiver respectively, which is lower than in existing protocols. Using a photonic test-bed, we have implemented the protocol with honest parties, as well as optimal cheating strategies."
  },
  {
    "pid": 65,
    "title": "Real-Time Self-Testing Quantum Random Number Generator with Non-classical States",
    "authors": [
      {
        "email": "thibault.michel@lkb.upmc.fr",
        "first": "Thibault",
        "last": "Michel",
        "affiliation": "ANU Canberra, Paris 6",
        "contact": true
      },
      {
        "email": "elehjy@nus.edu.sg",
        "first": "Jing Yan",
        "last": "Haw",
        "affiliation": "ANU Canberra, NUS Singapore",
        "contact": true
      },
      {
        "email": "davgmar@googlemail.com",
        "first": "Davide G.",
        "last": "Marangon",
        "affiliation": "U. Padova"
      },
      {
        "email": "oliver.thearle@anu.edu.au",
        "first": "Oliver",
        "last": "Thearle",
        "affiliation": "ANU Canberra"
      },
      {
        "email": "vallone@dei.unipd.it",
        "first": "Giuseppe",
        "last": "Vallone",
        "affiliation": "U. Padova",
        "contact": true
      },
      {
        "email": "paolo.villoresi@dei.unipd.it",
        "first": "Paolo",
        "last": "Villoresi",
        "affiliation": "U. Padova"
      },
      {
        "email": "Ping.Lam@anu.edu.au",
        "first": "Ping Koy",
        "last": "Lam",
        "affiliation": "ANU Canberra"
      },
      {
        "email": "cqtsma@gmail.com",
        "first": "Syed M.",
        "last": "Assad",
        "affiliation": "ANU Canberra"
      }
    ],
    "abstract": "Random numbers are a fundamental ingredient in fields such as simulation, modeling, and cryptography. Good random numbers should be independent and uniformly distributed. Moreover, for cryptographic applications, they should also be unpredictable. A fundamental feature of quantum theory is that certain measurement outcomes are intrinsically random and unpredictable. These can be harnessed to provide unconditionally secure random numbers. We demonstrate a real-time self-testing source-independent quantum random-number generator (SI QRNG) that uses squeezed light as a source. We generate secure random numbers by measuring the quadratures of the electromagnetic field without making any assumptions about the source other than an energy bound; only the detection device is trusted. We use homodyne detection to measure alternately the Q and P conjugate quadratures of our source. P measurements allow us to estimate a bound on any classical or quantum side information that a malicious eavesdropper may obtain. This bound gives the minimum number of secure bits we can extract from the Q measurement. We discuss the performance of different estimators for this bound. We operate this QRNG with a squeezed-state source and compare its performance with a thermal-state source. This is a demonstration of a QRNG using a squeezed state, as well as an implementation of real-time quadrature switching for a SI QRNG."
  },
  {
    "pid": 66,
    "title": "Benchmarking a Quantum Random Number Generator with Machine Learning",
    "authors": [
      {
        "first": "Nhan Duy",
        "last": "Truong",
        "affiliation": "Nano-Neuro-inspired Research Laboratory, School of Electrical and Information Engineering, the University of Sydney, Sydney, NSW 2006, Australia."
      },
      {
        "first": "Jing Yan",
        "last": "Haw",
        "affiliation": "Centre for Quantum Computation and Communication Technology, Department of Quantum Science, Research School of Physics and Engineering, The Australian National University, Canberra ACT 2601, Australia; Department of Electrical \\& Computer Engineering, National University of Singapore, 117583, Singapore"
      },
      {
        "first": "Syed Muhamad",
        "last": "Assad",
        "affiliation": "Centre for Quantum Computation and Communication Technology, Department of Quantum Science, Research School of Physics and Engineering, The Australian National University, Canberra ACT 2601, Australia"
      },
      {
        "first": "Ping Koy",
        "last": "Lam",
        "affiliation": "Centre for Quantum Computation and Communication Technology, Department of Quantum Science, Research School of Physics and Engineering, The Australian National University, Canberra ACT 2601, Australia"
      },
      {
        "first": "Omid",
        "last": "Kavehei",
        "affiliation": "Nano-Neuro-inspired Research Laboratory, School of Electrical and Information Engineering, the University of Sydney, Sydney, NSW 2006, Australia."
      }
    ],
    "abstract": "Random number generators (RNGs) that are crucial for cryptographic applications have been the subject of adversarial attacks. These attacks exploit environmental information to predict generated random numbers that are supposed to be truly random and unpredictable. Though quantum random number generators (QRNGs) are based on the intrinsic indeterministic nature of quantum properties, the presence of classical noise in the measurement process compromises the integrity of a QRNG. In this paper, we develop a predictive machine learning (ML) analysis to investigate the impact of deterministic classical noise in different stages of an optical continuous variable QRNG. Our ML model successfully detects inherent correlations when the deterministic noise sources are prominent. After appropriate filtering and randomness extraction processes are introduced, our QRNG system, in turn, demonstrates its robustness against ML. We further demonstrate the robustness of our ML approach by applying it to uniformly distributed random numbers from the QRNG and a congruential RNG. Hence, our result shows that ML has potentials in benchmarking the quality of RNG devices."
  },
  {
    "pid": 74,
    "title": "Post-Quantum Zero Knowledge in Constant Rounds",
    "authors": [
      {
        "email": "nirbitan@tau.ac.il",
        "first": "Nir",
        "last": "Bitansky",
        "affiliation": "Tel Aviv University",
        "contact": true
      },
      {
        "email": "omrishmueli@mail.tau.ac.il",
        "first": "Omri",
        "last": "Shmueli",
        "affiliation": "Tel Aviv University",
        "contact": true
      }
    ],
    "abstract": "We construct the first constant-round zero-knowledge classical argument for NP secure against quantum attacks. We assume the existence of Quantum Fully Homomorphic Encryption and other standard primitives, known based on the Learning with Errors Assumption for quantum algorithms. As a corollary, we also obtain the first constant-round zero-knowledge quantum argument for QMA.\r\n\r\nAt the heart of our protocol is a new no-cloning non-black-box simulation technique."
  },
  {
    "pid": 76,
    "title": "Efficient simulation of random states and random unitaries",
    "authors": [
      {
        "email": "galagic@gmail.com",
        "first": "Gorjan",
        "last": "Alagic",
        "affiliation": "QuICS, University of Maryland, and NIST, Gaithersburg, MD",
        "contact": true
      },
      {
        "email": "c.majenz@uva.nl",
        "first": "Christian",
        "last": "Majenz",
        "affiliation": "QuSoft and Centrum Wiskunde & Informatica, Amsterdam",
        "contact": true
      },
      {
        "email": "acr@uconn.edu",
        "first": "Alexander",
        "last": "Russell",
        "affiliation": "Department of Computer Science and Engineering, University of Connecticut, Storrs, CT",
        "contact": true
      }
    ],
    "abstract": "We consider the problem of efficiently simulating random quantum states and random unitary operators, in a manner which is convincing to unbounded adversaries with black-box oracle access. In the case of simulating random states, the ideal object is an inputless oracle which outputs the same Haar-random n-qubit state whenever it is invoked. In the case of simulating random unitaries, the ideal object is an oracle which applies to its input the same Haar-random n-qubit unitary operator whenever it is invoked. \r\n\r\nThis problem has only been previously considered for restricted adversaries. Against adversaries with an a priori bound on the number of queries, it is well-known that t-designs suffice. Against polynomial-time adversaries, one can use pseudorandom states (PRS) and pseudorandom unitaries (PRU), as defined in a recent work of Ji, Liu, and Song; unfortunately, no provably secure construction is known for PRUs.\r\n\r\nIn our setting, we are concerned with unbounded adversaries. Nonetheless, we are able to give stateful quantum algorithms which simulate the ideal object in both settings of interest. In the case of Haar-random states, our simulator is polynomial-time, has negligible error, and can also simulate verification and reflection through the simulated state. This yields an immediate application to quantum money: a money scheme which is information-theoretically unforgeable and untraceable. In the case of Haar-random unitaries, our simulator takes polynomial space, but simulates both forward and inverse access with zero error. \r\n\r\nThese results can be seen as the first significant steps in developing a theory of lazy sampling for random quantum objects."
  },
  {
    "pid": 77,
    "title": "Numerical Calculations of Finite Key Rate for General Quantum Key Distribution Protocols",
    "authors": [
      {
        "email": "itgeorge@uwaterloo.ca",
        "first": "Ian",
        "last": "George",
        "affiliation": "University of Waterloo, Institute for Quantum Computing",
        "contact": true
      },
      {
        "email": "jie.lin@uwaterloo.ca",
        "first": "Jie",
        "last": "Lin",
        "affiliation": "University of Waterloo, Institute for Quantum Computing",
        "contact": true
      },
      {
        "email": "nlutkenhaus@uwaterloo.ca",
        "first": "Norbert",
        "last": "Lutkenhaus",
        "affiliation": "University of Waterloo, Institute for Quantum Computing",
        "contact": true
      }
    ],
    "abstract": "Finite key analysis of quantum key distribution (QKD) is an important tool for any QKD implementation. While much work has been done on the framework of finite key analysis, the application to individual protocols often relies on the the specific protocol being simple or highly symmetric as well as represented in small finite-dimensional Hilbert spaces. In this work, we extend our preexisting reliable, efficient, tight, and generic numerical method for calculating the asymptotic key rate of device-dependent QKD protocols in finite-dimensional Hilbert spaces to the finite key regime using the security analysis framework of Renner. We explain how this extension preserves the reliability, efficiency, and tightness of the asymptotic method. We then explore examples which illustrate both the generality of our method as well as the importance of parameter estimation and data processing within the framework."
  },
  {
    "pid": 80,
    "title": "Machine learning aided carrier recovery in continuous-variable quantum key distribution",
    "authors": [
      {
        "email": "tobias.gehring@fysik.dtu.dk",
        "first": "Tobias",
        "last": "Gehring",
        "affiliation": "Technical University of Denmark",
        "contact": true
      },
      {
        "email": "homch@fysik.dtu.dk",
        "first": "Hou-Man",
        "last": "Chin",
        "affiliation": "Technical University of Denmark"
      },
      {
        "email": "nitin.jain@fysik.dtu.dk",
        "first": "Nitin",
        "last": "Jain",
        "affiliation": "Technical University of Denmark"
      },
      {
        "email": "dazi@fotonik.dtu.dk",
        "first": "Darko",
        "last": "Zibar",
        "affiliation": "Technical University of Denmark"
      },
      {
        "email": "ulrik.andersen@fysik.dtu.dk",
        "first": "Ulrik",
        "last": "Andersen",
        "affiliation": "Technical University of Denmark",
        "contact": true
      }
    ],
    "abstract": "The secret key rate of a continuous-variable quantum key distribution (CV-QKD) system is limited by excess noise. A key issue typical to all modern CV-QKD systems implemented with a reference or pilot signal and an independent local oscillator is controlling the excess noise generated from the frequency and phase noise accrued by the transmitter and receiver. Therefore accurate phase estimation and compensation, so-called carrier recovery, is a critical subsystem of CV-QKD. Here, we present the implementation of a machine learning framework based on Bayesian inference, namely an unscented Kalman filter (UKF), for estimation of phase noise and compare it to a standard reference method. Experimental results obtained over a 20 km fibre-optic link indicate that the UKF can ensure very low excess noise even at low pilot powers. The measurements exhibited low variance and high stability in excess noise over a wide range of pilot signal to noise ratios. This may enable CV-QKD systems with low implementation complexity which can seamlessly work on diverse transmission lines."
  },
  {
    "pid": 89,
    "title": "Impossibility of Quantum Virtual Black-Box Obfuscation of Classical Circuits",
    "authors": [
      {
        "email": "galagic@gmail.com",
        "first": "Gorjan",
        "last": "Alagic",
        "affiliation": "QuICS, University of Maryland, NIST",
        "contact": true
      },
      {
        "email": "zvika.brakerski@weizmann.ac.il",
        "first": "Zvika",
        "last": "Brakerski",
        "affiliation": "Weizmann Institute of Science",
        "contact": true
      },
      {
        "email": "yfkedulek@gmail.com",
        "first": "Yfke",
        "last": "Dulek",
        "affiliation": "QuSoft; University of Amsterdam",
        "contact": true
      },
      {
        "email": "c.schaffner@uva.nl",
        "first": "Christian",
        "last": "Schaffner",
        "affiliation": "QuSoft; University of Amsterdam",
        "contact": true
      }
    ],
    "abstract": "Virtual black-box obfuscation is a strong cryptographic primitive: it encrypts a circuit while maintaining its full input/output functionality. A remarkable result by Barak et al. (Crypto 2001) shows that a general obfuscator that obfuscates classical circuits into classical circuits can- not exist. A promising direction that circumvents this impossibility result is to obfuscate classical circuits into quantum states, which would potentially be better capable of hiding information about the obfuscated circuit. We show that, under the assumption that learning-with-errors (LWE) is hard for quantum computers, this quantum variant of virtual black-box obfuscation of classical circuits is generally impossible. On the way, we show that under the presence of dependent classical auxiliary input, even the small class of classical point functions cannot be quantum virtual black-box obfuscated."
  },
  {
    "pid": 98,
    "title": "Robust device-independent quantum key distribution",
    "authors": [
      {
        "email": "elerene@nus.edu.sg",
        "first": "Rene",
        "last": "Schwonnek",
        "affiliation": "NUS/ECE"
      },
      {
        "email": "elegkt@nus.edu.sg",
        "first": "Koon Tong",
        "last": "Goh",
        "affiliation": "NUS/ECE"
      },
      {
        "email": "william_primaatmaja@u.nus.edu",
        "first": "Ignatius W.",
        "last": "Primaatmaja",
        "affiliation": "NUS/CQT",
        "contact": true
      },
      {
        "email": "ernesttyz@hotmail.com",
        "first": "Ernest Y.-Z.",
        "last": "Tan",
        "affiliation": "ETHZ"
      },
      {
        "email": "ramona.wolf@itp.uni-hannover.de",
        "first": "Ramona",
        "last": "Wolf",
        "affiliation": "Leibniz Universität Hannover"
      },
      {
        "email": "physv@nus.edu.sg",
        "first": "Valerio",
        "last": "Scarani",
        "affiliation": "NUS/Physics/CQT"
      },
      {
        "email": "charles.lim@nus.edu.sg",
        "first": "Charles C.-W.",
        "last": "Lim",
        "affiliation": "NUS/ECE/CQT",
        "contact": true
      }
    ],
    "abstract": "Device-independent quantum key distribution (DIQKD) is the art of using untrusted devices to distribute secret keys in an unsecure network. It thus represents the ultimate form of cryptography, offering not only information-theoretic security against channel attacks, but also against attacks exploiting implementation loopholes~\\cite{lydersen2010hacking}. At its heart, DIQKD utilises nonlocal correlations---detected and certified by a Bell inequality---to establish secret correlations between the users. In recent years, much progress has been made towards realising the first DIQKD experiments, but current proposals are just out of reach of today’s loophole-free Bell experiments. Here, in this work, we close the gap between the theory and practice of DIQKD with a simple variant of the original protocol based on the celebrated Clauser-Horne-Shimony-Holt (CHSH) Bell inequality. In using two randomly chosen key generating bases instead of one, we show that the noise tolerance of DIQKD can be significantly improved. In particular, the extended feasibility region now covers some of the most recent loophole-free CHSH experiments, hence indicating that the first realisation of DIQKD already lies within the range of these experiments."
  },
  {
    "pid": 99,
    "title": "An Integrated Chip Platform for Measurement-Device-Independent Quantum Key Distribution (MDI-QKD)",
    "authors": [
      {
        "email": "wei.luo@ntu.edu.sg",
        "first": "Wei",
        "last": "Luo",
        "affiliation": "Nanyang Technological University",
        "contact": true
      },
      {
        "email": "l.cao@pku.edu.cn",
        "first": "Lin",
        "last": "Cao",
        "affiliation": "Peking University"
      },
      {
        "email": "wangyunxiang@uestc.edu.cn",
        "first": "Yun Xiang",
        "last": "Wang",
        "affiliation": "University of Electronic Science and Technology of China"
      },
      {
        "email": "zoujun@ntu.edu.sg",
        "first": "Jun",
        "last": "Zou",
        "affiliation": "Nanyang Technological University"
      },
      {
        "email": "caih@ime.a-star.edu.sg",
        "first": "Hong",
        "last": "Cai",
        "affiliation": "Institute of Microelectronics, Singapore"
      },
      {
        "email": "hu_xiaolong@qq.com",
        "first": "Xiao Long",
        "last": "Hu",
        "affiliation": "Tsinghua University"
      },
      {
        "email": "jiangc15@mails.tsinghua.edu.cn",
        "first": "Cong",
        "last": "Jiang",
        "affiliation": "Tsinghua University"
      },
      {
        "email": "zhouxq8@mail.sysu.edu.cn",
        "first": "Xiao Qi",
        "last": "Zhou",
        "affiliation": "Sun Yat-sen University"
      },
      {
        "email": "yfjin@pku.edu.cn",
        "first": "Yu Feng",
        "last": "Jin",
        "affiliation": "Peking University"
      },
      {
        "email": "shsun@nudt.edu.cn",
        "first": "Shi Hai",
        "last": "Sun",
        "affiliation": "Sun Yat-sen University"
      },
      {
        "email": "xbwang@mail.tsinghua.edu.cn",
        "first": "Xiang Bin",
        "last": "Wang",
        "affiliation": "Tsinghua University"
      },
      {
        "email": "kwekleongchuan@nus.edu.sg",
        "first": "Leong Chuan",
        "last": "Kwek",
        "affiliation": "National University of Singapore"
      },
      {
        "email": "eaqliu@ntu.edu.sg",
        "first": "Ai Qun",
        "last": "Liu",
        "affiliation": "Nanyang Technological University",
        "contact": true
      }
    ],
    "abstract": "An integrated chip system for MDI-QKD is demonstrated. The MDI-QKD transmitter chips and server chip work on a key rate per pulse of 2.923 × 10^(-6) over a distance corresponding to 50-km optical fiber with 25% detection efficiency.",
    "mergedwith": 105
  },
  {
    "pid": 100,
    "title": "Scalable Pseudorandom Quantum States",
    "authors": [
      {
        "email": "zvika.brakerski@weizmann.ac.il",
        "first": "Zvika",
        "last": "Brakerski",
        "affiliation": "Weizmann Institute of Science",
        "contact": true
      },
      {
        "email": "omrishmueli@mail.tau.ac.il",
        "first": "Omri",
        "last": "Shmueli",
        "affiliation": "Tel Aviv University",
        "contact": true
      }
    ],
    "abstract": "Efficiently sampling a quantum state that is hard to distinguish from a truly random quantum state is an elementary task in quantum information theory that has both computational and physical uses. This is often referred to as pseudorandom (quantum) state generator, or PRS generator for short.\r\n\t\r\n\tIn existing constructions of PRS generators, security scales with the number of qubits in the states, i.e. the (statistical) security parameter for an n-qubit PRS is roughly n.\r\nPerhaps counter-intuitively, n-qubit PRS are not known to imply k-qubit PRS even for k<n. Therefore the question of \\emph{scalability} for PRS was thus far open: is it possible to construct n-qubit PRS generators with security parameter m for all n, m. Indeed, we believe that PRS with tiny (even constant) n and large m can be quite useful.\r\n\t\r\n\tWe resolve the problem in this work, showing that any quantum-secure one-way function implies scalable PRS. We follow the paradigm of first showing a \\emph{statistically} secure construction when given oracle access to a random function, and then replacing the random function with a quantum-secure (classical) pseudorandom function to achieve computational security. However, our methods deviate significantly from prior works since scalable pseudorandom states require randomizing the amplitudes of the quantum state, and not just the phase as in all prior works. We show how to achieve this using Gaussian sampling."
  },
  {
    "pid": 104,
    "title": "Device-independent randomness expansion against quantum side information",
    "authors": [
      {
        "email": "lwz158@mail.ustc.edu.cn",
        "first": "Wen-Zhao",
        "last": "Liu",
        "affiliation": "University of Science and Technology of China",
        "contact": true
      },
      {
        "first": "Ming-Han",
        "last": "Li",
        "affiliation": "University of Science and Technology of China"
      },
      {
        "first": "Sammy",
        "last": "Ragy",
        "affiliation": "University of York"
      },
      {
        "first": "Si-Ran",
        "last": "Zhao",
        "affiliation": "University of Science and Technology of China"
      },
      {
        "first": "Bing",
        "last": "Bai",
        "affiliation": "University of Science and Technology of China"
      },
      {
        "first": "Yang",
        "last": "Liu",
        "affiliation": "University of Science and Technology of China"
      },
      {
        "first": "Peter J.",
        "last": "Brown",
        "affiliation": "University of York"
      },
      {
        "first": "Jun",
        "last": "Zhang",
        "affiliation": "University of Science and Technology of China"
      },
      {
        "first": "Roger",
        "last": "Colbeck",
        "affiliation": "University of York"
      },
      {
        "first": "Jingyun",
        "last": "Fan",
        "affiliation": "Southern University of Science and Technology"
      },
      {
        "first": "Qiang",
        "last": "Zhang",
        "affiliation": "University of Science and Technology of China"
      },
      {
        "first": "Jian-Wei",
        "last": "Pan",
        "affiliation": "University of Science and Technology of China"
      }
    ],
    "abstract": "The ability to produce random numbers that are unknown to any outside party is crucial for many applications. Device-independent randomness generation (DIRNG) allows new randomness to be provably generated, without needing to trust the devices used for the protocol. This provides strong guarantees about the security of the output, but comes at the price of requiring the violation of a Bell inequality to implement. A further challenge is to make the bounds in the security proofs tight enough to allow expansion with contemporary technology. Thus, while randomness has been generated in recent experiments, the amount of randomness consumed in doing so has been too high to certify expansion based on existing theory. Here we present an experiment that demonstrates device-independent randomness expansion (DIRNE), i.e., where the generated randomness surpasses that consumed. By developing a loophole-free Bell test setup with a single photon detection efficiency of around 81% and exploiting a spot-checking protocol, we achieve a net gain of 2.63 × 10^8 certified bits with soundness error 5.74×10^{−8}. The experiment ran for 220 hours corresponding to an average rate of randomness generation of 8202 bits/s. By developing the Entropy Accumulation Theorem (EAT), we established security against quantum adversaries. We anticipate that this work will lead to further improvements that push device-independence towards commercial viability."
  },
  {
    "pid": 105,
    "title": "On-chip Time- and Polarization-Multiplexed Continuous-variable Quantum Key Distribution",
    "authors": [
      {
        "email": "l.cao@pku.edu.cn",
        "first": "CAO",
        "last": "LIN",
        "affiliation": "PEKING UNIVERSITY"
      },
      {
        "email": "wei.luo@ntu.edu.sg",
        "first": "LUO",
        "last": "WEI",
        "affiliation": "Nanyang Techological University",
        "contact": true
      },
      {
        "email": "zoujun@ntu.edu.sg",
        "first": "Zou",
        "last": "Jun",
        "affiliation": "Nanyang Techological University"
      },
      {
        "email": "caih@ime.a-star.edu.sg",
        "first": "Cai",
        "last": "Hong",
        "affiliation": "Institute of Microelectronics, A*STAR"
      },
      {
        "email": "yfjin@pku.edu.cn",
        "first": "Jin",
        "last": "Yufeng",
        "affiliation": "PEKING UNIVERSITY"
      },
      {
        "email": "kwekleongchuan@nus.edu.sg",
        "first": "Leong Chuan",
        "last": "Kwek",
        "affiliation": "Nanyang Technological University"
      },
      {
        "email": "EAQLiu@ntu.edu.sg",
        "first": "Liu Ai",
        "last": "Qun",
        "affiliation": "Nanyang Technological University",
        "contact": true
      },
      {
        "email": "yusong@bupt.edu.cn",
        "first": "Yu",
        "last": "Song",
        "affiliation": "Beijing University of Posts and Telecommunications"
      }
    ],
    "abstract": "An integrated chip platform for CV-QKD system based on time and polarization multiplexing is designed and demonstrated. A proof-of-principle test is conducted, which shows the measurement results for key components. The secure key rate by simulation can reach 4 kbit/s at 40 km distance per transmission band.",
    "mergedwith": 99
  }
]
