[
  {
    "pid": 7,
    "title": "Twin-field quantum digital signatures",
    "authors": [
      {
        "email": "zhengdayan.25@163.com",
        "first": "Chun-Hui",
        "last": "Zhang",
        "affiliation": "Nanjing University of Posts and Telecommunications",
        "contact": true
      },
      {
        "email": "3202731898@qq.com",
        "first": "Yu-Teng",
        "last": "Fan",
        "affiliation": "Nanjing University of Posts and Telecommunications"
      },
      {
        "email": "cmz@njupt.edu.cn",
        "first": "Chun-Mei",
        "last": "Zhang",
        "affiliation": "Nanjing University of Posts and Telecommunications"
      },
      {
        "email": "gcguo@ustc.edu.cn",
        "first": "Guang-Can",
        "last": "Guo",
        "affiliation": "Nanjing University of Posts and Telecommunications"
      },
      {
        "email": "qinw@njupt.edu.cn",
        "first": "Qin",
        "last": "Wang",
        "affiliation": "Nanjing University of Posts and Telecommunications",
        "contact": true
      }
    ],
    "abstract": "At present, the performance of quantum digital signatures (QDSs) is limited by key generation protocols (e.g., BB84 or measurement-device-independent protocols), which are fundamentally limited in terms of channel capacity. Fortunately, the recently proposed twin-field quantum key distribution can overcome this limit. Here, we for the first time propose a twin-field QDS (TF-QDS) protocol and give a corresponding security analysis. It can not only possess the highest security among all existing QDS protocols, but also exhibit outstanding performance in terms of both signature rates and secure transmission distances. Therefore, our work represents another step towards practical implementation of QDSs.",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-64dbaa7602b3e43d12f2424c176416f68e9c1d5177344efe124810cea6280b50",
        "timestamp": 1584684588,
        "size": 212575,
        "filename": "TFQDS_full version.pdf"
      },
      "student-paper": true,
      "arxiv-id": "2003.11262",
      "morning-session": true,
      "afternoon-session": false
    }
  },
  {
    "pid": 9,
    "title": "Secure random number generation from parity symmetric radiations",
    "authors": [
      {
        "email": "Tsurumaru.Toyohiro@da.MitsubishiElectric.co.jp",
        "first": "Toyohiro",
        "last": "Tsurumaru",
        "affiliation": "Mitsubishi Electric Corporation",
        "contact": true
      },
      {
        "email": "sasaki@qi.t.u-tokyo.ac.jp",
        "first": "Toshihiko",
        "last": "Sasaki",
        "affiliation": "The University of Tokyo"
      },
      {
        "email": "izumi.tsutsui@kek.jp",
        "first": "Izumi",
        "last": "Tsutsui",
        "affiliation": "High Energy Accelerator Research Organization (KEK)"
      }
    ],
    "abstract": "The random number generators (RNGs) are an indispensable tool in cryptography.\r\nOf various types of RNG method, those using radiations from nuclear decays (radioactive RNG) has a relatively long history but their security has never been discussed rigorously in the literature.\r\nIn this paper and in reference [T. Tsurumaru, T. Sasaki, and I. Tsutsui, arXiv:1912.09124 [quant-ph]], we propose a new method of the radioactive RNG that admits a simple and rigorous proof of security.\r\nThe security proof is made possible here by exploiting the parity (space inversion) symmetry arising in the device, which has previously been unfocused but is generically available for a nuclide which decays by parity-conserving interactions.",
    "options": {
      "student-paper": false,
      "name-main-presenter": "Toyohiro Tsurumaru",
      "arxiv-id": "1912.09124",
      "morning-session": true,
      "afternoon-session": false
    }
  },
  {
    "pid": 11,
    "title": "Semi-Quantum Money",
    "authors": [
      {
        "email": "roy.radian@gmail.com",
        "first": "Roy",
        "last": "Radian",
        "affiliation": "Ben Gurion University of the Negev",
        "contact": true
      },
      {
        "email": "sattath@gmail.com",
        "first": "Or",
        "last": "Sattath",
        "affiliation": "Ben Gurion University of the Negev",
        "contact": true
      }
    ],
    "abstract": "Quantum money allows a bank to mint quantum money states that can later be verified and cannot be forged. Usually, this requires a quantum communication infrastructure to transfer quantum states between the user and the bank. This work combines the notion of classical verification -- introduced by Gavinsky (CCC 2012) -- with the notion of user-generated money -- introduced here -- to introduce Semi-Quantum Money, the first quantum money scheme to require only classical communication with the (entirely classical) bank. This work features constructions for both a public memory-dependent semi-quantum money scheme, based on the works of Zhandry and Coladangelo, and for a private memoryless semi-quantum money scheme, based on the notion of Noisy Trapdoor Claw Free Functions (NTCF) introduced by Brakerski et al. (FOCS 2018).\r\nIn terms of technique, our main contribution is a strong parallel repetition theorem for NTCF.",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-d48f5126d5322b200e71e2b76f0df3b636d8d49aa9b038051e47d12210dab4ff",
        "timestamp": 1586848957,
        "size": 1033971,
        "filename": "Semi_quantum_money.pdf"
      },
      "student-paper": false,
      "name-main-presenter": "Roy Radian",
      "arxiv-id": "1908.08889",
      "morning-session": true,
      "afternoon-session": false
    }
  },
  {
    "pid": 12,
    "title": "Security of quantum key distribution with detection-efficiency mismatch in the multiphoton case",
    "authors": [
      {
        "email": "trushechkin@mi-ras.ru",
        "first": "Anton",
        "last": "Trushechkin",
        "affiliation": "Steklov Mathematical Institute of Russian Academy of Sciences",
        "contact": true
      }
    ],
    "abstract": "The detection-efficiency mismatch is a common problem in practical quantum key distribution (QKD) systems. The security of quantum key distribution in this case is proved only under the assumption that either the output of the sender side or the input to the receiver side are single-photon signals, which impose a restriction over the class of possible eavesdropping strategies. Here we present a security proof without such a restriction and, thus, solve this important problem and prove the security of quantum key distribution with detection-efficiency mismatch against general attacks. In particular, we propose an adaptation of the decoy state method to the case of detection-efficiency mismatch.",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-fb3a798ef9077995c6f064b1437a1683789ac5cd60997a70c7fe580ef18a7b08",
        "timestamp": 1587207291,
        "size": 519703,
        "filename": "Trushechkin-Detection-efficiency-mismatch.pdf"
      },
      "student-paper": false,
      "name-main-presenter": "Anton Trushechkin",
      "arxiv-id": "2004.07809",
      "morning-session": true,
      "afternoon-session": true
    }
  },
  {
    "pid": 13,
    "title": "Quantum Period Finding is Compression Robust",
    "authors": [
      {
        "email": "alex.may@rub.de",
        "first": "Alex",
        "last": "May",
        "affiliation": "Ruhr university Bochum",
        "contact": true
      },
      {
        "email": "lars.schlieper@rub.de",
        "first": "Lars",
        "last": "Schlieper",
        "affiliation": "Ruhr university Bochum",
        "contact": true
      }
    ],
    "abstract": "We study quantum period finding algorithms such as Simon and Shor (and its variants Ekerå-Håstad and Mosca-Ekert). For a periodic function $f$ these algorithms produce -- via some quantum embedding of $f$ -- a quantum superposition $\\sum_x \\ket{x}\\ket{f(x)}$, which requires a certain amount of output qubits that represent $\\ket{f(x)}$. We show that one can lower this amount to a single output qubit by hashing $f$ down to a single bit in an oracle setting.\r\n\t\t\r\nNamely, we replace the embedding of $f$ in quantum period finding circuits by oracle access to several embeddings of hashed versions of $f$. We show that on expectation this modification only doubles the required amount of  quantum measurements, while significantly reducing the total number of qubits. For example, for Simon's period finding algorithm in some $n$-bit function $f: \\mathbb{F}_2^n \\rightarrow \\mathbb{F}_2^n$ our hashing technique reduces the required output qubits from $n$ down to $1$, and therefore the total amount of qubits from $2n$ to $n+1$. We also show that Simon's algorithm admits real world applications with only $n+1$ qubits by giving a concrete realization of a hashed version of the cryptographic Even-Mansour construction.\r\n\t\t\r\nOur oracle-based hashed version of the Ekerå-Håstad algorithm for factoring $n$-bit RSA reduces the required qubits from $(\\frac 3 2 + o(1))n$ down to $(\\frac 1 2 + o(1))n$. In principle our hashing approach also works for the Mosca-Ekert algorithm, but requires strong properties of the hash function family. A hashed version of Mosca-Ekert with as few as $\\mathcal{O}(\\log n)$ qubits would imply classical polynomial time factoring.\r\n\r\nkeywords: Quantum period finding, Simon, Even-Mansour, Shor, Ekerå -Håstad, Mosca-Ekert, minimizing qubits",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-80addedc2c96c712b035904d7597fac13f6f5dc0d12381d7ea41b6bb6a14358d",
        "timestamp": 1584958563,
        "size": 689780,
        "filename": "paper.pdf"
      },
      "student-paper": false,
      "name-main-presenter": "Lars Schlieper",
      "arxiv-id": "1905.10074",
      "morning-session": true,
      "afternoon-session": true
    }
  },
  {
    "pid": 14,
    "title": "Noisy Simon Period Finding",
    "authors": [
      {
        "email": "alex.may@rub.de",
        "first": "Alex",
        "last": "May",
        "affiliation": "Ruhr University Bochum",
        "contact": true
      },
      {
        "email": "lars.schlieper@rub.de",
        "first": "Lars",
        "last": "Schlieper",
        "affiliation": "Ruhr University Bochum",
        "contact": true
      },
      {
        "email": "jonathan.schwinger@rub.de",
        "first": "Joanthan",
        "last": "Schwinger",
        "affiliation": "Ruhr University Bochum"
      }
    ],
    "abstract": "Let $f: \\mathbb{F}_2^n \\rightarrow \\mathbb{F}_2^n$ be a Boolean function with period $\\vec s$. It is well-known that Simon's algorithm finds $\\vec s$ in time polynomial in $n$ on quantum devices that are capable of performing error-correction. However, today's quantum devices are inherently noisy, too limited for error correction, and Simon's algorithm is not error-tolerant.\r\n\r\nWe show that even noisy quantum period finding computations lead to speedups in comparison to purely classical computations. More precisely, we implemented Simon's quantum period finding circuit on the $15$-qubit quantum device IBM Q 16 Melbourne. Our experiments show that with a certain probability $\\tau(n)$ we measure erroneous vectors that are not orthogonal to $\\vec s$. We propose new, simple, but very effective smoothing techniques to classically mitigate physical noise effects such as e.g. IBM Q's bias towards the $0$-qubit.\r\n\r\nAfter smoothing, our noisy quantum device provides us a statistical distribution that we can easily transform into an LPN instance with parameters $n$ and $\\tau(n)$. Hence, in the noisy case we may not hope to find periods in time polynomial in $n$. However, we still obtain quantum advantage even for large errors $\\tau(n)$ close to $\\frac 1 2$. Thus, period finding does not necessarily require full quantum error correction capability.\r\n\r\nkeywords: Noise-tolerant Simon period finding, IBM Q 16, LPN algorithms, quantum advantage",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-4b68ebd99f3f132966a26ed08b14206c9b323a7ff834e600e6150d4d7c3f94dc",
        "timestamp": 1584958963,
        "size": 1114300,
        "filename": "noisy_simon.pdf"
      },
      "student-paper": false,
      "name-main-presenter": "Lars Schlieper",
      "arxiv-id": "1910.00802",
      "morning-session": true,
      "afternoon-session": true
    }
  },
  {
    "pid": 22,
    "title": "Full quantum one-way function for quantum cryptography",
    "authors": [
      {
        "email": "shangtao@buaa.edu.cn",
        "first": "Tao",
        "last": "Shang",
        "affiliation": "Beihang University",
        "contact": true
      },
      {
        "email": "tangyao_shirley@126.com",
        "first": "Yao",
        "last": "Tang",
        "affiliation": "Beihang University",
        "contact": true
      },
      {
        "email": "yiliu_cr@buaa.edu.cn",
        "first": "Ranyiliu",
        "last": "Chen",
        "affiliation": "Beihang University"
      },
      {
        "email": "liujianwei@buaa.edu.cn",
        "first": "Jianwei",
        "last": "Liu",
        "affiliation": "Beihang University"
      }
    ],
    "abstract": "One-way functions are fundamental tools for cryptography. Until now, quantum one-way functions have several input-output categories such as `classical-to-classical', `classical-to-quantum' and `quantum-to-classical', which are used for post-quantum cryptography or quantum cryptography. However, there are still no intrinsic `quantum-to-quantum' quantum one-way functions. In this paper, we propose the full quantum one-way function to design full quantum cryptographic schemes. By concatenating the `quantum-classical' one-way function and the rotation operation of a single qubit, the full quantum one-way function has the input and output of quantum states. We prove its one-way property from `easy computation' and `computationally difficult to invert'. Then we apply the full quantum one-way function to quantum identity authentication. Security analysis shows that the proposed quantum identity authentication scheme based on the full quantum one-way function is secure even under active attacks.",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-f15b2cf2720f68b3c3d668b000f385c07d997d1db07fee7a31ae040d5ed64270",
        "timestamp": 1586312305,
        "size": 333937,
        "filename": "QE.pdf"
      },
      "student-paper": false,
      "name-main-presenter": "Tao Shang, Yao Tang",
      "morning-session": true,
      "afternoon-session": false
    }
  },
  {
    "pid": 23,
    "title": "IND-secure quantum symmetric encryption based on point obfuscation",
    "authors": [
      {
        "email": "yiliu_cr@buaa.edu.cn",
        "first": "Ranyiliu",
        "last": "Chen",
        "affiliation": "Beihang University"
      },
      {
        "email": "shangtao@buaa.edu.cn",
        "first": "Tao",
        "last": "Shang",
        "affiliation": "Beihang University",
        "contact": true
      },
      {
        "email": "liujianwei@buaa.edu.cn",
        "first": "Jianwei",
        "last": "Liu",
        "affiliation": "Beihang University"
      }
    ],
    "abstract": "Quantum cryptography has developed some fundamental primitives on encryption of quantum data, such as quantum one-time pad and quantum IND (indistinguishability)-security. Compared with other terms in quantum cryptography, quantum obfuscation attracts less attention and is still in its infancy due to its difficulty in implementation and application. In this paper, we define a quantum point function and construct its obfuscation, then demonstrate the validity of applying quantum point obfuscation to quantum symmetric encryption scheme. We rigorously prove that IND-secure quantum symmetric encryption can be realized by quantum point obfuscators. Furthermore, with the properties of combinability or auxiliary inputs, a quantum point obfuscator can implement IND-CPA (indistinguishability under chosen plaintext attack)-secure quantum symmetric encryption or leakage-resilient quantum symmetric encryption, respectively. This work presents new usage of a quantum obfuscator and will complement the theory of quantum obfuscation.",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-10a6fd8ee1c413e6a21d21588b76c6bc32bf7cb73bbb0123144e7d483e9e5b26",
        "timestamp": 1586312894,
        "size": 701162,
        "filename": "QIP.pdf"
      },
      "student-paper": false,
      "morning-session": false,
      "afternoon-session": false
    }
  },
  {
    "pid": 24,
    "title": "The Improvement of Security for Continuous-Variable Quantum Key Distribution with Imperfect Phase Modulation",
    "authors": [
      {
        "email": "caozhw@nwu.edu.cn",
        "first": "Zhengwen",
        "last": "Cao",
        "affiliation": "School of Information Science and Technology, Northwest University Xi’an, 710127, China",
        "contact": true
      },
      {
        "email": "chenhaozhang@stumail.nwu.edu.cn",
        "first": "Chenhao",
        "last": "Zhang",
        "affiliation": "School of Information Science and Technology, Northwest University Xi’an, 710127, China"
      },
      {
        "email": "chaigeng2011@hotmail.com",
        "first": "Geng",
        "last": "Chai",
        "affiliation": "School of Information Science and Technology, Northwest University Xi’an, 710127, China"
      },
      {
        "email": "Chenhe@ece.ubc.ca",
        "first": "Chen",
        "last": "He",
        "affiliation": "School of Information Science and Technology, Northwest University Xi’an, 710127, China"
      }
    ],
    "abstract": "The signal of the photon must be phase modulated by Phase Modulation(PM), which plays a very important role in a continuous-variable quantum key distribution system. However, there may exits a drift of voltage in actual system. In this paper, we study the influence of the imperfect PM on the system performance of the CVQKD system. The result shows that the imperfect PM can threat the security of CVQKD system and choosing a reasonable noise module can be passively improved the security of system. We also propose a way to contain modulation noise in practical CVQKD systems.",
    "options": {
      "student-paper": true,
      "name-main-presenter": "Zhengwen Cao",
      "morning-session": true,
      "afternoon-session": false
    }
  },
  {
    "pid": 26,
    "title": "Quantum key distribution overcoming extreme noise:simultaneous subspace coding using high-dimensional entanglement",
    "authors": [
      {
        "email": "mirdit.doda@gmail.com",
        "first": "Mirdit",
        "last": "Doda",
        "affiliation": "Institute for Quantum Optics and Quantum Information - IQOQI Vienna; Institute of Physics, Slovak Academy of Sciences, Bratislava, Slovakia",
        "contact": true
      },
      {
        "email": "entangledanarchist@gmail.com",
        "first": "Marcus",
        "last": "Huber",
        "affiliation": "nstitute for Quantum Optics and Quantum Information - IQOQI Vienna,Austrian Academy of Sciences, Boltzmanngasse 3, 1090 Vienna, Austria",
        "contact": true
      },
      {
        "email": "glauciamg.fis@gmail.com",
        "first": "Gláucia",
        "last": "Murta",
        "affiliation": "Institut f ̈ur Theoretische Physik III, Heinrich-Heine-Universit ̈at D ̈usseldorf,Universit ̈atsstraße 1, D-40225 D ̈usseldorf, Germany",
        "contact": true
      },
      {
        "email": "pivoluskamatej@gmail.com",
        "first": "Matej",
        "last": "Pivoluska",
        "affiliation": "Institute of Physics, Slovak Academy of Sciences, 845 11 Bratislava, Slovakia; Institute of Computer Science, Masaryk University, 602 00 Brno, Czech Republic",
        "contact": true
      },
      {
        "email": "martin.plesch@savba.sk",
        "first": "Martin",
        "last": "Plesch",
        "affiliation": "Institute of Physics, Slovak Academy of Sciences, 845 11 Bratislava, Slovakia; Institute of Computer Science, Masaryk University, 602 00 Brno, Czech Republic",
        "contact": true
      },
      {
        "email": "Chrysoula.Vlachou@ulb.ac.be",
        "first": "Chrysoula",
        "last": "Vlachou",
        "affiliation": "Center for Quantum Information and Communication - QuIC,Universit ́e libre de Bruxelles, Brussels, Belgium",
        "contact": true
      }
    ],
    "abstract": "High-dimensional entanglement promises to increase the information capacity of photons and isnow routinely generated exploiting spatio-temporal degrees of freedom of single photons.  A curiousfeature of these systems is the possibility to certify entanglement despite strong noise in the data.We show that it is also possible to exploit this noisy entanglement by introducing a protocol thatuses mutliple subspaces of the high-dimensional system simultaneously.  Our protocol can be used toincrease key rates in realistic conditions.  To that end, we conduct two simulations of our protocol fornoise models that apply to the two most commonly used sources of high-dimensional entanglement:time-bins and spatial modes.",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-b7c199f45e7b2661ed1b739ea672a98fee3afb1e857936459040ca31df2187ef",
        "timestamp": 1587205553,
        "size": 3725910,
        "filename": "Subsapce_QKD.pdf"
      },
      "student-paper": false,
      "name-main-presenter": "Chrysoula Vlachou",
      "arxiv-id": "2004.12824",
      "morning-session": true,
      "afternoon-session": true
    }
  },
  {
    "pid": 27,
    "title": "Capacity of Quantum Private Information Retrieval with Colluding Servers",
    "authors": [
      {
        "email": "m17021a@math.nagoya-u.ac.jp",
        "first": "Seunghoan",
        "last": "Song",
        "affiliation": "Nagoya University",
        "contact": true
      },
      {
        "email": "hayashi@sustech.edu.cn",
        "first": "Masahito",
        "last": "Hayashi",
        "affiliation": "Southern University of Science and Technology",
        "contact": true
      }
    ],
    "abstract": "Quantum private information retrieval (QPIR) is a protocol that a user retrieves one of f files from non- communicating n servers by downloading quantum systems without revealing the identity of the target file. As variants of the QPIR with stronger security requirements, the symmetric QPIR is a protocol that the files except for the target file are not leaked to the user, and the t-private QPIR is a protocol that the identity of the target file is kept secret even if at most t servers may collude to reveal the identity. The QPIR capacity is the maximum ratio of the one file size to the size of downloaded quantum systems, and we prove that the symmetric t-private QPIR capacity is min{1, 2(n − t)/n} for any 1 ≤ t < n. We construct a capacity-achieving QPIR protocol by the stabilizer formalism and prove the optimality of our protocol. The proposed capacity is greater than the classical counterpart.",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-b4c9a708ddf0b1600a5d2640aca56e12531d634d42e2d3e5299f29265ee58d5e",
        "timestamp": 1587134035,
        "size": 398254,
        "filename": "t_colludePIR_arxiv_v2-3.pdf"
      },
      "student-paper": true,
      "name-main-presenter": "Seunghoan Song",
      "arxiv-id": "2001.04436",
      "morning-session": true,
      "afternoon-session": true
    }
  },
  {
    "pid": 33,
    "title": "Using QKD in MACsec for Secure Ethernet Networks",
    "authors": [
      {
        "email": "jcho@adva.com",
        "first": "Joo Yeon",
        "last": "Cho",
        "affiliation": "ADVA Optical Networking SE",
        "contact": true
      },
      {
        "email": "Asergeev@adva.com",
        "first": "Andrew",
        "last": "Sergeev",
        "affiliation": "ADVA Optical Networking SE"
      }
    ],
    "abstract": "MACsec (Media Access Control Security) is an IEEE 802.1AE standard for secure communication on Ethernet links. MACsec ensures the confidentiality, integrity and origin authenticity of Ethernet frames. The secrecy of MACsec stems from a root key that is either configured as a pre-shared key or derived from a mutual authentication protocol. However, both methods are not ideal because such root key may be disclosed by human mistakes or broken by quantum attacks. In this paper, we investigate QKD (quantum key distribution) as an alternative source of trust for MACsec. QKD can be used as either a root key provider or a session key generator. We develop a new key exchange protocol based on QKD for Ethernet networks. We verified by experiment that QKD could be well integrated into MACsec without performance degradation.",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-11e33aa130f8d9ed48e7d9dd88fa3741dae81c9629c545ac26aab39a249a4210",
        "timestamp": 1586895491,
        "size": 503623,
        "filename": "qcrypt-macsec.pdf"
      },
      "student-paper": false,
      "name-main-presenter": "Joo Yeon Cho",
      "morning-session": true,
      "afternoon-session": true
    }
  },
  {
    "pid": 34,
    "title": "Almost Public Quantum Coins",
    "authors": [
      {
        "email": "behera@post.bgu.ac.il",
        "first": "Amit",
        "last": "Behera",
        "affiliation": "Ben-Gurion University of the Negev",
        "contact": true
      },
      {
        "email": "sattath@gmail.com",
        "first": "Or",
        "last": "Sattath",
        "affiliation": "Ben-Gurion University of the Negev",
        "contact": true
      }
    ],
    "abstract": "In a quantum money scheme, a bank can issue money that users cannot counterfeit. Similar to bills of paper money, most quantum money schemes assign a unique serial number to each money state, thus potentially compromising the privacy of the users of quantum money. However in a quantum coins scheme, just like the traditional currency coin scheme, all the money states are exact copies of each other, providing a better level of privacy for the users.\r\nA quantum money scheme can be private, i.e., only the bank can verify the money states, or public, meaning anyone can verify. In this work, we propose a way to lift any private quantum coin scheme -- which is known to exist based on the existence of one-way functions, due to Ji, Liu, and Song (CRYPTO'18) -- to a scheme that closely resembles a public quantum coin scheme. Verification of a new coin is done by comparing it to the coins the user already possesses, by using a projector on to the symmetric subspace. No public coin scheme was known prior to this work. It is also the first construction that is very close to a public quantum money scheme and is provably secure based on standard assumptions. The lifting technique when instantiated with the private quantum coins scheme, due to Mosca and Stebila 2010, gives rise to the first construction that is very close to an inefficient unconditionally secure public quantum money scheme.",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-919cb1fde03528999832122c8cd0a745a0a7fe4ba50e82bdb3371cea8bf89e21",
        "timestamp": 1587171870,
        "size": 907021,
        "filename": "Public_quantum_coins_submission_qcrypt2020_4.pdf"
      },
      "student-paper": true,
      "name-main-presenter": "Amit Behera",
      "arxiv-id": "2002.12438",
      "morning-session": true,
      "afternoon-session": false
    }
  },
  {
    "pid": 39,
    "title": "Provably secure symmetric private information retrieval with quantum cryptography",
    "authors": [
      {
        "email": "wkon01@u.nus.edu",
        "first": "Wen Yu",
        "last": "Kon",
        "affiliation": "National University of Singapore",
        "contact": true
      },
      {
        "email": "charles.lim@nus.edu.sg",
        "first": "Charles Ci Wen",
        "last": "Lim",
        "affiliation": "National University of Singapore",
        "contact": true
      }
    ],
    "abstract": "Private information retrieval (PIR) is a database query protocol that provides user privacy, in that the user can learn a particular entry of the database of his interest but his query would be hidden from the data centre. Symmetric private information retrieval (SPIR) takes PIR further by additionally offering database privacy, where the user cannot learn any additional entries of the database. Unconditionally secure SPIR solutions with multiple databases are known classically, but are unrealistic because they require long shared secret keys between the parties for secure communication and shared randomness in the protocol. Here, we propose using quantum key distribution (QKD) instead for a practical implementation, which can realise both the secure communication and shared randomness requirements. We prove that QKD maintains the security of the SPIR protocol and that it is also secure against any external eavesdropper. We also show how such a classical-quantum system could be implemented practically, using the example of a two-database SPIR protocol with keys generated by measurement device-independent QKD. Through key rate calculations, we show that such an implementation is feasible at the metropolitan level with current QKD technology.",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-bfb3857e360d18b479203166b1ceef987637e1e9ceb736b13e15b666f2b4ae02",
        "timestamp": 1587190164,
        "size": 713556,
        "filename": "Manuscript.pdf"
      },
      "student-paper": true,
      "name-main-presenter": "Wen Yu Kon",
      "arxiv-id": "2004.13921",
      "morning-session": true,
      "afternoon-session": true
    }
  },
  {
    "pid": 42,
    "title": "Tools for the Performance Optimization of Single-Photon Quantum Key Distribution",
    "authors": [
      {
        "email": "t.kupko@tu-berlin.de",
        "first": "Timm",
        "last": "Kupko",
        "affiliation": "Technische Universität Berlin",
        "contact": true
      },
      {
        "email": "helversen@mailbox.tu-berlin.de",
        "first": "Martin v.",
        "last": "Helversen",
        "affiliation": "Technische Universität Berlin"
      },
      {
        "email": "lucas.rickert@tu-berlin.de",
        "first": "Lucas",
        "last": "Rickert",
        "affiliation": "Technische Universität Berlin"
      },
      {
        "email": "andre.strittmatter@ovgu.de",
        "first": "André",
        "last": "Strittmatter",
        "affiliation": "Otto-von-Guericke Universität Magdeburg"
      },
      {
        "email": "manuel.gschrey@gmail.com",
        "first": "Manuel",
        "last": "Gschrey",
        "affiliation": "Technische Universität Berlin"
      },
      {
        "email": "srodt@physik.tu-berlin.de",
        "first": "Sven",
        "last": "Rodt",
        "affiliation": "Technische Universität Berlin"
      },
      {
        "email": "stephan.reitzenstein@physik.tu-berlin.de",
        "first": "Stephan",
        "last": "Reitzenstein",
        "affiliation": "Technische Universität Berlin"
      },
      {
        "email": "tobias.heindel@tu-berlin.de",
        "first": "Tobias",
        "last": "Heindel",
        "affiliation": "Technische Universität Berlin",
        "contact": true
      }
    ],
    "abstract": "Solid-state quantum light sources emitting triggered single photons or entangled photon pairs have the potential to boost the performance of quantum key distribution (QKD) systems. Proof-of-principle experiments affirmed these prospects, but further efforts are necessary to push this field beyond its current status. In this work, we report on tools for the performance optimization of QKD systems using single-photon sources (SPSs). For this purpose, we developed a basic QKD testbed comprising a triggered solid-state single-photon source and a receiver module designed for four-state polarization coding via the BB84 protocol. Exploiting temporal filtering of the signal acceptance time window in a two-dimensional parameter space we analyze the sifted key fraction and the quantum bit error ratio (QBER) expected in in full implementations of QKD. Furthermore, we demonstrate real-time security monitoring by analyzing the QBER and the photon statistics, in terms of g(2)(\\tau), inside the quantum channel in real-time during the key distribution process. This is achieved by correlating the photon flux recorded at the four ports of our receiver. Our findings can be directly applied and extended for advanced schemes of quantum communication representing an important contribution towards the development of QKD-secured communication networks based on quantum light sources.",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-a71ea2959a54348b2a95bca10534bb520a23092933531b207875aea8d67aebf1",
        "timestamp": 1587049367,
        "size": 1896854,
        "filename": "Kupko_et_al_npjQI_s41534-020-0262-8.pdf"
      },
      "student-paper": true,
      "name-main-presenter": "Timm Kupko",
      "arxiv-id": "1908.02672",
      "morning-session": true,
      "afternoon-session": true
    }
  },
  {
    "pid": 43,
    "title": "Protecting QKD sources against light-injection attacks",
    "authors": [
      {
        "email": "dariaruzh@yandex.ru",
        "first": "Daria",
        "last": "Ruzhitskaya",
        "affiliation": "Russian Quantum Center"
      },
      {
        "email": "nastya-aleksi@mail.ru",
        "first": "Anastasiya",
        "last": "Ponosova",
        "affiliation": "Russian Quantum Center"
      },
      {
        "email": "friederike.johlinger@bristol.ac.uk",
        "first": "Friederike",
        "last": "Johlinger",
        "affiliation": "University of Bristol",
        "contact": true
      },
      {
        "email": "poompong.ch@gmail.com",
        "first": "Poompong",
        "last": "Chaiwongkhot",
        "affiliation": "University of Waterloo"
      },
      {
        "email": "egorovvl@gmail.com",
        "first": "Vladimir",
        "last": "Egorov",
        "affiliation": "ITMO University"
      },
      {
        "email": "djeylan.aktas@bristol.ac.uk",
        "first": "Djeylan",
        "last": "Aktas",
        "affiliation": "University of Bristol"
      },
      {
        "email": "John.Rarity@bristol.ac.uk",
        "first": "John",
        "last": "Rarity",
        "affiliation": "University of Bristol",
        "contact": true
      },
      {
        "email": "cerven@iqc.ca",
        "first": "Chris",
        "last": "Erven",
        "affiliation": "University of Bristol"
      },
      {
        "email": "makarov@vad1.com",
        "first": "Vadim",
        "last": "Makarov",
        "affiliation": "Russian Quantum Center",
        "contact": true
      },
      {
        "email": "angelhuang.hn@gmail.com",
        "first": "Anqi",
        "last": "Huang",
        "affiliation": "National University of Defense Technology",
        "contact": true
      }
    ],
    "abstract": "In the age of measurement-device-independent quantum key distribution (MDI QKD) and twin-\ffield QKD (TF QKD), the source units of these QKD schemes may become a new ``Achilles' heel\" of the whole system. An adversary, Eve, can conduct various attacks on the sources by injecting lasers, whose power is limited by the laser-induced damage threshold of the quantum channel. Such an amount of power may modify the characteristics of components in a source. In this work, we study possible components to protect the source from the light-injected attacks, i.e., Trojan-horse attack, the laser-seeding attack, and the laser-damage attack. Experimental testing shows that fiber-optics isolators and circulators are good passive countermeasures because they sacrifice themselves' isolation under a high-power laser to protect other components behind them. Moreover, we find that illuminated by the high-power laser, integrated photonics QKD chips only lose the transmission of the coupler before any other change happens for the other components in the chips.",
    "options": {
      "student-paper": true,
      "name-main-presenter": "Anqi Huang",
      "morning-session": true,
      "afternoon-session": false
    }
  },
  {
    "pid": 47,
    "title": "Independent security analysis of a commercial quantum random number generator Quantis from ID Quantique",
    "authors": [
      {
        "email": "petrov-ma@yandex.ru",
        "first": "Mikhail",
        "last": "Petrov",
        "contact": true
      },
      {
        "email": "radigvas@gmail.com",
        "first": "Igor",
        "last": "Radchenko"
      },
      {
        "email": "damian@damiansteiger.ch",
        "first": "Damian",
        "last": "Steiger"
      },
      {
        "email": "renner@ethz.ch",
        "first": "Renato",
        "last": "Renner"
      },
      {
        "email": "mtroyer@microsoft.com",
        "first": "Matthias",
        "last": "Troyer"
      },
      {
        "email": "makarov@vad1.com",
        "first": "Vadim",
        "last": "Makarov",
        "contact": true
      }
    ],
    "abstract": "We reverse-engineer, test and analyse hardware and firmware of the commercial quantum-optical random number generator Quantis from ID Quantique. We show that > 99% of its output data originates in physically random processes: random timing of photon absorption in a semiconductor material, and random growth of avalanche owing to impact ionisation. We have also found minor non-random contributions from imperfections in detector electronics and an internal processing algorithm. Our work shows that the design quality of a commercial quantum-optical randomness source can be verified without cooperation of the manufacturer and without access to the engineering documentation.",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-45a35dc1a6305e5eb851be7f50a41cf46da6522f290bb6ceef5521a756eaf8a2",
        "timestamp": 1587059945,
        "size": 2563732,
        "filename": "arXiv2004.04996v1 [quant-ph].pdf"
      },
      "student-paper": false,
      "name-main-presenter": "Mikhail Petrov",
      "arxiv-id": "arXiv:2004.04996 [quant-ph]",
      "morning-session": true,
      "afternoon-session": false
    }
  },
  {
    "pid": 50,
    "title": "Composable Security for Multipartite Entanglement Verification",
    "authors": [
      {
        "email": "raja.yehia@lip6.fr",
        "first": "Raja",
        "last": "Yehia",
        "affiliation": "LIP6, Sorbonne Université",
        "contact": true
      },
      {
        "email": "eleni.diamanti@lip6.fr",
        "first": "Eleni",
        "last": "Diamanti",
        "affiliation": "LIP6, CNRS, Sorbonne Université",
        "contact": true
      },
      {
        "email": "jkeren@gmail.com",
        "first": "Iordanis",
        "last": "Kerenidis",
        "affiliation": "IRIF, CNRS, Université de Paris",
        "contact": true
      }
    ],
    "abstract": "We present a composably secure protocol allowing n parties to test an\r\nentanglement generation resource controlled by a possibly dishonest party. The test\r\nconsists only in local quantum operations and authenticated classical communication\r\nonce a state is shared among them and provides composable security, namely it can be\r\nused as a secure subroutine by n honest parties within larger communication protocols\r\nto test if a source is sharing quantum states that are at least Ɛ-close to the GHZ state.\r\nThis claim comes on top of previous results on multipartite entanglement verification\r\nwhere the security was studied in the usual game-based model. Here, we improve the\r\nprotocol to make it more suitable for practical use in a quantum network and we study\r\nits security in the Abstract Cryptography framework to highlight composability issues\r\nand avoid hidden assumptions. This framework is a top-to-bottom theory that makes\r\nexplicit any piece of information that each component (party or resource) gets at every\r\ntime-step of the protocol. Moreover any security proof, which amounts to showing\r\nindistinguishability between an ideal resource having the desired security properties (up\r\nto local simulation) and the concrete resource representing the protocol, is composable\r\nfor free in this setting. This allows us to readily compose our basic protocol in order to\r\ncreate a composably secure multi-round protocol enabling honest parties to obtain a\r\nstate close to a GHZ state or an abort signal, even in the presence of a noisy or malicious\r\nsource. Our protocol can typically be used as a subroutine in a Quantum Internet, to\r\nsecurely share a GHZ state among the network before performing a communication or\r\ncomputation protocol.",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-9907193bc904e89877a722714ec0a69e2af33fc8079bcf2e6066c52848fa1991",
        "timestamp": 1587089406,
        "size": 920005,
        "filename": "Composable Security for Multipartite Entanglement Verification.pdf"
      },
      "student-paper": true,
      "name-main-presenter": "Raja Yehia",
      "arxiv-id": "2004.07679",
      "morning-session": true,
      "afternoon-session": false
    }
  },
  {
    "pid": 53,
    "title": "Characterising the photon-number distribution of quantum channels with double-decoy method and its application to quantum cryptography",
    "authors": [
      {
        "email": "emilien.lavie@u.nus.edu",
        "first": "Emilien",
        "last": "Lavie",
        "affiliation": "NUS/ECE Singapore"
      },
      {
        "email": "william_primaatmaja@u.nus.edu",
        "first": "Ignatius William",
        "last": "Primaatmaja",
        "affiliation": "NUS/CQT Singapore",
        "contact": true
      },
      {
        "email": "charles.lim@nus.edu.sg",
        "first": "Charles Ci Wen",
        "last": "Lim",
        "affiliation": "NUS/ECE Singapore",
        "contact": true
      }
    ],
    "abstract": "Characterising the input-output photon-number distribution of an unknown optical quantum channel is an important task especially in the case of quantum cryptography. In practice, this would require true photon number sources and photon-number-resolving detectors, but these technologies are still work-in-progress. In this work, we propose an efficient technique called double-decoy method which can provide relevant partial information of the input-output photon-number distribution, including the fraction of events in which the unknown quantum channel accepts and outputs a single photon. These detections correspond to events in which the transmitted single photon survives a basis-independent filter just before the measurement. We apply the double-decoy method to quantum key distribution (QKD) and show that it can substantially reduce the background noise and systematic error at the privacy amplification level, thereby improving the current secret key rate and achievable distance for standard QKD protocols. \r\nWe also believe that several applications beyond cryptography will benefit from this technique.",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-dec5a0579177ae1e55494551a92ae585ef934b49f6b814815f3715be03e15f98",
        "timestamp": 1587115610,
        "size": 516013,
        "filename": "main.pdf"
      },
      "student-paper": true,
      "name-main-presenter": "Emilien Lavie",
      "morning-session": true,
      "afternoon-session": false
    }
  },
  {
    "pid": 61,
    "title": "Shannon-Limit Approached Information Reconciliation for Quantum Communication",
    "authors": [
      {
        "email": "tangbangying18@nudt.edu.cn",
        "first": "Bang-Ying",
        "last": "Tang",
        "affiliation": "College of Computer Science and Technology, National University of Defense Technology",
        "contact": true
      },
      {
        "email": "liubo08@nudt.edu.cn",
        "first": "Bo",
        "last": "Liu",
        "affiliation": "College of Advanced Interdisciplinary Studies, National University of Defense Technology",
        "contact": true
      },
      {
        "email": "wlyu@nudt.edu.cn",
        "first": "Wan-Rong",
        "last": "Yu",
        "affiliation": "College of Computer Science and Technology, National University of Defense Technology"
      },
      {
        "email": "1405811286@qq.com",
        "first": "Chun-Qing",
        "last": "Wu",
        "affiliation": "College of Computer Science and Technology, National University of Defense Technology"
      }
    ],
    "abstract": "To reduce the frame error rate of polar-based information reconciliation (IR) scheme with high reconciliation efficiency, we propose the Shannon-limit approached (SLA) IR scheme, in which the block checked decoder of polar code is proposed to determine the error sub-blocks in the forward reconciliation and the errors are corrected in the acknowledgment reconciliation. And the experimental results show that the SLA IR scheme reduces the $\\varepsilon$-correctness to $10^{-8}$ and improves the efficiency to better than 1.091 with the IR block size of 128Mb. Otherwise, the SLA IR scheme reaches the efficiency of 1.055 with the quantum bit error rate (QBER) of 0.02, when the block length reaches to 1Gb, which is hundred times larger than the state-of-art implemented polar codes-based IR schemes and further reduce the finite length effect.",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-56ff5532cb0359a67e17ceb4de5a97f8982d32500097845327a56e46556aa9d3",
        "timestamp": 1587136980,
        "size": 555413,
        "filename": "Shannon-Limit Approached Information Reconciliation for Quantum Key Distribution.pdf"
      },
      "student-paper": true,
      "name-main-presenter": "Bang-Ying Tang",
      "arxiv-id": "2003.03713",
      "morning-session": true,
      "afternoon-session": false
    }
  },
  {
    "pid": 63,
    "title": "A simplified receiver for 32 channel wavelength-division multiplexing QKD",
    "authors": [
      {
        "email": "jonas.hanke@hhi.fraunhofer.de",
        "first": "Jonas",
        "last": "Hanke",
        "affiliation": "Fraunhofer Institute for Telecommunications, Heinrich-Hertz-Institute",
        "contact": true
      },
      {
        "email": "jasper.roediger@hhi.fraunhofer.de",
        "first": "Jasper",
        "last": "Rödiger",
        "affiliation": "Fraunhofer Institute for Telecommunications, Heinrich-Hertz-Institute"
      },
      {
        "email": "nino.walenta@hhi.fraunhofer.de",
        "first": "Nino",
        "last": "Walenta",
        "affiliation": "Fraunhofer Institute for Telecommunications, Heinrich-Hertz-Institute"
      },
      {
        "email": "nicolas.perlot@hhi.fraunhofer.de",
        "first": "Nicolas",
        "last": "Perlot",
        "affiliation": "Fraunhofer Institute for Telecommunications, Heinrich-Hertz-Institute"
      },
      {
        "email": "ronald.freund@hhi.fraunhofer.de",
        "first": "Ronald",
        "last": "Freund",
        "affiliation": "Fraunhofer Institute for Telecommunications, Heinrich-Hertz-Institute"
      }
    ],
    "abstract": "When wavelength multiplexing a large number of quantum communication channels and time-phase coding is used, it’s desired in terms of cost and complexity to minimize the number of\r\ninterferometers. Here, we demonstrate that a visibility sufficiently high to enable QKD operation can be maintained with only a single interferometer at the receiver and without the need for\r\nadditional high frequency phase modulation.",
    "options": {
      "student-paper": false,
      "name-main-presenter": "Jonas Hanke",
      "morning-session": true,
      "afternoon-session": true
    }
  },
  {
    "pid": 64,
    "title": "Trojan Horse Attack on Chip-Scale Quantum Key Distribution",
    "authors": [
      {
        "email": "friederike.johlinger@bristol.ac.uk",
        "first": "Friederike",
        "last": "Jöhlinger",
        "affiliation": "University of Bristol",
        "contact": true
      },
      {
        "email": "henry.semenenko@imec.be",
        "first": "Henry",
        "last": "Semenko",
        "affiliation": "University of Bristol"
      },
      {
        "email": "djeylan.aktas@bristol.ac.uk",
        "first": "Djeylan",
        "last": "Aktas",
        "affiliation": "University of Bristol"
      },
      {
        "email": "philip.sibson@kets-quantum.com",
        "first": "Philip",
        "last": "Sibson",
        "affiliation": "KETS Quantum Security"
      },
      {
        "email": "chris.erven@bristol.ac.uk",
        "first": "Chris",
        "last": "Erven",
        "affiliation": "University of Bristol"
      },
      {
        "email": "john.rarity@bristol.ac.uk",
        "first": "John",
        "last": "Rarity",
        "affiliation": "University of Bristol",
        "contact": true
      }
    ],
    "abstract": "We have come a long way since the first implementation of a quantum key distribution (QKD) system and various attacks have been demonstrated, such as the Trojan Horse Attack (THA). In this attack, the eavesdropper Eve gains information by analysing the back-reflections of light she shines into the QKD system. Almost all attacks have been demonstrated on devices based on fibre components. However, the first chip-scale QKD devices are being developed now, utilising the small size of integrated optics, the stability of the optical system and the ease at which it can be mass-produced, showing great commercial potential. Here we discuss a THA on chip-scale QKD. First, points of reflection in a QKD transmitter chip were found via a reflectometry. Based on this we give an experimental set-up to implement a THA which would give Eve access to 50% of the key. Full experimental results of this attack are expected in the next two to three months.",
    "options": {
      "student-paper": true,
      "name-main-presenter": "Friederike Jöhlinger",
      "morning-session": true,
      "afternoon-session": true
    }
  },
  {
    "pid": 68,
    "title": "Unambiguous elimination of pairs of quantum states for quantum communication",
    "authors": [
      {
        "email": "Ittoop.Puthoor@hw.ac.uk",
        "first": "Ittoop Vergheese",
        "last": "Puthoor",
        "affiliation": "Institute of Photonics and Quantum Sciences, Heriot-Watt University, UK"
      },
      {
        "email": "jonathan.crickmore@gmail.com",
        "first": "Jonathan",
        "last": "Crickmore",
        "affiliation": "Institute of Photonics and Quantum Sciences, Heriot-Watt University, UK"
      },
      {
        "email": "joseph.ho@hw.ac.uk",
        "first": "Joseph",
        "last": "Ho",
        "affiliation": "Institute of Photonics and Quantum Sciences, Heriot-Watt University, UK"
      },
      {
        "email": "bvr1@hw.ac.uk",
        "first": "Berke",
        "last": "Ricketti",
        "affiliation": "Institute of Photonics and Quantum Sciences, Heriot-Watt University, UK"
      },
      {
        "email": "Sarah.Croke@glasgow.ac.uk",
        "first": "Sarah",
        "last": "Croke",
        "affiliation": "School of Physics and Astronomy, University of Glasgow, UK"
      },
      {
        "email": "mhillery@hunter.cuny.edu",
        "first": "Mark",
        "last": "Hillery",
        "affiliation": "Department of Physics and Astronomy, Hunter College of the City University of New York, USA"
      },
      {
        "email": "A.Fedrizzi@hw.ac.uk",
        "first": "Alessandro",
        "last": "Fedrizzi",
        "affiliation": "Institute of Photonics and Quantum Sciences, Heriot-Watt University, UK",
        "contact": true
      },
      {
        "email": "E.Andersson@hw.ac.uk",
        "first": "Erika",
        "last": "Andersson",
        "affiliation": "Institute of Photonics and Quantum Sciences, Heriot-Watt University, UK",
        "contact": true
      }
    ],
    "abstract": "Quantum state elimination measurements tell us what states a quantum system does not have. This is different from state discrimination, where one tries to determine what the state of a quantum system is, rather than what it is not. Apart from being of fundamental interest, quantum state elimination may find uses in quantum communication and quantum cryptography. We consider unambiguous elimination of a pair of quantum states, and present a possible optical realisation of the scheme.",
    "options": {
      "student-paper": false,
      "name-main-presenter": "Ittoop Vergheese Puthoor",
      "morning-session": true,
      "afternoon-session": true
    }
  },
  {
    "pid": 72,
    "title": "Client-Server Identification Protocols with Quantum PUF",
    "authors": [
      {
        "email": "s1839173@ed.ac.uk",
        "first": "Mina",
        "last": "Doosti",
        "affiliation": "School of Informatics, University of Edinburgh",
        "contact": true
      },
      {
        "email": "nkumar@exseed.ed.ac.uk",
        "first": "Niraj",
        "last": "Kumar",
        "affiliation": "School of Informatics, University of Edinburgh",
        "contact": true
      },
      {
        "email": "mdelavar@ed.ac.uk",
        "first": "Mahshid",
        "last": "Delavar",
        "affiliation": "School of Informatics, University of Edinburgh",
        "contact": true
      },
      {
        "email": "ekashefi@gmail.com",
        "first": "Elham",
        "last": "Kashefi",
        "affiliation": "School of Informatics, University of Edinburgh",
        "contact": true
      }
    ],
    "abstract": "Recently, major progress has been made towards the realisation of the quantum internet to enable a broad range of applications that would be out of reach for classical internet. Most of these applications such as delegated quantum computation require running a secure identification protocol between a low-resource and a high-resource party to provide secure communication. Physical Unclonable Functions (PUFs) have been shown as resource-efficient hardware solutions for providing secure identification schemes in both classical and quantum settings. In this work, we propose two identification protocols based on quantum PUFs (qPUFs) as defined recently by Arapinis et al.\r\nIn the first protocol, the low-resource party wishes to prove its identity to the high-resource party and in the second protocol, it is vice versa. Unlike existing identification protocols based on Quantum Read-out of PUFs which rely on the security against a specific family of attacks, our protocols provide provable exponential security against any Quantum Polynomial-Time adversary with only polynomial resource parties. We provide a comprehensive comparison between the two proposed protocols in terms of resources such as quantum memory and computing ability required in both parties as well as the communication overhead between them. A stand-out feature of our second protocol is secure identification of a high-resource party by running a purely classical verification algorithm. This is achieved by delegating quantum operations to the high-resource party and utilising the resulting classical outcomes for identification.\r\n\r\nAn interesting application idea that emerges from our second protocol is certification or benchmarking of general quantum computation schemes based on purely running a classical test on the resulting measurement outcomes.",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-f7f2a401537d0516776daf3743215a3e7041f3885aec43bb54a42f83d9c2d6fa",
        "timestamp": 1587148664,
        "size": 911064,
        "filename": "Client_Server_QPUF_Identification.pdf"
      },
      "student-paper": true,
      "name-main-presenter": "Mina Doosti, Mahshid Delavar, Niraj Kumar",
      "arxiv-id": "2006.04522",
      "morning-session": true,
      "afternoon-session": true
    }
  },
  {
    "pid": 73,
    "title": "On Key Generation Schemes with QKD for Applications",
    "authors": [
      {
        "email": "Mikhail.Borodin@infotecs.ru",
        "first": "Mikhail",
        "last": "Borodin",
        "affiliation": "JSC InfoTeCS, Moscow, Russia"
      },
      {
        "email": "urivskiy@infotecs.ru",
        "first": "Alexey",
        "last": "Urivskiy",
        "affiliation": "JSC InfoTeCS, Moscow, Russia"
      },
      {
        "email": "andrey.zhilyaev@infotecs.ru",
        "first": "Andrey",
        "last": "Zhilyaev",
        "affiliation": "JSC InfoTeCS, Moscow, Russia",
        "contact": true
      }
    ],
    "abstract": "In this research, we study different approaches to construct Key Generation and Distribution Schemes using Quantum Key Distribution systems. Three schemes are proposed and analyzed. The main question to answer is what happens if a part of the newly shared key is used for authentication while sharing other keys? We consider several attacks, their complexity and probability. It is shown that a hybrid approach, when authentication keys are derived from a mixture of pre-shared keys and key from QKD protocol, is more advantageous.",
    "options": {
      "student-paper": false,
      "name-main-presenter": "Andrey Zhilyaev",
      "morning-session": true,
      "afternoon-session": true
    }
  },
  {
    "pid": 75,
    "title": "Semi-Device-Independent Random Number Generation with Flexible Assumptions",
    "authors": [
      {
        "email": "pivoluskamatej@gmail.com",
        "first": "Matej",
        "last": "Pivoluska",
        "affiliation": "Institute of Computer Science, Masaryk University, Brno and Institute of Physics, Slovak Academy of Sciences, Bratislava",
        "contact": true
      },
      {
        "email": "martin.plesch@savba.sk",
        "first": "Martin",
        "last": "Plesch",
        "affiliation": "Institute of Computer Science, Masaryk University, Brno and Institute of Physics, Slovak Academy of Sciences, Bratislava",
        "contact": true
      },
      {
        "email": "mate.frks@gmail.com",
        "first": "Máté",
        "last": "Farkas",
        "affiliation": "Institute of Theoretical Physics and Astrophysics, National Quantum Information Centre, Faculty of Mathematics, Physics and Informatics, and International Centre for Theory of Quantum Technologies University of Gdansk"
      },
      {
        "email": "nruzickova2104@gmail.com",
        "first": "Natália",
        "last": "Ružičková",
        "affiliation": "Institute of Science and Technology, Klosterneuburg"
      },
      {
        "email": "crf3@hw.ac.uk",
        "first": "Clara",
        "last": "Flegel",
        "affiliation": "Institute of Photonics and Quantum Sciences, Heriot-Watt University, Edinburgh"
      },
      {
        "email": "nah2@hw.ac.uk",
        "first": "Natalia Herrera",
        "last": "Valencia",
        "affiliation": "Institute of Photonics and Quantum Sciences, Heriot-Watt University, Edinburgh"
      },
      {
        "email": "w.mccutcheon@hw.ac.uk",
        "first": "Will",
        "last": "McCutcheon",
        "affiliation": "Institute of Photonics and Quantum Sciences, Heriot-Watt University, Edinburgh"
      },
      {
        "email": "m.malik@hw.ac.uk",
        "first": "Mehul",
        "last": "Malik",
        "affiliation": "Institute of Photonics and Quantum Sciences, Heriot-Watt University, Edinburgh"
      },
      {
        "email": "ed.alex.aguilar@gmail.com",
        "first": "Edgar A.",
        "last": "Aguilar",
        "affiliation": "Institute of Quantum Optics and Quantum Information, Austrian Academy of Sciences, Vienna"
      }
    ],
    "abstract": "Our ability to trust that a random number is truly random is essential for fields as diverse as cryptography and fundamental tests of quantum mechanics. \r\nDevice-independent quantum random number generators (QRNGs) provide a means of completely trusted randomness, but are highly impractical due to their strict technological requirements, such as loophole-free quantum nonlocality. \r\nBy making fixed assumptions on specific parts of the device, semi-device-independent QRNGs lower these requirements drastically. \r\nHowever, this {has usually been} done at the cost of  limiting their flexibility and security to a specific physical implementation and level of trust. \r\nHere we propose and experimentally test a new framework for semi-device-independent randomness certification that employs a flexible set of assumptions, allowing it to be applied in a range of physical scenarios involving both quantum and classical entropy sources. \r\nAt the heart of our method lies a source of trusted vacuum in the form of a signal shutter, which enables the honesty of partially trusted measurement devices to be tested and provides lower bounds on the guessing probability of their measurement outcomes. \r\nWe experimentally verify our protocol with a photonic setup and generate secure random bits under three different source assumptions with varying degrees of security and resulting data rates. \r\nOur work demonstrates a simple and practical way for achieving semi-device-independent randomness generation with user-defined flexibility in terms of levels of trust and physical implementations.",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-76ef9ec4cdea47bc80dd86b5750cbd7f6dfb50cc1a7da670b2249b74be7f3ffe",
        "timestamp": 1587152155,
        "size": 681044,
        "filename": "Simple_testable_random_number_generator(2).pdf"
      },
      "student-paper": false,
      "name-main-presenter": "Matej Pivoluska",
      "arxiv-id": "2002.12295",
      "morning-session": true,
      "afternoon-session": false
    }
  },
  {
    "pid": 78,
    "title": "Covert Continuous-Variable Quantum Key Distribution",
    "authors": [
      {
        "email": "raphael.aymeric@telecom-paris.fr",
        "first": "Raphaël",
        "last": "Aymeric",
        "affiliation": "Télécom Paris",
        "contact": true
      },
      {
        "email": "david.fainsin@telecom-paris.fr",
        "first": "David",
        "last": "Fainsin",
        "affiliation": "Télécom Paris"
      },
      {
        "email": "romain.alleaume@telecom-paris.fr",
        "first": "Romain",
        "last": "Alléaume",
        "affiliation": "Télécom Paris",
        "contact": true
      }
    ],
    "abstract": "Quantum key distribution (QKD) contrasts with classical cryptographic methods because it provides information-theoretical security on the distilled key. In some security demanding contexts, the perfect confidentiality that can be obtained with QKD combined with One-Time-Pad, may be insufficient. This will be in particular the case if the mere existence of communication can divulge crucial information. Performing QKD covertly solves this by insuring low probability of detection for the QKD signal states. \r\n\r\nWe study here for the first time Covert continuous variable (CV) QKD. We establish, in the general case of a thermal noise channel, that the covertness conditions impose drastic limits to the performance of such protocols. We then propose an original solution to overcome this limitation by performing a computationally-secure coherent block encoding, analogous to spread spectrum, to the signal pulses of a Gaussian modulated coherent state CV-QKD protocol.\r\n\r\n The resulting protocol provides covertness, under computational assumptions  while preserving the information-theoretical security on the final QKD key. We show that our method enables QKD over realistic WDM environments such as a 30 km optical backbone populated by 25 standard channels.",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-9e80932eb39c05a8a4211618dd9dd4ac04b2a12ea95a718feffe1a731be20afc",
        "timestamp": 1587152664,
        "size": 747302,
        "filename": "R_Aymeric_FullPaper.pdf"
      },
      "student-paper": false,
      "name-main-presenter": "Raphaël AYMERIC",
      "morning-session": true,
      "afternoon-session": false
    }
  },
  {
    "pid": 81,
    "title": "Non-restrictive state reduction and analytical bounds in a multipartite device-independent scenario",
    "authors": [
      {
        "email": "federico.grasselli@hhu.de",
        "first": "Federico",
        "last": "Grasselli",
        "affiliation": "Heinrich-Heine-Universität Düsseldorf"
      },
      {
        "email": "glaucia.murta@hhu.de",
        "first": "Gláucia",
        "last": "Murta",
        "affiliation": "Heinrich-Heine-Universität Düsseldorf"
      },
      {
        "email": "Hermann.Kampermann@hhu.de",
        "first": "Hermann",
        "last": "Kampermann",
        "affiliation": "Heinrich-Heine-Universität Düsseldorf"
      },
      {
        "email": "dagmar.bruss@uni-duesseldorf.de",
        "first": "Dagmar",
        "last": "Bruss",
        "affiliation": "Heinrich-Heine-Universität Düsseldorf"
      }
    ],
    "abstract": "We consider a device-independent scenario where N parties test the Mermin-Ardehali-Belinskii-Klyshko (MABK) inequality. By exploiting the inequality’s symmetries, we drastically simplify the general form of the quantum state that can be considered, without loss of generality. We then derive an upper bound on the maximal violation of the MABK inequality attained by an arbitrary N-qubit state, as a function of the state’s parameters. The two results enable us to derive analytical bounds on the von Neumann entropy of the parties’ outcomes, conditioned on the eavesdropper’s information. These quantities are crucial for the security of many cryptographic protocols and better bounds lead to more robust protocols. In particular, we bound the conditional entropy of a single party’s outcome and the joint conditional entropy of two parties’ outcomes, as a function of the MABK violation observed by three parties. We extend the former bound to N parties and prove its tightness, while we observe that the latter significantly improves previous results.",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-c5d3c6606c81c83565e8eb3d783f99cd7df16030679a84bb36b21ae083bada53",
        "timestamp": 1587157121,
        "size": 775670,
        "filename": "DI_bounds_Manuscript.pdf"
      },
      "student-paper": false,
      "name-main-presenter": "Gláucia Murta",
      "arxiv-id": "2004.14263",
      "morning-session": true,
      "afternoon-session": true
    }
  },
  {
    "pid": 84,
    "title": "Dispelling Myths on Superposition Attacks: Formal Security Model and Attack Analyses",
    "authors": [
      {
        "email": "lukamusic@yahoo.fr",
        "first": "Luka",
        "last": "Music",
        "affiliation": "Département Informatique et Réseaux, CNRS, Sorbonne Université",
        "contact": true
      },
      {
        "email": "celine.chevalier@ens.fr",
        "first": "Céline",
        "last": "Chevalier",
        "affiliation": "Université Panthéon-Assas Paris 2",
        "contact": true
      },
      {
        "email": "ekashefi@gmail.com",
        "first": "Elham",
        "last": "Kashefi",
        "affiliation": "Département Informatique et Réseaux, CNRS, Sorbonne Université; School of Informatics, University of Edinburgh",
        "contact": true
      }
    ],
    "abstract": "With the emergence of quantum communication, it is of folkloric belief that allowing an Adversary to perform superposition queries to otherwise classical cryptographic protocols and forcing the honest players to perform actions coherently on quantum states automatically breaks the schemes' security. Another intuition is that enforcing measurements on the exchanged messages is enough to protect protocols from these attacks.\r\n\r\n\tHowever, the reality is much more complex. The security models dealing with superposition attacks only consider unconditional security. The first seminal papers date back to 1997 and prove the impossibility of unconditionally-secure bit-commitment schemes. Follow-up works heavily rely on this assumption of unconditional security to prove strong impossibility \r\nresults and their proof techniques cannot be applied to the computational setting. They essentially indicate that ideal primitives should in fact measure the input state. On the opposite, security models considering computational security assume that all supposedly classical messages are measured, which forbids by construction the analysis of superposition attacks.\r\n\tTo fill in the gap between those models, Boneh and Zhandry have started to study the quantum computational security for classical primitives in their seminal work at Crypto'13, but only in the single-party setting. To the best of our knowledge, an equivalent model in the multiparty setting is still missing.\r\n\r\n\tIn this work, we propose the first computational security model considering superposition attacks for multiparty protocols. We show that our new security model is satisfiable by proving the security of the well-known One-Time-Pad protocol and show an attack on a variant of the equally reputable Yao Protocol for Secure Two-Party Computations. The post-mortem of this attack reveals the precise points of failure, yielding highly counter-intuitive results: The attack vector consists of a (classically) seemingly inoffensive message and a measurement performed by the honest player. This example shows that adding extra classical communication, which is harmless for classical security, can make the protocol become subject to superposition attacks.\r\n\r\nOur results show that intuitions can be misleading when reasoning about cryptographic protocols in a quantum world, and that there is no evident answer to provide for either the vulnerabilities of classical protocols to superposition attacks or the adapted countermeasures.",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-76010470eb8f05fad48e2f221cb53b0fd91a97c1e2675fc206078f907a806920",
        "timestamp": 1587205439,
        "size": 541358,
        "filename": "sup-attack-yao.pdf"
      },
      "student-paper": true,
      "name-main-presenter": "Luka Music",
      "arxiv-id": "2007.00677",
      "morning-session": true,
      "afternoon-session": false
    }
  },
  {
    "pid": 92,
    "title": "The Bitcoin Backbone Protocol Against Quantum Adversaries",
    "authors": [
      {
        "email": "s1575638@sms.ed.ac.uk",
        "first": "Alexandru",
        "last": "Cojocaru",
        "affiliation": "University of Edinburgh",
        "contact": true
      },
      {
        "email": "garay@cse.tamu.edu",
        "first": "Juan",
        "last": "Garay",
        "affiliation": "Texas A&M University"
      },
      {
        "email": "akiayias@inf.ed.ac.uk",
        "first": "Aggelos",
        "last": "Kiayias",
        "affiliation": "University of Edinburgh and IOHK"
      },
      {
        "email": "fang.song@tamu.edu",
        "first": "Fang",
        "last": "Song",
        "affiliation": "Texas A&M University",
        "contact": true
      },
      {
        "email": "petros.wallden@ed.ac.uk",
        "first": "Petros",
        "last": "Wallden",
        "affiliation": "University of Edinburgh",
        "contact": true
      }
    ],
    "abstract": "Bitcoin and its underlying blockchain protocol have received recently significant attention in the context of building distributed systems as well as from the perspective of the foundations of the consensus problem. At the same time, the rapid development of quantum technologies brings the possibility of quantum computing devices from a theoretical concept to an emerging technology. Motivated by this, in this work we revisit the formal security of the core of the Bitcoin protocol, called the Bitcoin backbone, in the presence of an adversary that has access to a scalable quantum computer. We prove that the protocol’s essential properties stand in the post-quantum setting assuming a general quantum adversary with suitably bounded number of queries in the Quantum Random Oracle (QRO) model. In order to achieve this, we investigate\r\nand bound the quantum complexity of a Chain-of-Proofs-of-Work search problem which is at the core of the blockchain protocol. Our results imply that security can be shown by bounding the quantum queries so that each quantum query is worth O(p^{−1/2}) classical ones and that the\r\nwait time for safe settlement is expanded by a multiplicative factor of O(p^{−1/6}), where p is the probability of success of a single classical query to the protocol’s underlying hash function.",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-f69cfc3add89c89ab9dfc530194c103d01fb9f0402bc9ee150bee903ed8e93c4",
        "timestamp": 1587172447,
        "size": 584156,
        "filename": "Backbone_Quantum_Adversaries_full_paper.pdf"
      },
      "student-paper": true,
      "name-main-presenter": "Alexandru Cojocaru",
      "morning-session": true,
      "afternoon-session": false
    }
  },
  {
    "pid": 93,
    "title": "Limitations on device independent secure key via squashed non-locality",
    "authors": [
      {
        "email": "marek.winczewski@phdstud.ug.edu.pl",
        "first": "Marek",
        "last": "Winczewski",
        "affiliation": "Institute of Theoretical Physics and Astrophysics and National Quantum Information Centre in Gdańsk, University of Gdańsk, 80-952 Gdańsk, Poland International Centre for Theory of Quantum Technologies, University of Gdańsk, 80-952 Gdańsk, Poland"
      },
      {
        "email": "tamoghna.das@ug.edu.pl",
        "first": "Tamoghna",
        "last": "Das",
        "affiliation": "International Centre for Theory of Quantum Technologies, University of Gdańsk, 80-952 Gdańsk"
      },
      {
        "email": "khorodec@inf.ug.edu.pl",
        "first": "Karol",
        "last": "Horodecki",
        "affiliation": "International Centre for Theory of Quantum Technologies, University of Gdańsk, 80-952 Gdańsk, Poland and Institute of Informatics and National Quantum Information Centre in Gdańsk, Faculty of Mathematics, Physics and Informatics, University of Gdańsk, 80-952 Gdańsk, Poland",
        "contact": true
      }
    ],
    "abstract": "We initiate a systematic study to provide upper bounds on device-independent key, secure against a non-signaling adversary (NSDI), distilled by a wide class of operations, currently used in both quantum and non-signaling device-independent protocols. These operations consist of a direct measurements on the devices followed by Local Operations and Public Communication (MDLOPC). We formulate a security condition for the considered class of protocols, that is based on the newly introduced non-signaling norm. This norm takes supremum over certain operations, that can be used to discriminate devices. It is shown that the security condition based on this norm, is equivalent to two security conditions present in the literature. We employ the idea of ``squashing\" on the secrecy monotones, which provide upper bounds on the key rate in secret key agreement (SKA) scenario, and show that squashed secrecy monotones are the upper bounds on NSDI key. As an important instance, an upper bound on NSDI key rate called ``squashed non-locality\", has been constructed. It exhibits several important properties, including convexity, monotonicity, and additivity on tensor products. Using this bound, we identify numerically a domain of two binary inputs and two binary outputs non-local devices for which the squashed non-locality is zero. Therefore one can not distill key from them via MDLOPC operations. These are mixtures of Popescu-Rohrlich (PR) and anti-PR box with the weight of PR less than 80%. This example confirms the intuition that non-locality need not imply secrecy in the non-signaling scenario. The approach is general, describing how to construct other tighter yet possibly less computable upper bounds. Our technique for obtaining upper bounds is based on the non-signaling analog of quantum purification: the complete extension. This extension provides the ultimate eavesdropping power with the minimal consumption of eavesdropper's memory and, as we prove, yields equivalent security conditions as previously known in the literature.",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-be6fa9129da7082a815b2a5932b5229690952b842c93c7293234d0cb17310de0",
        "timestamp": 1587175148,
        "size": 1337142,
        "filename": "DI_key_Upper_Bounds_v2.pdf"
      },
      "student-paper": true,
      "morning-session": false,
      "afternoon-session": false
    }
  },
  {
    "pid": 102,
    "title": "Ultrafast and practical Bell-based quantum randomness generation with classical optical homodyne detection",
    "authors": [
      {
        "email": "wang.chao@nus.edu.sg",
        "first": "Chao",
        "last": "Wang",
        "affiliation": "Department of Electrical Computer Engineering, National University of Singapore, Singapore",
        "contact": true
      },
      {
        "email": "wykun06@gmail.com",
        "first": "Yukun",
        "last": "Wang",
        "affiliation": "Department of Electrical Computer Engineering, National University of Singapore, Singapore"
      },
      {
        "email": "koontong@nus.edu.sg",
        "first": "Koon Tong",
        "last": "Goh",
        "affiliation": "Department of Electrical Computer Engineering, National University of Singapore, Singapore",
        "contact": true
      },
      {
        "email": "zhanggong@nus.edu.sg",
        "first": "Gong",
        "last": "Zhang",
        "affiliation": "Department of Electrical Computer Engineering, National University of Singapore, Singapore",
        "contact": true
      },
      {
        "email": "elehjy@nus.edu.sg",
        "first": "Jing Yan",
        "last": "Haw",
        "affiliation": "Department of Electrical Computer Engineering, National University of Singapore, Singapore",
        "contact": true
      },
      {
        "email": "charles.lim@nus.edu.sg",
        "first": "Charles C.-W.",
        "last": "Lim",
        "affiliation": "Department of Electrical Computer Engineering, National University of Singapore, Singapore; Centre for Quantum Technologies, National University of Singapore, Singapore",
        "contact": true
      }
    ],
    "abstract": "By making reasonable assumptions on realistic systems, we propose and implement the first ultra-high-speed CHSH experiment working at 40GHz demonstrating a gigabit quantum certified random number throughput. Moreover, our scheme is suitable for optical chip design since it only requires standard optical components and balanced detectors. Furthermore, our scheme paves the way for the promising research direction to utilise noisy detectors for quantum system construction, which might be helpful for certain noise-sensitive applications, e.g. quantum sensing and quantum computing.",
    "options": {
      "student-paper": false,
      "morning-session": false,
      "afternoon-session": false
    }
  },
  {
    "pid": 103,
    "title": "Classical proofs of quantum knowledge",
    "authors": [
      {
        "email": "vidick@caltech.edu",
        "first": "Thomas",
        "last": "Vidick",
        "affiliation": "California Institute of Technology",
        "contact": true
      },
      {
        "email": "tinazhang@caltech.edu",
        "first": "Tina",
        "last": "Zhang",
        "affiliation": "California Institute of Technology",
        "contact": true
      }
    ],
    "abstract": "We define the notion of a proof of knowledge in the setting where the verifier is classical, but the prover is quantum, and where the witness that the prover holds is in general a quantum state. We establish simple properties of our definition, including that nondestructive classical proofs of quantum knowledge are impossible for nontrivial states, and that, under certain conditions on the parameters in our definition, a proof of knowledge protocol for a hard-to-clone state can be used as a (destructive) quantum money verification protocol. In addition, we provide two examples of protocols (both inspired by private-key classical verification protocols for quantum money schemes) which we can show to be proofs of quantum knowledge under our definition. In so doing, we introduce new techniques for the analysis of such protocols which build on results from the literature on nonlocal games. Finally, we show that, under our definition, the verification protocol introduced by Mahadev (FOCS 2018) is a classical argument of quantum knowledge for QMA relations.",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-25de8300c0d53d9ea4fb724dda600932819ff38db66f64367a0ad3c8559d8092",
        "timestamp": 1587203868,
        "size": 761716,
        "filename": "main.pdf"
      },
      "student-paper": true,
      "name-main-presenter": "Tina Zhang",
      "arxiv-id": "2005.01691",
      "morning-session": true,
      "afternoon-session": false
    }
  },
  {
    "pid": 107,
    "title": "Robust and high-efficiency frame synchronization scheme for continuous-variable quantum key distribution with simple process",
    "authors": [
      {
        "email": "118034910040@sjtu.edu.cn",
        "first": "Rui",
        "last": "Chen",
        "affiliation": "Shanghai Jiaotong University",
        "contact": true
      },
      {
        "email": "huang.peng@sjtu.edu.cn",
        "first": "Peng",
        "last": "Huang",
        "affiliation": "Shanghai Jiaotong University"
      },
      {
        "email": "dengwen_li@sjtu.edu.cn",
        "first": "Dengwen",
        "last": "Li",
        "affiliation": "Shanghai Jiaotong University"
      },
      {
        "email": "ghzeng@sjtu.edu.cn",
        "first": "Guihua",
        "last": "Zeng",
        "affiliation": "Shanghai Jiaotong University"
      }
    ],
    "abstract": "we propose a synchronization method that do not need additional modulation devices and can synchronize under phase shifts. It can be used in passive preparation CVQKD schemes that are inconvenient to add synchronization frames into key strings by modulation devices.",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-1a15d122b1ca708d4f0d962ddd4746bc7d31aeb8f1e7d27002e3449ad8c330c0",
        "timestamp": 1591407245,
        "size": 298674,
        "filename": "manuscript.pdf"
      },
      "student-paper": true,
      "morning-session": false,
      "afternoon-session": false
    }
  },
  {
    "pid": 109,
    "title": "Phase compensation for free-space continuous-variable quantum key distribution",
    "authors": [
      {
        "email": "sy_wang@sjtu.edu.cn",
        "first": "Shiyu",
        "last": "Wang",
        "affiliation": "State Key Laboratory of Advanced Optical Communication Systems and Networks, Center of Quantum Sensing and Information Processing, Shanghai Jiao Tong University, Shanghai 200240, China",
        "contact": true
      },
      {
        "email": "huang.peng@sjtu.edu.cn",
        "first": "Peng",
        "last": "Huang",
        "affiliation": "State Key Laboratory of Advanced Optical Communication Systems and Networks, Center of Quantum Sensing and Information Processing, Shanghai Jiao Tong University, Shanghai 200240, China"
      },
      {
        "email": "miaom_liu@sjtu.edu.cn",
        "first": "Miaomiao",
        "last": "Liu",
        "affiliation": "State Key Laboratory of Advanced Optical Communication Systems and Networks, Center of Quantum Sensing and Information Processing, Shanghai Jiao Tong University, Shanghai 200240, China"
      },
      {
        "email": "tonystar@sjtu.edu.cn",
        "first": "Tao",
        "last": "Wang",
        "affiliation": "State Key Laboratory of Advanced Optical Communication Systems and Networks, Center of Quantum Sensing and Information Processing, Shanghai Jiao Tong University, Shanghai 200240, China"
      },
      {
        "email": "ray19960612@sjtu.edu.cn",
        "first": "Ping",
        "last": "Wang",
        "affiliation": "State Key Laboratory of Advanced Optical Communication Systems and Networks, Center of Quantum Sensing and Information Processing, Shanghai Jiao Tong University, Shanghai 200240, China"
      },
      {
        "email": "ghzeng@sjtu.edu.cn",
        "first": "Guihua",
        "last": "Zeng",
        "affiliation": "State Key Laboratory of Advanced Optical Communication Systems and Networks, Center of Quantum Sensing and Information Processing, Shanghai Jiao Tong University, Shanghai 200240, China"
      }
    ],
    "abstract": "Large-scale and flexible deployment of quantum networks is possible with reliable\r\nfree-space quantum key distribution. However, signal fading occurs in free-space channels\r\nand causes various adverse effects. Under this circumstance, phase compensation becomes a\r\nchallenging task for quantum key distribution using continuous variables. Here we investigate the\r\nfeasibility of implementing phase compensation via simply computing the correlation between\r\ntransmitted and received data. Demonstration and performance analysis are conducted with real\r\ntransmittance of a 150-m free-space fading channel; results indicate the applicability of this\r\ncompensation scheme to free-space quantum communication systems.",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-244fb2512c0e779b1381cae6dbe00d863a6db9b92fd2e11343350a334a6ae507",
        "timestamp": 1591587317,
        "size": 1192854,
        "filename": "full paper.pdf"
      },
      "student-paper": true,
      "name-main-presenter": "Shiyu Wang",
      "morning-session": true,
      "afternoon-session": false
    }
  },
  {
    "pid": 111,
    "title": "Finite-key security analysis of the 1-decoy state QKD protocol with a leaky intensity modulator",
    "authors": [
      {
        "email": "wlwang19888@163.com",
        "first": "WEILONG",
        "last": "WANG",
        "affiliation": "State Key Laboratory of Mathematical Engineering and Advanced Computing, Zhengzhou , China",
        "contact": true
      },
      {
        "email": "9321751765@qq.com",
        "first": "XIANGDONG",
        "last": "MENG",
        "affiliation": "State Key Laboratory of Mathematical Engineering and Advanced Computing, Zhengzhou , China"
      },
      {
        "email": "fei_yy@foxmail.com",
        "first": "YANGYANG",
        "last": "FEI",
        "affiliation": "State Key Laboratory of Mathematical Engineering and Advanced Computing, Zhengzhou , China"
      },
      {
        "email": "1479462018@qq.com",
        "first": "YUANHAO",
        "last": "LI",
        "affiliation": "State Key Laboratory of Mathematical Engineering and Advanced Computing, Zhengzhou , China"
      },
      {
        "email": "ma_zhi@163.com",
        "first": "ZHI",
        "last": "MA",
        "affiliation": "State Key Laboratory of Mathematical Engineering and Advanced Computing, Zhengzhou , China"
      }
    ],
    "abstract": "The finite-key security of the standard three-intensity decoy-state quantum key distribution QKD) protocol in the presence of information leakage has been analyzed (Wang et al. in New J Phys 20:083027, 2018). On the other hand, the 1-decoy state QKD protocol has been proved to be able to achieve higher secret key rate than the three-intensity decoy-state QKD protocol in the finite-key regime by using only two different intensity settings (Davide et al. in Appl Phys Lett 112:171104, 2018). In this work, we analyze the finite-key security of the 1-decoy state QKD protocol with a leaky intensity modulator, which is used to generate the decoy state. In particular, we simulate the secret key rate under three practical cases of Trojan-horse attacks. Our simulation results demonstrate that the 1-decoy state QKD protocol can be secure over\r\nlong distances within a reasonable time frame given that the intensity modulator is sufficiently isolated. By comparing the simulation results to those presented in Wang et al. (2018), we find that, as expected, the 1-decoy state QKD protocol is more robust against information leakage from the intensity modulator for all achievable distances.",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-bfcd8c184afeb0c7d0caf4f5c5ccafda33b03ae73cca541ee19dba93354a2665",
        "timestamp": 1595764973,
        "size": 546345,
        "filename": "Finite-key security analysis of the 1-decoy state QKD protocol with a leaky intensity modulator.pdf"
      },
      "student-paper": false,
      "name-main-presenter": "WEILONG WANG",
      "morning-session": true,
      "afternoon-session": false
    }
  },
  {
    "pid": 117,
    "title": "Demonstration of Real-time Transmission of Large-scale Genome Sequence Data Using Quantum Cryptography",
    "authors": [
      {
        "email": "akira4.murakami@toshiba.co.jp",
        "first": "Akira",
        "last": "Murakami",
        "affiliation": "Corporate Research & Development Center, Toshiba Corporation",
        "contact": true
      },
      {
        "first": "Mamiko",
        "last": "Kujiraoka",
        "affiliation": "Corporate Research & Development Center, Toshiba Corporation"
      },
      {
        "first": "Ririka",
        "last": "Takahashi",
        "affiliation": "Corporate Research & Development Center, Toshiba Corporation"
      },
      {
        "first": "Alexander R.",
        "last": "Dixon",
        "affiliation": "Corporate Research & Development Center, Toshiba Corporation"
      },
      {
        "first": "Yoshimichi",
        "last": "Tanizawa",
        "affiliation": "Corporate Research & Development Center, Toshiba Corporation"
      },
      {
        "first": "Hideaki",
        "last": "Sato",
        "affiliation": "Corporate Research & Development Center, Toshiba Corporation"
      },
      {
        "first": "Zhiliang",
        "last": "Yuan",
        "affiliation": "Cambridge Research Laboratory, Toshiba Europe Limited"
      },
      {
        "first": "Winci",
        "last": "Tam",
        "affiliation": "Cambridge Research Laboratory, Toshiba Europe Limited"
      },
      {
        "first": "Andrew",
        "last": "Sharpe",
        "affiliation": "Cambridge Research Laboratory, Toshiba Europe Limited"
      },
      {
        "first": "James",
        "last": "Dynes",
        "affiliation": "Cambridge Research Laboratory, Toshiba Europe Limited"
      },
      {
        "first": "Marco",
        "last": "Lucamarini",
        "affiliation": "Cambridge Research Laboratory, Toshiba Europe Limited"
      },
      {
        "first": "Andrew",
        "last": "Shields",
        "affiliation": "Cambridge Research Laboratory, Toshiba Europe Limited"
      },
      {
        "first": "Muneaki",
        "last": "Shimada",
        "affiliation": "Tohoku University Hospital, Tohoku University"
      },
      {
        "first": "Inaho",
        "last": "Danjoh",
        "affiliation": "Tohoku Medical Megabank Organization, Tohoku University"
      },
      {
        "first": "Fumiki",
        "last": "Katsuoka",
        "affiliation": "Tohoku Medical Megabank Organization, Tohoku University; Advanced Research Center for Innovations in Next-Generation Medicine, Tohoku University"
      },
      {
        "first": "Yasunobu",
        "last": "Okamura",
        "affiliation": "Tohoku Medical Megabank Organization, Tohoku University; Advanced Research Center for Innovations in Next-Generation Medicine, Tohoku University"
      },
      {
        "first": "Fuji",
        "last": "Nagami",
        "affiliation": "Tohoku Medical Megabank Organization, Tohoku University; Advanced Research Center for Innovations in Next-Generation Medicine, Tohoku University"
      }
    ],
    "abstract": "We developed a system for real-time transmission of genome sequence data using quantum cryptography and have succeeded in the quantum cryptography transmission of genome sequence data with data volumes exceeding several hundred gigabytes. This demonstrated that quantum cryptography can transmit large amounts of data and has practical applications in the fields of genomic research and genomic medicine.",
    "options": {
      "student-paper": false,
      "morning-session": false,
      "afternoon-session": false
    }
  },
  {
    "pid": 118,
    "title": "1550-nm free-space reference frame independent quantum key distribution system",
    "authors": [
      {
        "email": "lim.kc@etri.re.kr",
        "first": "Kyongchun",
        "last": "Lim",
        "affiliation": "ETRI",
        "contact": true
      },
      {
        "email": "chbs@etri.re.kr",
        "first": "Byung-Seok",
        "last": "Choi",
        "affiliation": "ETRI"
      },
      {
        "email": "bjh1213@etri.re.kr",
        "first": "Ju Hee",
        "last": "Baek",
        "affiliation": "ETRI"
      },
      {
        "email": "minchul.kim@etri.re.kr",
        "first": "Minchul",
        "last": "Kim",
        "affiliation": "ETRI",
        "contact": true
      },
      {
        "email": "jschoe@etri.re.kr",
        "first": "Joong-Seon",
        "last": "Choe",
        "affiliation": "ETRI"
      },
      {
        "email": "k.j.kim@etri.re.kr",
        "first": "Kap-Joong",
        "last": "Kim",
        "affiliation": "ETRI"
      },
      {
        "email": "yhko@etri.re.kr",
        "first": "Young-Ho",
        "last": "Ko",
        "affiliation": "ETRI"
      },
      {
        "email": "cjyoun@etri.re.kr",
        "first": "Chun Ju",
        "last": "Youn",
        "affiliation": "ETRI"
      }
    ],
    "abstract": "Free-space quantum key distribution (QKD) is a promising solution for secure communication between two remote parties through free space. Due to the possibility of free space communication, in general, the application candidates of free space QKD are focused on secure communication between moving terminals. Such applications have characteristics such as moving position, outside operation, and limited internal space and power consumption. First, the moving position of a terminal needs active compensation of a shared reference between transmitter and receiver because general QKD protocols requires a shared reference frame, i.e., polarization reference in a QKD protocol using polarization encoding. This can be solved by using reference frame independent (RFI) QKD. Second, the outside operation brings intensive noise issue caused by the sun light which significantly degrades the performance of free-space QKD. The change of operating wavelength of QKD to 1550-nm and single mode fiber coupling can significantly alleviate the noise issue. Finally, the limitation of internal space requires to chip scale implementation. The use of 1550-nm wavelength provides comparability of integrated (silicon) photonic chips which is already studied in the fiber based QKD.\r\n\r\nIn this paper, we provide a 1550-nm free-space RFI QKD system which incorporates the aforementioned solutions while the previous free-space RFI QKD is realized with visible wavelength. We also shows that our system achieves about 0.8% quantum bit error rate (QBER) without additional blocking out external light to the receiver through single mode fiber coupling. This low QBER indicates the possibility of daylight free-space QKD.",
    "options": {
      "student-paper": false,
      "name-main-presenter": "Kyongchun Lim",
      "morning-session": true,
      "afternoon-session": false
    }
  },
  {
    "pid": 120,
    "title": "Effect of atmospheric turbulence in CV-QKD with passive Eve",
    "authors": [
      {
        "email": "ethm500@york.ac.uk",
        "first": "Emma",
        "last": "Medlock",
        "affiliation": "Department of Physics, University of York",
        "contact": true
      },
      {
        "email": "rupesh.kumar@york.ac.uk",
        "first": "Rupesh",
        "last": "Kumar",
        "affiliation": "Department of Physics, University of York",
        "contact": true
      },
      {
        "email": "timothy.spiller@york.ac.uk",
        "first": "Tim",
        "last": "Spiller",
        "affiliation": "Department of Physics, University of York",
        "contact": true
      }
    ],
    "abstract": "We consider passive eavesdropping in continuous-variable quantum key distribution (CV-QKD) over atmospheric turbulence channels. We study the effect of turbulence in creating independent channels from Alice to Bob and  Eve, and examine the performance of transmitted local oscillator (TLO) and local local oscillator (LLO) based CV-QKD system.",
    "options": {
      "student-paper": true,
      "name-main-presenter": "Emma Medlock",
      "morning-session": true,
      "afternoon-session": false
    }
  },
  {
    "pid": 126,
    "title": "Simple integration of quantum and beam tracking channels for free-space quantum key distribution",
    "authors": [
      {
        "email": "minchul.kim@etri.re.kr",
        "first": "Minchul",
        "last": "Kim",
        "affiliation": "ETRI",
        "contact": true
      },
      {
        "email": "lim.kc@etri.re.kr",
        "first": "Kyongchun",
        "last": "Lim",
        "affiliation": "ETRI",
        "contact": true
      },
      {
        "email": "chbs@etri.re.kr",
        "first": "Byung-Seok",
        "last": "Choi",
        "affiliation": "ETRI"
      },
      {
        "email": "jschoe@etri.re.kr",
        "first": "Joong-Seon",
        "last": "Choe",
        "affiliation": "ETRI"
      },
      {
        "email": "k.j.kim@etri.re.kr",
        "first": "Kap-Joong",
        "last": "Kim",
        "affiliation": "ETRI"
      },
      {
        "email": "yhko@etri.re.kr",
        "first": "Young-Ho",
        "last": "Ko",
        "affiliation": "ETRI"
      },
      {
        "email": "bjh1213@etri.re.kr",
        "first": "Ju Hee",
        "last": "Baek",
        "affiliation": "ETRI"
      },
      {
        "email": "cjyoun@etri.re.kr",
        "first": "Chun Ju",
        "last": "Youn",
        "affiliation": "ETRI"
      }
    ],
    "abstract": "Free-space quantum key distribution (QKD) has received an increasing attention for its inherent secure communication between two remote systems. Most of the free-space QKD systems require integration of various signals such as quantum and beam tracking channels with different wavelengths into the same optical path for beam tracking. The beam tracking system, consisting of fast steering mirrors and position detectors, maintains optical beam path by adjusting the misalignments induced by moving terminals, vibrations and atmospheric turbulence in the free-space QKD system. Most QKD systems use dichroic mirrors for combining and separating quantum and beam tracking channels through free-space alignment. However, integration of such channels in free-space could require a large volume space, much alignment effort for mode overlap and can be easily affected by mechanical shock.\r\nIn this paper, we report the effect of using a fiber-based wavelength division multiplexing (WDM) filter for integrating the quantum and beam tracking channels in free-space QKD systems. A custom-made WDM filter was used in the transmitter part of the free-space BB84 QKD system, combining a 785 nm signal for quantum channel and a 1550 nm signal for beam tracking channel. HI780 fiber was selected for common output port of the device to maintain the orthogonality of polarization states and beam quality of the quantum channel. Although 1550 nm signal can suffer from the insertion and bending loss caused by smaller core size of the HI780 fiber, we could reduce the loss as low as 1.4 dB by designing the fiber with length within about 15 cm, well straightened. We could also obtain good beam quality and mode overlap of the quantum and beam tracking channels by using the common output port of the WDM filter.",
    "options": {
      "student-paper": false,
      "name-main-presenter": "Minchul Kim",
      "morning-session": true,
      "afternoon-session": false
    }
  },
  {
    "pid": 127,
    "title": "Increasing loss-budget of a free-space CVQKD system",
    "authors": [
      {
        "email": "igor.konieczniak@york.ac.uk",
        "first": "Igor",
        "last": "Konieczniak",
        "affiliation": "University of York",
        "contact": true
      },
      {
        "email": "rupesh.kumar@york.ac.uk",
        "first": "Rupesh",
        "last": "Kumar",
        "affiliation": "University of York",
        "contact": true
      },
      {
        "email": "gerald.bonner@fraunhofer.co.uk",
        "first": "Gerald",
        "last": "Bonner",
        "affiliation": "Fraunhofer Centre for Applied Photonics"
      },
      {
        "email": "tim.spiller@york.ac.uk",
        "first": "Tim",
        "last": "Spiller",
        "affiliation": "University of York"
      }
    ],
    "abstract": "Quantum Key Distribution (QKD) over a free-space channel is challenging due to inefficient coupling of received signals to the detection system. A narrow detector cross-section, such as with fibre coupling to a telescope, reduces the field of view (FOV) and thus increases the loss due to atmospheric turbulence. A larger detector cross-section increases the FOV; however, the corresponding increase in background noise also increases the QBER associated with a Discrete Variable (DV) QKD system. On the contrary, Continuous Variable (CV) QKD systems are highly tolerant to background noise, but their performance is still limited by the channel loss.   The FOV of the receiver is defined as the area expressed in solid angle from which the detector can accepts signal. A simple geometrical analysis reveals FOV as $\\Theta = 2\\tan^{-1}(d/2F)$, where $d$ is the detector diameter and $F$ is the effective focal length of the receiver telescope.  With a large-area detector, one can design the signal collection optics, such that the FOV of the telescope with a given aperture can be larger. In this work, we present a larger FOV receiver system for CVQKD which reduces the channel loss due to beam wandering and atmospheric turbulence. We will describe the performance of the receiver system in terms of shot-noise sensitivity, loss reduction and enhancement in secure key rate, compared to a typical fibre-coupled receiver system.",
    "options": {
      "student-paper": false,
      "name-main-presenter": "Igor Konieczniak",
      "morning-session": true,
      "afternoon-session": false
    }
  },
  {
    "pid": 133,
    "title": "Standardization and Certification of QKD-Devices and QKD-Networks",
    "authors": [
      {
        "email": "oliver.maurhart@ait.ac.at",
        "first": "Oliver",
        "last": "Maurhart",
        "affiliation": "AIT",
        "contact": true
      },
      {
        "email": "thomas.laenger@gmx.at",
        "first": "Thomas",
        "last": "Länger",
        "affiliation": "AIT"
      },
      {
        "email": "andreas.poppe@ait.ac.at",
        "first": "Andreas",
        "last": "Poppe",
        "affiliation": "AIT",
        "contact": true
      },
      {
        "email": "christoph.pacher@ait.ac.at",
        "first": "Christoph",
        "last": "Pacher",
        "affiliation": "AIT",
        "contact": true
      },
      {
        "email": "martin.stierle@ait.ac.at",
        "first": "Martin",
        "last": "Stierle",
        "affiliation": "AIT"
      },
      {
        "email": "helmut.leoplod@ait.ac.at",
        "first": "Helmut",
        "last": "Leopold",
        "affiliation": "AIT"
      }
    ],
    "abstract": "The transition of Quantum Technologies (QT) being no longer pure basic research but touching applied fields with emerging products is companied by requests for standardization and certification. The call of the markets requesting products based on QT will require alignment of QT products to match not only the need for standards but also the proof to fulfil certification procedures. We will isolate and identify the most promising candidates for this endeavour and by listing challenges, obstacles and dependencies we will propose a strategy and envision a standardization roadmap",
    "options": {
      "student-paper": false,
      "morning-session": false,
      "afternoon-session": false
    }
  },
  {
    "pid": 140,
    "title": "Simple Method for Asymmetric Twin-Field Quantum Key Distribution",
    "authors": [
      {
        "email": "wenyuan.wang@uwaterloo.ca",
        "first": "Wenyuan",
        "last": "Wang",
        "affiliation": "Centre for Quantum Information and Quantum Control (CQIQC), Dept. of Electrical & Computer Engineering and Dept. of Physics, University of Toronto, Toronto, Ontario, M5S 3G4, Canada; Current address: Institute for Quantum Computing and Department of Physics and Astronomy, University of Waterloo, Waterloo, Ontario, Canada N2L 3G1",
        "contact": true
      },
      {
        "first": "Hoi-Kwong",
        "last": "Lo",
        "affiliation": "Centre for Quantum Information and Quantum Control (CQIQC), Dept. of Electrical & Computer Engineering and Dept. of Physics, University of Toronto, Toronto, Ontario, M5S 3G4, Canada"
      }
    ],
    "abstract": "Twin-Field quantum key distribution (TF-QKD) can beat the linear bound of repeaterless QKD systems. After the proposal of the original protocol, multiple papers have extended the protocol to prove its security. However, these works are limited to the case where the two channels have equal amount of loss (i.e. are symmetric). In a practical network setting, it is very likely that the channels are asymmetric due to e.g. geographical locations. In this work we extend a version of the TF-QKD protocol to the scenario with asymmetric channels. We show that by simply adjusting the two signal states of the two users (and not necessarily the decoy states) they can effectively compensate for channel asymmetry and consistently obtain higher key rate than either using no compensation or using the strategy of deliberately adding fibre to the shorter channel. We perform simulation with realistic parameters and finite data size, and show that our method works well and has a clear advantage over prior art methods in the presence of channel asymmetry.",
    "options": {
      "student-paper": false,
      "name-main-presenter": "Wenyuan Wang",
      "morning-session": true,
      "afternoon-session": false
    }
  },
  {
    "pid": 142,
    "title": "A high efficiency reconciliation method for free-space continuous-variable QKD based on rate compatible codes",
    "authors": [
      {
        "email": "zhouc@bupt.edu.cn",
        "first": "Chao",
        "last": "Zhou",
        "affiliation": "Beijing University of Posts and Telecommunications (BUPT)",
        "contact": true
      },
      {
        "first": "Xiangyu",
        "last": "Wang",
        "affiliation": "Beijing University of Posts and Telecommunications (BUPT)"
      },
      {
        "first": "Yichen",
        "last": "Zhang",
        "affiliation": "Beijing University of Posts and Telecommunications (BUPT)"
      },
      {
        "first": "Zhiguo",
        "last": "Zhang",
        "affiliation": "Beijing University of Posts and Telecommunications (BUPT)"
      },
      {
        "first": "Song",
        "last": "Yu",
        "affiliation": "Beijing University of Posts and Telecommunications (BUPT)"
      },
      {
        "first": "Hong",
        "last": "Guo",
        "affiliation": "Peking University"
      }
    ],
    "abstract": "We propose a high efficiency reconciliation method for continuous-variable quantum key distribution over free-space channel based on rate compatible codes, which achieves stable reconciliation efficiency of more than 95% under the fluctuation of the SNR (as low as -16 dB).",
    "options": {
      "student-paper": true,
      "name-main-presenter": "Chao Zhou",
      "morning-session": true,
      "afternoon-session": false
    }
  },
  {
    "pid": 143,
    "title": "An upstream access network based on continuous-variable quantum key distribution",
    "authors": [
      {
        "email": "2013213073@bupt.edu.cn",
        "first": "Yundi",
        "last": "Huang",
        "affiliation": "Beijing University of Posts and Telecommunications",
        "contact": true
      },
      {
        "email": "zhangyc@bupt.edu.cn",
        "first": "Yichen",
        "last": "Zhang",
        "affiliation": "Beijing University of Posts and Telecommunications"
      },
      {
        "email": "tao@bupt.edu.cn",
        "first": "Tao",
        "last": "Shen",
        "affiliation": "Beijing University of Posts and Telecommunications"
      },
      {
        "email": "602397308@qq.com",
        "first": "Ge",
        "last": "Huang",
        "affiliation": "Beijing University of Posts and Telecommunications"
      },
      {
        "email": "yusong@bupt.edu.cn",
        "first": "Song",
        "last": "Yu",
        "affiliation": "Beijing University of Posts and Telecommunications"
      },
      {
        "email": "hongguo@pku.edu.cn",
        "first": "Hong",
        "last": "Guo",
        "affiliation": "Peking University"
      }
    ],
    "abstract": "Quantum key distribution (QKD) is designed to establish symmetric keys among two legitimate parties. Continuous variable (CV) QKD that uses the coherent states and homodyne detection can only apply the cost-effective telecommunication components[1]. The field test of CV-QKD has reached over 50 km[2], and under the laboratory conditions, experimental demonstration of over 200km has been reported [3], thus, has revealed great potentials in practical implementations. The access network that allows multitude end-users to connect to the nodal network is a necessary in the modern network infrastructure since it is suitable for general home-to-home scenarios. Quantum access network was first proposed [4] and demonstrated in field tests [5] for discrete variable QKD. Here, we report an upstream access network based on CV-QKD. In our experimental demonstrations, two transmitters Alice are deployed as optical network units that simultaneously send signals to the network, the receiver Bob is acted as the optical line terminal. The optical distribution network is located between the optical network units and the optical line terminal to couple the signals. The signals generated from each optical network unit are required to pass through a variable delay line to calibrate the arriving time at the optical distribution network before being transmitted. The signals are then simultaneously sent to the optical distribution network through fibers of 5.3 km and 12.3 km respectively. When the signals approach to the optical distribution network, dynamic polarization control modules are firstly applied in each path to pre-compensate the polarization. The signals are then coupled through a beamsplitter and forwarded to the optical line terminal. With a system repetition frequency of 2.5 MHz, we obtain the averaged secret key rates of 55 kbps and 22 kbps for Alice No. 1 and Alice No. 2 respectively. The total secret key rates has reached 77 kbps which suggests a higher network capacity. The excess noise is relatively stable, yet there are small fluctuations in the secret key rates. To one step further reduce the loss, the wavelength division multiplexing devices can be used at the optical distribution network. This is especially beneficial when the quantum signal has to co-propagate with classical data channels in the same fiber [6,7]. The upstream access network implementations can be easily extended to a higher repetition frequency system or to support more users. The demonstration experiments provide the possibility of building practical large-scale CV-QKD networks. This work is supported by the Key Program of National Natural Science Foundation of China under Grants No. 61531003, and the Fund of CETC under Grant No. 6141B08231115.\r\n\r\n\r\nReferences \r\n1. C.Weedbrook, S. Pirandola, R. Garc´ıa-Patr´on, N. J. Cerf, T. C. Ralph, J. H. Shapiro and S. Lloyd, Gaussian quantum information, Rev. Mod. Phys. 84, 621 (2012). \r\n2. Y. Zhang, Z. Li, Z. Chen, C. Weedbrook, Y. Zhao, X. Wang, Y. Huang, C. Xu, X. Zhang, Z. Wang, M. Li, X. Zhang, Z. Zheng, B. Chu, X. Gao, N. Meng,W. Cai, X.Wang, G.Wang, S. Yu and H. Guo, Continuous- variable QKD over 50 km commercial fiber, Quantum Sci. Technol. 4, 035006 (2019). \r\n3. Y. Zhang, Z. Chen, S. Pirandola, X. Wang, C. Zhou, B. Chu, Y. Zhao, B. Xu, S. Yu and H. Guo, Long- distance continuous-variable quantum key distribution over 202.81 km fiber, arXiv:2001.02555 (2020). (Accepted by Phys. Rev. Lett.) \r\n4. B. Fr¨ohlich, J. F. Dynes, M. Lucamarini, A. W. Sharpe, Z. Yuan and A. J. Shields, A quantum access network, Nature 501, 69-72 (2013). \r\n5. B. K. Park, M. K. Woo, Y. S. Kim, Y. W. Cho, S. Moon and S. W. Han, User-independent optical path length compensation scheme with sub-nanosecond timing resolution for a 1* N quantum key distribution network system, Photon. Res. 8, 296 (2020). \r\n6. T. A. Eriksson, T. Hirano, B. J. Puttnam, G. Rademacher, R. S. Lu´ıs, M. Fujiwara, R. Namiki, Y. Awaji, M. Takeoka, N. Wada and M. Sasaki, Wavelength division multiplexing of continuous variable quantum key distribution and 18.3 Tbit/s data channels, Commun. Phys. 2, 9 (2019). \r\n7. B. Chu, Y. Zhang, Y. Zhao, Y. Xu, X. Chen, X. Wang and S. Yu, Crosstalk-induced impact of coexisting DWDM network on continuous-variable QKD, 16th International Conference on the Design of Reliable Communication Networks DRCN, Milano, Italy, pp. 1-5 (2020).",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-25a2deb005599e564a817b8cbe47677e9e24b2edda851054caaae4a05e0a762c",
        "timestamp": 1592296471,
        "size": 26873,
        "filename": "Qcrypt.pdf"
      },
      "student-paper": false,
      "name-main-presenter": "Yundi Huang",
      "morning-session": true,
      "afternoon-session": false
    }
  },
  {
    "pid": 144,
    "title": "Dual-polarization continuous-variable quantum key distribution with discrete modulation",
    "authors": [
      {
        "email": "chubinjie@bupt.edu.cn",
        "first": "Binjie",
        "last": "Chu",
        "affiliation": "Beijing University of Posts and Telecommunications",
        "contact": true
      },
      {
        "email": "zhangyc@bupt.edu.cn",
        "first": "Yichen",
        "last": "Zhang",
        "affiliation": "Beijing University of Posts and Telecommunications"
      },
      {
        "email": "blue_xyf@163.com",
        "first": "Yifan",
        "last": "Xu",
        "affiliation": "Beijing University of Posts and Telecommunications"
      },
      {
        "email": "yusong@bupt.edu.cn",
        "first": "Song",
        "last": "Yu",
        "affiliation": "Beijing University of Posts and Telecommunications"
      },
      {
        "email": "hongguo@pku.edu.cn",
        "first": "Hong",
        "last": "Guo",
        "affiliation": "Peking University"
      }
    ],
    "abstract": "We report the polarization-multiplexed CV-QKD with four-state modulation capable of full use of two orthogonal polarization channels and experimentally investigate it. We design a polarization and phase compensation scheme by introducing a pair of rather than one single regularly spaced reference data timemultiplexed with weaker signal data. The polarization mixing and relative phase can be estimated simultaneously by using the transmitted reference data and the corresponding detection data to calculate a overall rotation matrix, and compensated by rotating Bob's received data. The results show that combined with our efficient polarization and phase compensation scheme this low-complexity scheme can further improve the secret key rate\r\nand prompt CV-QKD to be network-compatible  and on-chip integrated.",
    "options": {
      "student-paper": true,
      "name-main-presenter": "Binjie Chu",
      "morning-session": true,
      "afternoon-session": false
    }
  }
]
