[
  {
    "pid": 4,
    "title": "Universal limitations on quantum key distribution over a network",
    "authors": [
      {
        "email": "sidddas@ulb.ac.be",
        "first": "Siddhartha",
        "last": "Das",
        "affiliation": "École polytechnique de Bruxelles, Université libre de Bruxelles",
        "contact": true
      },
      {
        "email": "Stefan.Baeuml@icfo.eu",
        "first": "Stefan",
        "last": "Bäuml",
        "affiliation": "ICFO-Institut de Ciencies Fotoniques, The Barcelona Institute of Science and Technology",
        "contact": true
      },
      {
        "email": "winczewskimarek@gmail.com",
        "first": "Marek",
        "last": "Winczewski",
        "affiliation": "National Quantum Information Centre in Gdańsk, University of Gdańsk",
        "contact": true
      },
      {
        "email": "khorodec@inf.ug.edu.pl",
        "first": "Karol",
        "last": "Horodecki",
        "affiliation": "International Centre for Theory of Quantum Technologies, University of Gdańsk",
        "contact": true
      }
    ],
    "abstract": "Entanglement is an intriguing quantum phenomenon with crucial implications for both fundamental physics and technological applications, e.g., quantum key distribution (QKD). In this paper, we show that multipartite private states from which secret keys are directly accessible to trusted partners are genuinely multipartite entangled states. With application to secure Quantum Internet, we consider the most general setup of multipartite quantum process (channel) in a network setting: multiplex quantum channel with involved parties having one of the three possible roles-- that of only sender or receiver, or both sender and receiver. We derive divergence-based measures for entangling abilities of multipartite quantum channels. We describe an LOCC-assisted secret key agreement (SKA) protocol for generation or distillation of key (private random bits) among multiple trusted allies connected through a quantum multiplex channel secure against a quantum eavesdropper, of which measurement-device-independent QKD and SKA protocols over quantum network laced with key repeaters are particular instances. We are able to provide upper bounds on the non-asymptotic private capacities, maximum rate at which secret key can be distilled via \ffinite uses of channels, and lower bounds on asymptotic capacities. These bounds are expressed in terms of the divergence-based entanglement measures of the channels. Some of these measures lead to strong converse bounds on the private capacities. Our upper bounds on the private capacities also are upper bound on the multipartite quantum capacities where goal is to distill Greenberger{Horne{Zeilinger (GHZ) state. Also, we are able to derive upper bound on the secret key bits that can be distilled via LOCC among trusted allies sharing \ffinite copies of multipartite quantum states.",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-d0309f48d3c2c33285405ab1280253c4936f19c11535a9c3472b108723a61121",
        "timestamp": 1584284371,
        "size": 1515756,
        "filename": "revision.pdf"
      },
      "student-paper": false,
      "arxiv-id": "1912.03646",
      "morning-session": false,
      "afternoon-session": true
    }
  },
  {
    "pid": 8,
    "title": "Security of QKD with weak basis-choice flaw",
    "authors": [
      {
        "email": "sunshh8@mail.sysu.edu.cn",
        "first": "Shihai",
        "last": "Sun",
        "affiliation": "School of Physics and Astronomy, Sun Yat-Sen University",
        "contact": true
      },
      {
        "first": "Zhi-Yu",
        "last": "Tian",
        "affiliation": "School of Physics and Astronomy, Sun Yat-Sen University"
      },
      {
        "first": "Mei-Sheng",
        "last": "Zhao",
        "affiliation": "QuantumCTek Co. Ltd."
      },
      {
        "first": "Yan",
        "last": "M",
        "affiliation": "QuantumCTek Co. Ltd."
      }
    ],
    "abstract": "Quantum key distribution (QKD) provides a way to share unconditional secure \r\nkey between two remote parties, but the deviation between theory and practice \r\nwill break the security of generated key. In this article, we evaluate the \r\nsecurity of QKD with weak basis-choice flaw, in which the random bit used by \r\nAlice and Bob to determine their bases are weakly controlled by Eve. In fact, a \r\ntight and analytical bound is obtained to estimate the phase error for both \r\nsingle photon source and weak coherent source, then the key rate can be rapidly \r\nimproved. And the key rate of QKD with biased bases is also considered, in \r\nwhich Alice and Bob distill key from two bases independently. Furthermore, by \r\nevaluating the security of QKD under wavelength attack, the \r\nperformance of a commercial beam splitter is measured, and then the key rate is \r\nestimated, which is just slightly reduced with our method.",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-59b4c0229e1f24f1e5b566ca5357ede7c741686c464bc74c50f0cd6cfc591c02",
        "timestamp": 1595687979,
        "size": 274896,
        "filename": "main_weakrandomness.pdf"
      },
      "student-paper": false,
      "name-main-presenter": "Shihai Sun",
      "morning-session": false,
      "afternoon-session": true
    }
  },
  {
    "pid": 14,
    "title": "Noisy Simon Period Finding",
    "authors": [
      {
        "email": "alex.may@rub.de",
        "first": "Alex",
        "last": "May",
        "affiliation": "Ruhr University Bochum",
        "contact": true
      },
      {
        "email": "lars.schlieper@rub.de",
        "first": "Lars",
        "last": "Schlieper",
        "affiliation": "Ruhr University Bochum",
        "contact": true
      },
      {
        "email": "jonathan.schwinger@rub.de",
        "first": "Joanthan",
        "last": "Schwinger",
        "affiliation": "Ruhr University Bochum"
      }
    ],
    "abstract": "Let $f: \\mathbb{F}_2^n \\rightarrow \\mathbb{F}_2^n$ be a Boolean function with period $\\vec s$. It is well-known that Simon's algorithm finds $\\vec s$ in time polynomial in $n$ on quantum devices that are capable of performing error-correction. However, today's quantum devices are inherently noisy, too limited for error correction, and Simon's algorithm is not error-tolerant.\r\n\r\nWe show that even noisy quantum period finding computations lead to speedups in comparison to purely classical computations. More precisely, we implemented Simon's quantum period finding circuit on the $15$-qubit quantum device IBM Q 16 Melbourne. Our experiments show that with a certain probability $\\tau(n)$ we measure erroneous vectors that are not orthogonal to $\\vec s$. We propose new, simple, but very effective smoothing techniques to classically mitigate physical noise effects such as e.g. IBM Q's bias towards the $0$-qubit.\r\n\r\nAfter smoothing, our noisy quantum device provides us a statistical distribution that we can easily transform into an LPN instance with parameters $n$ and $\\tau(n)$. Hence, in the noisy case we may not hope to find periods in time polynomial in $n$. However, we still obtain quantum advantage even for large errors $\\tau(n)$ close to $\\frac 1 2$. Thus, period finding does not necessarily require full quantum error correction capability.\r\n\r\nkeywords: Noise-tolerant Simon period finding, IBM Q 16, LPN algorithms, quantum advantage",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-4b68ebd99f3f132966a26ed08b14206c9b323a7ff834e600e6150d4d7c3f94dc",
        "timestamp": 1584958963,
        "size": 1114300,
        "filename": "noisy_simon.pdf"
      },
      "student-paper": false,
      "name-main-presenter": "Lars Schlieper",
      "arxiv-id": "1910.00802",
      "morning-session": true,
      "afternoon-session": true
    }
  },
  {
    "pid": 15,
    "title": "Linear programs for entanglement and key distribution in the quantum internet",
    "authors": [
      {
        "email": "stefan.baeuml@icfo.eu",
        "first": "Stefan",
        "last": "Baeuml",
        "affiliation": "ICFO-Institut de Ciencies Fotoniques",
        "contact": true
      },
      {
        "email": "koji.azuma.ez@hco.ntt.co.jp",
        "first": "Koji",
        "last": "Azuma",
        "affiliation": "NTT Basic Research Laboratories",
        "contact": true
      },
      {
        "email": "go.kato.gm@hco.ntt.co.jp",
        "first": "Go",
        "last": "Kato",
        "affiliation": "NTT Communication Science Laboratories",
        "contact": true
      },
      {
        "email": "d.elkousscoronas@tudelft.nl",
        "first": "David",
        "last": "Elkouss",
        "affiliation": "Delft University of Technology",
        "contact": true
      }
    ],
    "abstract": "Quantum networks will allow to implement communication tasks beyond the reach of their classical counterparts. A pressing and necessary issue for the design of quantum network protocols is the quantification of the rates at which these tasks can be performed. Here, we propose a simple recipe that yields efficiently computable lower and upper bounds on the maximum achievable rates. For this we make use of the max-flow min-cut theorem and its generalization to multi-commodity flows to obtain linear programs. We exemplify our recipe deriving the linear programs for bipartite settings, settings where multiple pairs of users obtain entanglement in parallel as well as multipartite settings, covering almost all known situations.  We also make use of a generalization of the concept of paths between user pairs in a network to Steiner trees spanning a group of users wishing to establish Greenberger-Horne-Zeilinger states.",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-394752db9ee01071b91405122fcf620a13124f7dac148b02db1a742eae4b60e7",
        "timestamp": 1584962341,
        "size": 782286,
        "filename": "Linear programs for entanglement and key distribution in the quantum internet.pdf"
      },
      "student-paper": false,
      "arxiv-id": "1809.03120",
      "morning-session": false,
      "afternoon-session": true
    }
  },
  {
    "pid": 37,
    "title": "Experimental semi-quantum key distribution with classical users",
    "authors": [
      {
        "email": "francesco.massa@univie.ac.at",
        "first": "F.",
        "last": "Massa",
        "affiliation": "University of Vienna"
      },
      {
        "email": "pri8.phy@gmail.com",
        "first": "P.",
        "last": "Yadav",
        "affiliation": "Algran Portugal"
      },
      {
        "email": "amir.moqanaki@univie.ac.at",
        "first": "A.",
        "last": "Moqanaki",
        "affiliation": "University of Vienna"
      },
      {
        "email": "walter.krawec@gmail.com",
        "first": "W. O.",
        "last": "Krawec",
        "affiliation": "University of Connecticut",
        "contact": true
      },
      {
        "email": "pacmateus@gmail.com",
        "first": "P.",
        "last": "Mateus",
        "affiliation": "Inst. Superior Tecnico Lisbon"
      },
      {
        "email": "npaunkov@math.tecnico.ulisboa.pt",
        "first": "N.",
        "last": "Paunkovic",
        "affiliation": "Inst. Superior Tecnico Lisbon"
      },
      {
        "email": "ansouto@fc.ul.pt",
        "first": "A.",
        "last": "Souto",
        "affiliation": "Universidade de Lisboa"
      },
      {
        "email": "philip.walther@univie.ac.at",
        "first": "P.",
        "last": "Walther",
        "affiliation": "University of Vienna"
      }
    ],
    "abstract": "The use of quantum systems allows for new insights which promise to revolutionize information processing.  Quantum cryptography, especially key distribution, has become one of the most prominent applications of quantum technology.  However, this task still requires users to be capable of performing quantum operations, such as state preparation or measurements in multiple bases.  A natural question, therefore, is can users' technological requirements be reduced?  In this work, we experimentally demonstrate a novel quantum key distribution protocol where users are fully classical and quantum operations are only performed by an untrusted third party acting as a server.  We derive an information theoretic proof of security for our protocol along with an experimental demonstration.",
    "options": {
      "student-paper": false,
      "name-main-presenter": "Walter O. Krawec",
      "arxiv-id": "1908.01780",
      "morning-session": false,
      "afternoon-session": true
    }
  },
  {
    "pid": 45,
    "title": "Semi-Device-Independent Heterodyne-based Quantum Random Number Generator",
    "authors": [
      {
        "email": "hamid.tebyanian@studenti.unipd.it",
        "first": "Hamid",
        "last": "Tebyanian",
        "affiliation": "Dipartimento di Ingegneria dell’Informazione, Università degli Studi di Padova, Padova, Italia",
        "contact": true
      },
      {
        "email": "marco.avesani91@gmail.com",
        "first": "Marco",
        "last": "Avesani",
        "affiliation": "Dipartimento di Ingegneria dell’Informazione, Università degli Studi di Padova, Padova, Italia"
      },
      {
        "email": "paolo.villoresi@dei.unipd.it",
        "first": "Paolo",
        "last": "Villoresi",
        "affiliation": "Dipartimento di Ingegneria dell’Informazione, Università degli Studi di Padova, Padova, Italia",
        "contact": true
      },
      {
        "email": "vallone@dei.unipd.it",
        "first": "Giuseppe",
        "last": "Vallone",
        "affiliation": "Dipartimento di Ingegneria dell’Informazione, Università degli Studi di Padova, Padova, Italia",
        "contact": true
      }
    ],
    "abstract": "Randomness is a fundamental feature of quantum mechanics, which is an invaluable resource for both classical and quantum technologies. Practical quantum random number generators (QRNG) usually need to trust their devices, but their security can be jeopardized in case of imperfections or malicious external actions. In this work, we present a robust implementation of a Semi-Device-Independent QRNG that guarantees both security and fast generation rates.\r\nThe system works in a prepare and measure scenario where measurement and source are untrusted, but a bound on the energy of the prepared states is assumed. Our implementation exploits heterodyne detection, which offers increased generation rate and improved long-term stability compared to alternative measurement strategies. In particular, due to the tomographic properties of heterodyne measurement, we can compensate for fast phase fluctuations via post-processing, avoiding complex active phase stabilization systems. As a result, our scheme combines high security and speed with a simple setup featuring only commercial-off-the-shelf components, making it an attractive solution in many practical scenarios.",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-66b89aa725da16f5e8256528512ccaa57d57f8beaf22e5de81e02589d210f622",
        "timestamp": 1587144138,
        "size": 1302126,
        "filename": "Semi_DI_QRNG (1).pdf"
      },
      "student-paper": true,
      "morning-session": false,
      "afternoon-session": false
    }
  },
  {
    "pid": 48,
    "title": "Security analysis of discrete-modulated continuous-variable quantum key distribution",
    "authors": [
      {
        "email": "jie.lin@uwaterloo.ca",
        "first": "Jie",
        "last": "Lin",
        "affiliation": "Institute for Quantum Computing and Department of Physics and Astronomy, University of Waterloo",
        "contact": true
      },
      {
        "email": "twesh.upadhyaya@uwaterloo.ca",
        "first": "Twesh",
        "last": "Upadhyaya",
        "affiliation": "Institute for Quantum Computing and Department of Physics and Astronomy, University of Waterloo",
        "contact": true
      },
      {
        "email": "nlutkenhaus@uwaterloo.ca",
        "first": "Norbert",
        "last": "Lütkenhaus",
        "affiliation": "Institute for Quantum Computing and Department of Physics and Astronomy, University of Waterloo",
        "contact": true
      }
    ],
    "abstract": "Discrete-modulated continuous-variable quantum key distribution protocols are favorable due to the experimental simplicity and inherited properties of continuous-variable protocols. We provide a tight numerical key rate analysis of discrete-modulated continuous-variable quantum key distribution protocols in the asymptotic limit against collective attacks. As a specific example, we analyze the key rate of the quadrature phase-shift keying (QPSK) scheme in both the paranoid and realistic scenarios. When the detector noises are trusted, the QPSK scheme is expected to reach around 100 km with currently feasible experimental parameters. For both scenarios, we also investigate the performance of post-selection of data for the reverse reconciliation scheme and show that post-selection can provide improvements in the key rate as well as reducing the amount of data for post-processing.",
    "options": {
      "student-paper": true,
      "name-main-presenter": "Jie Lin",
      "arxiv-id": "2006.06166, 1905.10896",
      "morning-session": false,
      "afternoon-session": true
    }
  },
  {
    "pid": 51,
    "title": "Finite Block Length Analysis on Incoherent Randomness Extraction and Quantum Coherence Distillation",
    "authors": [
      {
        "email": "hayashi@sustech.edu.cn",
        "first": "Masahito",
        "last": "Hayashi",
        "affiliation": "Southern University of Science and Technology",
        "contact": true
      },
      {
        "email": "kun.fang@uwaterloo.ca",
        "first": "Kun",
        "last": "Fang",
        "affiliation": "University of Waterloo",
        "contact": true
      }
    ],
    "abstract": "Randomness is one of the key ingredients to information processing in practice, especially for computation and cryptography. A vast number of applications critically rely on abundant, high-quality random numbers that are generated securely. In this work we introduce a variant of randomness extraction framework, named \\emph{incoherent randomness extraction} (IRE), in the context of quantum coherence theory where free incoherent operations are employed. This cryptographic framework unveils a new perspective to the study of quantum coherence distillation (QCD) by an \\emph{exact} one-shot connection, that is, the maximum number of secure random bits extractable from a single instance of \\emph{unstructured} quantum state is precisely equal to the maximum number of coherent bits that can be distilled from the same state. This exact relation not only sharpens our understanding on the operational equivalence between randomness and coherence, but also enables us to derive tight second order expansions (estimation of the number of extractable random bits/distillable coherent bits to the order~$o(\\sqrt{n})$ where $n$ is the number of the prepared source states) of both tasks in the independent and identically distributed setting. Remarkably, the incoherent operation classes that can empower coherence distillation for generic states all lead to the same second order expansions, indicating their operational equivalence for QCD as well as IRE in both asymptotic and large block length regimes. As a by-product, we showcase a proof of the strong converse property for IRE from its second order expansion, excluding a possible tradeoff between the insecurity threshold and the rate of extractable randomness of a protocol. This also contributes to an alternative strong converse proof for QCD due to their exact one-shot correspondence.",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-790849a8be4aab1c0cda7a5dddb4edc36eb4fee36df8f983415315565b5e6702",
        "timestamp": 1587139594,
        "size": 344639,
        "filename": "Qcrypt.pdf"
      },
      "student-paper": false,
      "name-main-presenter": "Kun Fang",
      "arxiv-id": "2002.12004",
      "morning-session": false,
      "afternoon-session": true
    }
  },
  {
    "pid": 60,
    "title": "Nonlocal games, synchronous correlations, and Bell inequalities",
    "authors": [
      {
        "email": "ngrodrig@cs.umd.edu",
        "first": "Nishant",
        "last": "Rodrigues",
        "affiliation": "University of Maryland",
        "contact": true
      },
      {
        "email": "bclackey@umd.edu",
        "first": "Brad",
        "last": "Lackey",
        "affiliation": "Microsoft Quantum",
        "contact": true
      }
    ],
    "abstract": "Nonlocal games with synchronous correlations are a natural generalization of functions between two finite sets. In this work we examine analogues of Bell's inequalities for such correlations, and derive a synchronous device-independent quantum key distribution protocol. This protocol has the advantage of symmetry between the two users and self-testing while generating shared secret key without requiring a preshared secret. We show that, unlike general correlations and the CHSH inequality, there can be no quantum Bell violation among synchronous correlations with two measurement settings. However we exhibit explicit analogues of Bell's inequalities for synchronous correlations with three measurement settings and two outputs, provide an analogue of Tsirl'son's bound in this setting, and prove existence and rigidity of quantum correlations that saturate this bound. We conclude by posing a security assumption that bypasses the locality, or causality, loophole and examine the protocol's robustness against measurement error and depolarization noise.",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-8298da8edd05f51d5ab4ab7844ea3ca7bc367ca11db14b2b7190484ea25109f5",
        "timestamp": 1587136586,
        "size": 399201,
        "filename": "RodriguesLackeyFullPaper.pdf"
      },
      "student-paper": false,
      "morning-session": false,
      "afternoon-session": false
    }
  },
  {
    "pid": 67,
    "title": "Efficient quantum random number generation with full entropy extraction from SPAD based systems",
    "authors": [
      {
        "email": "andrea.stanco@unipd.it",
        "first": "Andrea",
        "last": "Stanco",
        "affiliation": "University of Padova, Department of Information Engineering",
        "contact": true
      },
      {
        "email": "davgmar@googlemail.com",
        "first": "Davide Giacomo",
        "last": "Marangon",
        "affiliation": "University of Padova, Department of Information Engineering",
        "contact": true
      },
      {
        "email": "vallone@dei.unipd.it",
        "first": "Giuseppe",
        "last": "Vallone",
        "affiliation": "University of Padova, Department of Information Engineering",
        "contact": true
      },
      {
        "email": "samuel.burri@epfl.ch",
        "first": "Samuel",
        "last": "Burri",
        "affiliation": "EPFL"
      },
      {
        "email": "edoardo.charbon@epfl.ch",
        "first": "Edoardo",
        "last": "Charbon",
        "affiliation": "EPFL"
      },
      {
        "email": "paolo.villoresi@dei.unipd.it",
        "first": "Paolo",
        "last": "Villoresi",
        "affiliation": "University of Padova, Department of Information Engineering",
        "contact": true
      }
    ],
    "abstract": "We present two different QRNG devices which allow to maximize the entropy extraction of a system and so the generation rate. The two devices use single-photon avalanche diode along (SPAD) with FPGA device. The first device, Randy, uses only one SPAD and with a post-processing based on the Peres algorithm [Y. Peres, Ann. Statist. 20, 590 (1992)], has a generation rate of 1.8 Mbit/s. The second device, LinoSPAD, which is a CMOS SPAD array based device and integrate also a time-to-digital converter (TDC) on its FPGA, has a final generation rate of 310 Mbit/s thanks to a improved post-processing procedure which also includes the Zhou-Bruck algorithm [H. Zhou and J. Bruck, arXiv:1209.0726 (2012)].",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-0c0ba23e8e10ba4b062001e8b35b7367c7838978cb0aeaff9925217b054894e9",
        "timestamp": 1587203902,
        "size": 1807340,
        "filename": "1910.05232-Efficient random number generation techniques for CMOS SPAD array based devices.pdf"
      },
      "student-paper": false,
      "name-main-presenter": "Andrea Stanco",
      "arxiv-id": "1910.05232",
      "morning-session": false,
      "afternoon-session": true
    }
  },
  {
    "pid": 69,
    "title": "Post-Quantum Verification of Fujisaki-Okamoto",
    "authors": [
      {
        "email": "unruh@ut.ee",
        "first": "Dominique",
        "last": "Unruh",
        "affiliation": "University of Tartu",
        "contact": true
      }
    ],
    "abstract": "We present a computer-verified formalization of the post-quantum\r\nsecurity proof of the Fujisaki-Okamoto transform (as analyzed by\r\nHövelmanns, Kiltz, Schäge, and Unruh, PKC 2020).  The formalization is\r\ndone in quantum relational Hoare logic and checked in the qrhl-tool\r\n(Unruh, POPL 2019).",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-066bf824fb40c25d4ab5f9cce43f03b6e6e19ace1a194b8214d44bd30325669e",
        "timestamp": 1587150002,
        "size": 630388,
        "filename": "pqfo-verify.pdf"
      },
      "student-paper": false,
      "morning-session": false,
      "afternoon-session": false
    }
  },
  {
    "pid": 71,
    "title": "Performance and security of 5 GHz repetition rate polarization-based Quantum Key Distribution",
    "authors": [
      {
        "email": "Fadri.Gruenenfelder@unige.ch",
        "first": "Fadri",
        "last": "Grünenfelder",
        "affiliation": "University of Geneva",
        "contact": true
      },
      {
        "email": "Alberto.Boaron@unige.ch",
        "first": "Alberto",
        "last": "Boaron",
        "affiliation": "University of Geneva"
      },
      {
        "email": "Davide.Rusca@unige.ch",
        "first": "Davide",
        "last": "Rusca",
        "affiliation": "University of Geneva"
      },
      {
        "email": "anthony.martin@inphyni.cnrs.fr",
        "first": "Anthony",
        "last": "Martin",
        "affiliation": "Institut de Physique de Nice"
      },
      {
        "email": "Hugo.Zbinden@unige.ch",
        "first": "Hugo",
        "last": "Zbinden",
        "affiliation": "University of Geneva"
      }
    ],
    "abstract": "We implement 5 GHz clocked polarization-based simplified BB84 protocol. Secret keys can be distributed over 151.5 km of standard telecom fiber at a rate of 54.5 kbps. The high clock frequency might give rise to correlations between the pulses. We characterize the correlations in decoy intensity, polarization and in the phase between the pulses and discuss their impact on the security of the protocol.",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-c1e5f5c0c944267748baee81942efac56f2bb1b0ce27d4acb478ea29356b79cc",
        "timestamp": 1596115667,
        "size": 338192,
        "filename": "paper_cheetah.pdf"
      },
      "student-paper": false,
      "name-main-presenter": "Fadri Grünenfelder",
      "arxiv-id": "2007.15447",
      "morning-session": false,
      "afternoon-session": true
    }
  },
  {
    "pid": 79,
    "title": "Efficient optimization of secret-key rates in quantum repeater chains",
    "authors": [
      {
        "email": "t.j.coopmans@tudelft.nl",
        "first": "Tim",
        "last": "Coopmans",
        "affiliation": "Delft University of Technology",
        "contact": true
      },
      {
        "email": "boxli@student.ethz.ch",
        "first": "Boxi",
        "last": "Li",
        "affiliation": "Eidgenössische Technische Hochschule Zürich",
        "contact": true
      },
      {
        "email": "s.o.brand@liacs.leidenuniv.nl",
        "first": "Sebastiaan",
        "last": "Brand",
        "affiliation": "Leiden University"
      },
      {
        "email": "D.ElkoussCoronas@tudelft.nl",
        "first": "David",
        "last": "Elkouss",
        "affiliation": "Delft University of Technology",
        "contact": true
      }
    ],
    "abstract": "Losses in the physical transmission medium fundamentally limit the distance that quantum key distribution schemes can cover. By means of quantum repeaters, the reach of these schemes can be extended and chains of quantum repeaters could in principle cover arbitrarily long distances. Here, we first provide an efficient algorithm for completely characterizing the behaviour of a large class of repeater chain protocols. The algorithm determines the fidelity and generation time (waiting time) of the first generated entangled pair between the end nodes of a quantum repeater chain. It has polynomial runtime in the size of the support of the waiting time probability distribution. This runtime improves upon the exponential runtime of existing algorithms and allows us to analyze repeater chains of thousands of segments for some parameter regimes. Second, we use the algorithm for optimizing the achievable secret key rate. For this, we consider a family of repeater schemes generalizing the BDCZ scheme. In particular, the schemes incorporate a cut-off condition that enables to mitigate the effects of decoherence. We find that the use of the optimal cut-off extends the parameter regime for which secret key can be generated and moreover significantly increases the secret-key rate for a large range of parameters. Our algorithms thus serve as useful tools for the design and realization of long-distance quantum key distribution networks.",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-655a74baab51e5f2ef27d50b059550d13fd5d4763559455d6a5fd704434df4a3",
        "timestamp": 1587205934,
        "size": 7947941,
        "filename": "repeater_chain_cutoff_optimization_two_articles.pdf"
      },
      "student-paper": true,
      "name-main-presenter": "Tim Coopmans",
      "arxiv-id": "Based on both 2005.04946 and 1912.07688",
      "morning-session": false,
      "afternoon-session": true
    }
  },
  {
    "pid": 82,
    "title": "Fading channel estimation for free-space continuous-variable secure quantum communication",
    "authors": [
      {
        "email": "ruppert@optics.upol.cz",
        "first": "László",
        "last": "Ruppert",
        "affiliation": "Palacky University Olomouc",
        "contact": true
      },
      {
        "first": "Christian",
        "last": "Peuntinger",
        "affiliation": "Max-Planck-Institut für die Physik des Lichts"
      },
      {
        "first": "Bettina",
        "last": "Heim",
        "affiliation": "Max-Planck-Institut für die Physik des Lichts"
      },
      {
        "first": "Kevin",
        "last": "Günthner",
        "affiliation": "Max-Planck-Institut für die Physik des Lichts"
      },
      {
        "first": "Vladyslav C.",
        "last": "Usenko",
        "affiliation": "Palacky University Olomouc"
      },
      {
        "first": "Dominique",
        "last": "Elser",
        "affiliation": "Max-Planck-Institut für die Physik des Lichts"
      },
      {
        "first": "Gerd",
        "last": "Leuchs",
        "affiliation": "Max-Planck-Institut für die Physik des Lichts"
      },
      {
        "first": "Radim",
        "last": "Filip",
        "affiliation": "Palacky University Olomouc"
      },
      {
        "first": "Christoph",
        "last": "Marquardt",
        "affiliation": "Max-Planck-Institut für die Physik des Lichts"
      }
    ],
    "abstract": "We investigate estimation of fluctuating channels and its effect on security of continuous-variable quantum key distribution. We propose a novel estimation scheme which is based on the clusterization of the estimated transmittance data. We show that uncertainty about whether the transmittance is fixed or not results in a lower key rate. However, if the total number of measurements is large, one can obtain using our method a key rate similar to the non-fluctuating channel even for highly fluctuating channels. We also verify our theoretical assumptions using experimental data from an atmospheric quantum channel. Our method is therefore promising for secure quantum communication over strongly fluctuating turbulent atmospheric channels.",
    "options": {
      "student-paper": false,
      "name-main-presenter": "László Ruppert",
      "morning-session": true,
      "afternoon-session": true
    }
  },
  {
    "pid": 85,
    "title": "Everlasting Secure Key Agreement with performance beyond QKD in a Quantum Computational Hybrid security model",
    "authors": [
      {
        "email": "nilesh.vyas@telecom-paris.fr",
        "first": "Nilesh",
        "last": "Vyas",
        "affiliation": "Telecom Paris",
        "contact": true
      },
      {
        "email": "romain.alleaume@telecom-paris.fr",
        "first": "Romain",
        "last": "Alléaume",
        "affiliation": "Telecom Paris",
        "contact": true
      }
    ],
    "abstract": "Extending the functionality and overcoming the performance limitation under which QKD can operate requires either quantum repeaters or new security models. Investigating the latter option, we introduce the Quantum Computational Hybrid (QCH) security model, where we assume that computationally secure encryption may only be broken after a time much longer than the coherence time of available quantum memories. We propose an explicit d-dimensional key distribution protocol, that we call MUB-Quantum Computational Timelock (MUB-QCT) where one bit is encoded on a qudit state chosen among d + 1 mutually unbiased bases (MUBs). Short-term-secure encryption is used to share the basis information with legitimate users while keeping it unknown from Eve until after her quantum memory decoheres. This allows to reduce Eve’s optimal attack to an immediate measurement followed by post-measurement decoding.\r\nWe demonstrate that MUB-QCT enables everlasting secure key distribution with input states containing up to O(\\sqrt{d})photons. This leads to a series of important improvements when compared to QKD: on the functional side, the ability to operate securely between one sender and many receivers, whose implementation can moreover be untrusted ; significant performance increase, characterized by a O(\\sqrt{d}) multiplication of key rates and an extension by 25km x log(d) of the attainable distance over fiber. Implementable with a large number of modes with current or near-term multimode photonics technologies, the MUB-QCT construction has the potential to provide a radical shift to the performance and practicality of quantum key distribution.",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-b64747919f3da81525216e2d70119ca0856acf73efac81371eb23bd19521dce5",
        "timestamp": 1587206887,
        "size": 3463298,
        "filename": "FullPaper_QCT_QCrypt2020_Submission3.pdf"
      },
      "student-paper": true,
      "name-main-presenter": "Nilesh Vyas",
      "arxiv-id": "2004.10173",
      "morning-session": true,
      "afternoon-session": true
    }
  },
  {
    "pid": 86,
    "title": "Quantum Memory Optimization with Quantum Machine Learning for Quantum Secure Direct Communication",
    "authors": [
      {
        "email": "lasgy_ph@yahoo.com",
        "first": "Laszlo",
        "last": "Gyongyosi",
        "affiliation": "Univ of Southampton, Budapest Univ of Tech, Hungarian Academy of Sciences",
        "contact": true
      }
    ],
    "abstract": "Quantum memories are a fundamental of any global-scale quantum Internet, since these units are necessary for guaranteeing an optimal performance in a high-performance quantum networking scenario. The main problem of quantum memories is the low retrieval efficiency of the systems from the registers of the quantum memory. Here, we define a novel quantum memory called high-retrieval-efficiency (HRE) quantum memory for the quantum Internet. An HRE quantum memory unit integrates local unitary operations on its hardware level for the optimization of the readout procedure and utilizes the advanced techniques of quantum machine learning. The local unitaries of an HRE quantum memory achieve the optimization of the readout procedure in an unsupervised manner without the use of any labeled data or training sequences. The HRE quantum memory is a particularly convenient unit for the construction of a powerful, global-scale quantum Internet.",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-6d69b75f6aeadf8c62eea8f372f13affbca559061c2188c4ed73798664341356",
        "timestamp": 1587160533,
        "size": 1620440,
        "filename": "s41598-019-56689-0.pdf"
      },
      "student-paper": false,
      "morning-session": false,
      "afternoon-session": false
    }
  },
  {
    "pid": 87,
    "title": "Breaking simple quantum position verification protocols with little entanglement",
    "authors": [
      {
        "email": "andrea.olivo@inria.fr",
        "first": "Andrea",
        "last": "Olivo",
        "affiliation": "Inria Paris, LPGP, Université Paris Sud",
        "contact": true
      },
      {
        "email": "ulysse.chabaud@lip6.fr",
        "first": "Ulysse",
        "last": "Chabaud",
        "affiliation": "LIP6, Sorbonne Université"
      },
      {
        "email": "achaillo@inria.fr",
        "first": "André",
        "last": "Chailloux",
        "affiliation": "Inria Paris"
      },
      {
        "email": "frederic.grosshans@lip6.fr",
        "first": "Frédéric",
        "last": "Grosshans",
        "affiliation": "LIP6, CNRS, Sorbonne Université",
        "contact": true
      }
    ],
    "abstract": "Position verification is a cryptographic primitive aiming at securely certifying the location of a party in space. Informationally-secure PV was shown to be impossible through the existence of universal attacks both in the classical setting [Chandran et al., 2009] and in the quantum setting [Buhrman et al., 2014; Beigi and König,2011]. However, while classical attacks require the same amount of resources than the protocol, known universal quantum attacks make use of an exponential amount of entanglement through a technique known as Instantaneous Nonlocal Quantum Computation.\r\n\r\nIn this paper, we characterize attacks to a \"BB84-like\" protocol already proposed in previous work [Kent et al., 2011], based on single photons polarized at an angle θ. We consider adversaries sharing maximally entangled pairs of qudits and find low-dimensional INQC attacks. We find exact attacks against some rational angles, including some sitting outside of the Clifford hierarchy (e.g. π/6), and show no θ allows to tolerate errors higher than ~0.5% against adversaries holding two ebits per protocol's qubit.",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-db2f4345ec5f9e153fb578ac0acc810cb43e59a78f6655a6ef1b45203c29a3c3",
        "timestamp": 1596199050,
        "size": 643466,
        "filename": "main.pdf"
      },
      "student-paper": false,
      "name-main-presenter": "Andrea Olivo",
      "arxiv-id": "2007.15808",
      "morning-session": true,
      "afternoon-session": true
    }
  },
  {
    "pid": 90,
    "title": "Quantum Random Number Generator based on Violations of the Free CHSH-3 Inequality",
    "authors": [
      {
        "email": "don.anoman@unilim.fr",
        "first": "ANOMAN Don Jean",
        "last": "Baptiste",
        "affiliation": "Université de Limoges",
        "contact": true
      },
      {
        "email": "arnault@unilim.fr",
        "first": "ARNAULT",
        "last": "François",
        "affiliation": "Université de Limoges"
      },
      {
        "email": "simone.naldi@unilim.fr",
        "first": "NALDI",
        "last": "Simone",
        "affiliation": "Université de Limoges"
      }
    ],
    "abstract": "We describe a protocol for generating random numbers based on the existence of quantum violations\r\nof a free version of Clauser-Horne-Shimony-Holt inequality for qutrit, namely CHSH-3. Our method uses semidefinite\r\nprogramming relaxations to compute such violations. In a standard setting the CHSH-3 inequality\r\ninvolves two separated qutrits and compatible measurement, that is, commuting with each other,\r\nyielding the known quantum bound of $1+\\sqrt{11/3} \\approx 2.9149$ .\r\nIn our framework, $d$-dimensional quantum systems (qudits) where $d$ is not fixed {\\it a priori},\r\nand measurement operators possibly not compatible, are allowed. This loss of constraints yields a\r\nhigher value of $4$ for the maximum expectation of CHSH-3, attained for $d=3 $ and non-commutative measurements for one party. Based on such upper bound on the violation of free CHSH-3, which appear to be a non-algebraic bound, we\r\ndevelop a random number generator with only one party.\r\nOur protocol generates a maximal entropy and its security is based, through self testing arguments, on the attainability of the\r\nmaximal violation of the free CHSH-3 for quantum systems.",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-5444b0d2331cdfd4baa6a43657a1c1d5f398503c95e5b980e944db065cc610e1",
        "timestamp": 1587165212,
        "size": 328160,
        "filename": "fullPaper.pdf"
      },
      "student-paper": true,
      "name-main-presenter": "Anoman Don Jean Baptiste",
      "arxiv-id": "2003.00124",
      "morning-session": true,
      "afternoon-session": true
    }
  },
  {
    "pid": 94,
    "title": "Is Classical Remote State Preparation Composable?",
    "authors": [
      {
        "email": "chrigi.badi@gmail.com",
        "first": "Christian",
        "last": "Badertscher",
        "affiliation": "University of Edinburgh"
      },
      {
        "email": "s1575638@sms.ed.ac.uk",
        "first": "Alexandru",
        "last": "Cojocaru",
        "affiliation": "University of Edinburgh",
        "contact": true
      },
      {
        "email": "leo.colisson@lip6.fr",
        "first": "Léo",
        "last": "Colisson",
        "affiliation": "LIP6 Sorbonne Université",
        "contact": true
      },
      {
        "email": "ekashefi@inf.ed.ac.uk",
        "first": "Elham",
        "last": "Kashefi",
        "affiliation": "University of Edinburgh and LIP6 Sorbonne Université",
        "contact": true
      },
      {
        "email": "dominik.leichtle@lip6.fr",
        "first": "Dominik",
        "last": "Leichtle",
        "affiliation": "LIP6 Sorbonne Université",
        "contact": true
      },
      {
        "email": "amantri@umd.edu",
        "first": "Atul",
        "last": "Mantri",
        "affiliation": "University of Maryland",
        "contact": true
      },
      {
        "email": "petros.wallden@ed.ac.uk",
        "first": "Petros",
        "last": "Wallden",
        "affiliation": "University of Edinburgh",
        "contact": true
      }
    ],
    "abstract": "Classical remote state preparation (RSPCC) is a primitive that allows an honest client to prepare a quantum state remotely with the help of an (untrustworthy) server using only a classical communication channel. With this primitive quantum protocols (such as secure delegation of quantum computations) become accessible to classical clients, by removing the need for a quantum channel. Since this cryptographic primitive’s main role is to be a building block within larger protocols, it is of utmost importance to examine its security under composition. In this work we present three results related to the composability of RSPCC protocols:\r\n1. As our first main result, we show that no classical remote state preparation protocol RSPCC can be composable in the Abstract Cryptography framework [MR11], even when the distinguisher is computationally bounded. In other words, remote state preparation cannot be constructed with only a classical channel.\r\n2. We further show that any classical-client delegated quantum computing protocol that uses the universal blind quantum computation (UBQC) protocol [BFK09] and a RSPCC protocol as a subroutine cannot be composable.\r\n3. Upon relaxing the security requirement, we show that replacing the quantum channel of the UBQC protocol by the particular RSPCC protocol of [CCKW19] is secure in the game-based security framework.",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-82578f948bc7e2cd5f5a472c3da712db30ce1abcd86a40a4792d759569b32374",
        "timestamp": 1587205805,
        "size": 819556,
        "filename": "composableRSP_full_paper.pdf"
      },
      "student-paper": true,
      "name-main-presenter": "Léo Colisson",
      "arxiv-id": "2007.01668",
      "morning-session": true,
      "afternoon-session": true
    }
  },
  {
    "pid": 95,
    "title": "Security for Quantum Networks",
    "authors": [
      {
        "email": "salini.karuvade@ucalgary.ca",
        "first": "Salini",
        "last": "Karuvade",
        "affiliation": "University of Calgary",
        "contact": true
      },
      {
        "email": "sandersb@ucalgary.ca",
        "first": "Barry C.",
        "last": "Sanders",
        "affiliation": "University of Calgary",
        "contact": true
      }
    ],
    "abstract": "Reliable and efficient functioning of a quantum network depends on identifying and mitigating security risks originating from within and outside the network. We aim to construct a comprehensive framework for developing and assessing secure quantum networks. We articulate issues for making quantum networks secure in general,  summarise the state of the art and identify priority directions for further investigation. Our analysis builds on the secure communication protocols developed for classical layered network architectures such as the open-systems interconnection (OSI) model and the transmission control protocol/internet protocol (TCP/IP) model. Our work will lead to the development of a hardware-independent framework for securing general quantum networks that allows developers to identify mandatory security mechanisms and incorporate additional security requirements of the clients during design of the networks.",
    "options": {
      "student-paper": true,
      "name-main-presenter": "Salini Karuvade",
      "morning-session": false,
      "afternoon-session": true
    }
  },
  {
    "pid": 96,
    "title": "Quantum repeaters based on concatenated bosonic and discrete-variable quantum codes",
    "authors": [
      {
        "email": "frozpedek@uchicago.edu",
        "first": "Filip",
        "last": "Rozpedek",
        "affiliation": "University of Chicago",
        "contact": true
      },
      {
        "email": "kyungjoo.noh@yale.edu",
        "first": "Kyungjoo",
        "last": "Noh",
        "affiliation": "Yale University",
        "contact": true
      },
      {
        "email": "qianxu@uchicago.edu",
        "first": "Qian",
        "last": "Xu",
        "affiliation": "University of Chicago"
      },
      {
        "email": "saikat@optics.arizona.edu",
        "first": "Saikat",
        "last": "Guha",
        "affiliation": "University of Arizona",
        "contact": true
      },
      {
        "email": "liangjiang@uchicago.edu",
        "first": "Liang",
        "last": "Jiang",
        "affiliation": "University of Chicago"
      }
    ],
    "abstract": "We propose a novel architecture of quantum-error-correction-based quantum repeaters that combines the techniques used in discrete and continuous variable quantum information. Specifically, we propose to encode the transmitted qubits in a concatenated code consisting of two levels. On the first level we use a continuous variable GKP code which encodes the qubit in a single bosonic mode. On the second level we use a small discrete variable code, encoding a logical qubit in as few as seven physical qubits. Such an architecture introduces two major novelties which allow us to make efficient use of resources. Firstly, our architecture makes use of two types of quantum repeaters: the simpler GKP repeaters that need to only be able to store and correct errors on a single GKP qubit and more powerful but more costly multi-qubit repeaters that additionally can correct errors on the higher level. We find that the combination of using the two types of repeaters enables us to achieve performance needed in practical scenarios with a significantly reduced cost with respect to an architecture based solely on multiqubit repeaters. Secondly the use of continuous variable GKP code on the lower level has the advantage of providing us with the information about the success probability of the specific GKP correction round. This analog information, unique to bosonic codes, provides significant boost in performance when used to correct second level errors in the multi-qubit repeaters.",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-578c418575391da18fc63c42a24f94f4bb6a90674c1a7a185d521663ca98396c",
        "timestamp": 1587182408,
        "size": 2961651,
        "filename": "Supplemental_material.pdf"
      },
      "student-paper": false,
      "name-main-presenter": "Filip Rozpedek",
      "morning-session": false,
      "afternoon-session": true
    }
  },
  {
    "pid": 101,
    "title": "Entanglement generation in a quantum network at distance-independent rates",
    "authors": [
      {
        "email": "ashlesha@email.arizona.edu",
        "first": "Ashlesha",
        "last": "Patil",
        "affiliation": "College of Optical Sciences, The University of Arizona, Tucson, AZ, USA",
        "contact": true
      },
      {
        "email": "mihir.pant@gmail.com",
        "first": "Mihir",
        "last": "Pant",
        "affiliation": "Massachusetts Institute of Technology, Cambridge, MA, USA"
      },
      {
        "email": "englund@mit.edu",
        "first": "Dirk",
        "last": "Englund",
        "affiliation": "Massachusetts Institute of Technology, Cambridge, MA, USA"
      },
      {
        "email": "towsley@cs.umass.edu",
        "first": "Don",
        "last": "Towsley",
        "affiliation": "College of Information and Computer Sciences, University of Massachusetts, Amherst, MA, USA"
      },
      {
        "email": "saikat@optics.arizona.edu",
        "first": "Saikat",
        "last": "Guha",
        "affiliation": "College of Optical Sciences, The University of Arizona, Tucson, AZ, USA",
        "contact": true
      }
    ],
    "abstract": "We develop a protocol that allows a pair of users to sift a secret key starting from shared variable-length Greenberger-Horne-Zeilinger (GHZ) states. It is an extension of the BBM’92 protocol which relies on measurements in the matching basis for entanglement witness. We then design an entanglement generation scheme over a quantum network that equips the quantum key generation protocol to achieve key rates that are independent of the distance between the two users. The key new insight in our protocol is to allow a repeater node to use n-qubit GHZ projective measurements that can fuse n successful entangled links, i.e., two-qubit entangled Bell pairs shared across network edges, incident at that node, into an n-qubit GHZ state shared by the far nodes of those edges. If we allow even 3-fusions at the nodes, we find by developing a connection to a modified version of the site-bond percolation problem that despite lossy (hence probabilistic) link-level entanglement generation, and probabilistic success of the fusion measurements at nodes, one can generate entanglement between end two parties at a rate that stays constant as the distance between them increases. This is not possible to attain with any (non-error-corrected) quantum networking protocol using Bell measurements alone.",
    "options": {
      "student-paper": true,
      "name-main-presenter": "Ashlesha Patil",
      "arxiv-id": "2005.07247",
      "morning-session": false,
      "afternoon-session": true
    }
  },
  {
    "pid": 110,
    "title": "Quantum repeaters in space",
    "authors": [
      {
        "email": "liorni@uni-duesseldorf.de",
        "first": "Carlo",
        "last": "Liorni",
        "affiliation": "Heinrich-Heine-Universität Düsseldorf",
        "contact": true
      },
      {
        "email": "Hermann.Kampermann@hhu.de",
        "first": "Hermann",
        "last": "Kampermann",
        "affiliation": "Heinrich-Heine-Universität Düsseldorf"
      },
      {
        "email": "Dagmar.Bruss@uni-duesseldorf.de",
        "first": "Dagmar",
        "last": "Bruß",
        "affiliation": "Heinrich-Heine-Universität Düsseldorf"
      }
    ],
    "abstract": "Entanglement distribution between very distant parties allows several interesting quantum-enabled protocols to be performed, in the fields of quantum communication, metrology and distributed computation.  However, achieving this task over global distances (thousands of km) is very daunting, due to the exponential losses of light in optical fibres.\r\nThe concept of a quantum repeater has been introduced to counter this problem. Such a device allows, using quantum memories and protocols based on entanglement swapping or quantum error correction, to connect several elementary links and enlarge the achievable distance.\r\nAn alternative solution is represented by satellite-relayed free-space channels, that have already been proven to be feasible with current technology. Using a double downlink from a single satellite, however, the maximum distance between the ground stations is limited to {1500-2000} km, due to the additional losses encountered at low elevation angles. Through quantum repeaters, few of these satellite links can be chained together to reach global distances. In this work we propose and study a scheme in which entanglement sources and quantum repeaters are placed on board of satellites, orbiting around the Earth in the string of pearls configuration. This allows to connect two users on the ground via free-space optical links outside the atmosphere, achieving far superior distance-to-loss ratio with respect to the standard fibre-based implementation. In this way, a small number of intermediate nodes is enough to achieve entanglement distribution over global distances at a reasonable rate.  \r\n\r\nThe performance of this repeater chain is assessed in terms of the secret key rate achievable by the BB-84 cryptographic protocol, taking into account the most important sources of noise. We perform a comparison with other repeater chain architectures and show that our scheme is superior in almost every situation, achieving higher key rates, reliability and flexibility. These results have been obtained assuming reasonably conservative values of the parameters of the setup, such as the size of the optical elements and the efficiency of the quantum memories.\r\nThe feasibility of the implementation in the mid-term future is analysed, based on recent developments in space-borne technology. We finally discuss some exemplary orbital configurations to connect several pairs of cities around the world with very small satellite constellations and estimate the cost of such an infrastructure. \r\nThe integration of satellite-based links with ground repeater networks can be envisaged to represent the backbone of the future Quantum Internet.\r\n\r\nC. Liorni, H. Kampermann, D. Bruß, arXiv:2005.10146, 2020",
    "options": {
      "student-paper": true,
      "name-main-presenter": "Carlo Liorni",
      "arxiv-id": "2005.10146",
      "morning-session": true,
      "afternoon-session": true
    }
  },
  {
    "pid": 112,
    "title": "CubeSat Based Quantum Communication",
    "authors": [
      {
        "email": "peide.zhang@bristol.ac.uk",
        "first": "Peide",
        "last": "Zhang",
        "affiliation": "University of Bristol",
        "contact": true
      },
      {
        "email": "elliott.hastings@bristol.ac.uk",
        "first": "Elliott",
        "last": "Hastings",
        "affiliation": "University of Bristol"
      },
      {
        "email": "David.Lowndes@bristol.ac.uk",
        "first": "David",
        "last": "Lowndes",
        "affiliation": "University of Bristol"
      },
      {
        "email": "sk.joshi@bristol.ac.uk",
        "first": "Siddarth",
        "last": "Joshi",
        "affiliation": "University of Bristol",
        "contact": true
      },
      {
        "email": "John.Rarity@bristol.ac.uk",
        "first": "John",
        "last": "Rarity",
        "affiliation": "University of Bristol",
        "contact": true
      },
      {
        "email": "daniel.oi@strath.ac.uk",
        "first": "Daniel",
        "last": "Oi",
        "affiliation": "University of Strathclyde"
      },
      {
        "email": "cassandra@craftprospect.com",
        "first": "Cassandra",
        "last": "Mercury",
        "affiliation": "Craft Prospect Ltd"
      },
      {
        "email": "jasminder.sidhu@strath.ac.uk",
        "first": "Jasminder S.",
        "last": "Sidhu",
        "affiliation": "University of Strathclyde"
      },
      {
        "email": "steve@craftprospect.com",
        "first": "Steve",
        "last": "Greenland",
        "affiliation": "Craft Prospect Ltd"
      },
      {
        "email": "luca.mazzarella@jpl.nasa.gov",
        "first": "Luca",
        "last": "Mazzarella",
        "affiliation": "NASA, Jet Propulsion Laboratory"
      },
      {
        "email": "doug@craftprospect.com",
        "first": "Doug",
        "last": "McNeil",
        "affiliation": "Craft Prospect Ltd"
      },
      {
        "email": "sonali@craftprospect.com",
        "first": "Sonali",
        "last": "Mohapatra",
        "affiliation": "Craft Prospect Ltd"
      }
    ],
    "abstract": "Space-based quantum key distribution (QKD) overcomes the limits of distance between terrestrial users caused by losses in optical fibre. Thus, it is the most promising method to establish a global scale QKD network. While the first QKD platform in the space - “the Micius satellite” – was a ground-breaking proof of principle demonstration, it is not a commercially favourable solution. We present our Cube-Sat payload design which has a more economically viable key-rate. The whole system is consisting of two parts, a 2U transmitter payload in Cube Satellite and an Optical Ground Station (OGS) working as receiver. The system is designed for polarisation based BB84/Decoy-State protocol with 100Mhz key transmission rate. In order to avoid the light pollution near the metropolitan centres and provide flexibility, we present our progress towards a mobile OGS which will be able to act as a receiver for the quantum signal.",
    "options": {
      "student-paper": false,
      "name-main-presenter": "Peide Zhang",
      "morning-session": false,
      "afternoon-session": true
    }
  },
  {
    "pid": 113,
    "title": "Free-space single-mode receiver with adaptive optics for quantum communication",
    "authors": [
      {
        "email": "kxyang@mail.ustc.edu.cn",
        "first": "Kui-Xing",
        "last": "Yang",
        "affiliation": "Department of Modern Physics and National Laboratory for Physical Sciences at Microscale, Shanghai Branch, University of Science and Technology of China, Heifei, Anhui 230026, China. CAS Center for Excellence and Synergetic Innovation Center in Quantum Information and Quantum Physics, Shanghai Branch, University of Science and Technology of China, Hefei, Anhui 230026, China. Shanghai Research Center for Quantum Science, Shanghai 201315, China.",
        "contact": true
      },
      {
        "email": "mmt@mail.ustc.edu.cn",
        "first": "Maimaiti",
        "last": "Abulizi",
        "affiliation": "Department of Modern Physics and National Laboratory for Physical Sciences at Microscale, Shanghai Branch, University of Science and Technology of China, Heifei, Anhui 230026, China. CAS Center for Excellence and Synergetic Innovation Center in Quantum Information and Quantum Physics, Shanghai Branch, University of Science and Technology of China, Hefei, Anhui 230026, China. Shanghai Research Center for Quantum Science, Shanghai 201315, China."
      },
      {
        "email": "liyuhuai@mail.ustc.edu.cn",
        "first": "Yu-Huai",
        "last": "Li",
        "affiliation": "Department of Modern Physics and National Laboratory for Physical Sciences at Microscale, Shanghai Branch, University of Science and Technology of China, Heifei, Anhui 230026, China. CAS Center for Excellence and Synergetic Innovation Center in Quantum Information and Quantum Physics, Shanghai Branch, University of Science and Technology of China, Hefei, Anhui 230026, China. Shanghai Research Center for Quantum Science, Shanghai 201315, China."
      },
      {
        "email": "2213169163",
        "first": "Bo-Yang",
        "last": "Zhang",
        "affiliation": "Department of Modern Physics and National Laboratory for Physical Sciences at Microscale, Shanghai Branch, University of Science and Technology of China, Heifei, Anhui 230026, China. CAS Center for Excellence and Synergetic Innovation Center in Quantum Information and Quantum Physics, Shanghai Branch, University of Science and Technology of China, Hefei, Anhui 230026, China. Shanghai Research Center for Quantum Science, Shanghai 201315, China."
      },
      {
        "email": "ustclin@mail.ustc.edu.cn",
        "first": "Shuang-Lin",
        "last": "Li",
        "affiliation": "Department of Modern Physics and National Laboratory for Physical Sciences at Microscale, Shanghai Branch, University of Science and Technology of China, Heifei, Anhui 230026, China. CAS Center for Excellence and Synergetic Innovation Center in Quantum Information and Quantum Physics, Shanghai Branch, University of Science and Technology of China, Hefei, Anhui 230026, China. Shanghai Research Center for Quantum Science, Shanghai 201315, China."
      },
      {
        "email": "yuancao@ustc.edu.cn",
        "first": "Yuan",
        "last": "Cao",
        "affiliation": "Department of Modern Physics and National Laboratory for Physical Sciences at Microscale, Shanghai Branch, University of Science and Technology of China, Heifei, Anhui 230026, China. CAS Center for Excellence and Synergetic Innovation Center in Quantum Information and Quantum Physics, Shanghai Branch, University of Science and Technology of China, Hefei, Anhui 230026, China. Shanghai Research Center for Quantum Science, Shanghai 201315, China.",
        "contact": true
      }
    ],
    "abstract": "Satellite-based quantum communication is a promising approach for realizing globalscale quantum networks. However, due to atmospheric turbulence, achieving a highly efficient and stable spatial single-mode receiver, which is very important for daylight free-space quantum key distribution and more complex quantum information tasks involving quantum interference, is difficult. Here, we develop a spatial single-mode receiver with an adaptive optics (AO) system based on a modal version of the stochastic parallel gradient descent algorithm (M-SPGD) and conduct a field test of its performance over an 8 km urban terrestrial free-space channel. Our experimental results demonstrate the AO technology based on M-SPGD has a great boosting for single-mode receiver and is useful for large-scale quantum communication.",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-2ea39a5edf091273f8783a111d2c80140b7e1d8a0e5d5143d170584e626ab807",
        "timestamp": 1596091966,
        "size": 3566537,
        "filename": "MSPGD_poster__One_page_.pdf"
      },
      "student-paper": true,
      "name-main-presenter": "Kui-Xing Yang",
      "morning-session": false,
      "afternoon-session": true
    }
  },
  {
    "pid": 114,
    "title": "Improving key rates of the unbalanced phase-encoded BB84 protocol using the flag-state squashing model",
    "authors": [
      {
        "email": "kh6li@uwaterloo.ca",
        "first": "Nicky Kai Hong",
        "last": "Li",
        "affiliation": "Institute for Quantum Computing and Department of Physics and Astronomy, University of Waterloo",
        "contact": true
      },
      {
        "email": "nlutkenhaus@uwaterloo.ca",
        "first": "Norbert",
        "last": "Lütkenhaus",
        "affiliation": "Institute for Quantum Computing and Department of Physics and Astronomy, University of Waterloo",
        "contact": true
      }
    ],
    "abstract": "All phase-encoded BB84 implementations have signal states with unbalanced amplitudes in practice. Thus, the original security analyses a priori do not apply to them. Previous security proofs use signal tagging of multi-photon pulses to recover the behaviour of regular BB84. This is overly conservative, as for unbalanced signals, the photon-number splitting attack does not leak full information to Eve. In this work, we exploit the flag-state squashing model to preserve some parts of the multi-photon generated private information in our analysis. Using a numerical proof technique, we obtain significantly higher key rates compared with previously published results in the low-loss regime. It turns out that the usual scenario of untrusted dark counts runs into conceptual difficulties in some parameter regime. Thus, we discuss the trusted dark count scenario in this paper as well. We also report a gain in key rates when part of the total loss is known to be induced by a trusted device. We highlight that all these key rate improvements can be achieved without modification of the experimental setup.",
    "options": {
      "student-paper": true,
      "name-main-presenter": "Nicky Kai Hong Li",
      "arxiv-id": "2007.08662",
      "morning-session": false,
      "afternoon-session": true
    }
  },
  {
    "pid": 115,
    "title": "Quantum random number generators with entanglement for public randomness testing",
    "authors": [
      {
        "email": "janusz.jacak@pwr.edu.pl",
        "first": "Janusz E.",
        "last": "Jacak",
        "affiliation": "Dept. of Quantum Technologies, Wroclaw University of Sciecne and Technology, Wroclaw, Poland",
        "contact": true
      },
      {
        "email": "witold.aleksander.jacak@pwr.edu.pl",
        "first": "Witold A.",
        "last": "Jacak",
        "affiliation": "Dept. of Quantum Technologies, Wroclaw University of Sciecne and Technology, Wroclaw, Poland"
      },
      {
        "email": "wojciech.donderowicz@compsecur.pl",
        "first": "Wojciech A.",
        "last": "Donderowicz",
        "affiliation": "Compsecur Sp z o.o., Wroclaw, Poland"
      },
      {
        "email": "piotr.jozwiak@pwr.edu.pl",
        "first": "Piotr",
        "last": "Jóźwiak",
        "affiliation": "Dept. of Applied Informatics, Wroclaw University of Sciecne and Technology, Wroclaw, Poland"
      },
      {
        "email": "lucjan.jacak@pwr.edu.pl",
        "first": "Lucjan",
        "last": "Jacak",
        "affiliation": "Dept. of Quantum Technologies, Wroclaw University of Sciecne and Technology, Wroclaw, Poland"
      }
    ],
    "abstract": "We present a simple idealistic quantum entanglement based protocol for quantum random number generation allowing a trusted third party to publicly perform arbitrarily complex tests of randomness without any violation of the secrecy of the generated bit sequences. The protocol diminishes also an average time of the randomness testing (thus enabling arbitrary shortening of this time with increasing number of entangled qubits).",
    "options": {
      "student-paper": false,
      "name-main-presenter": "Witold A. Jacak",
      "morning-session": true,
      "afternoon-session": true
    }
  },
  {
    "pid": 116,
    "title": "Franchised Quantum Money",
    "authors": [
      {
        "email": "bhaskarr@berkeley.edu",
        "first": "Bhaskar",
        "last": "Roberts",
        "affiliation": "UC Berkeley, Princeton University",
        "contact": true
      },
      {
        "email": "mzhandry@princeton.edu",
        "first": "Mark",
        "last": "Zhandry",
        "affiliation": "Princeton University, NTT Research",
        "contact": true
      }
    ],
    "abstract": "Classical bits can be copied, but quantum bits, in general, cannot. As a result, there is interest in creating uncounterfeitable quantum money, in which a set of qubits can be spent as money but cannot be duplicated. To function as money, there must be a way to verify that a given state is a valid banknote and not a counterfeit. Many recent efforts have tried to allow public key verification, where any untrusted user, even a would-be counterfeiter, can verify the banknotes. However, despite many attempts, a secure construction of public-key quantum money has remained elusive.\r\n\r\nHere we introduce franchised quantum money, a new notion that is weaker than public key quantum money but brings us closer to realizing it.  Franchised quantum money allows any untrusted user to verify banknotes using a unique secret key. Furthermore, we give a construction of franchised quantum money and prove security assuming the quantum hardness of the short-integer solution problem (SIS). This is the first construction of quantum money that allows an untrusted user to verify the banknotes, and which has a proof of security based on widespread assumptions. It is therefore an important step toward public key quantum money.\r\n\r\n\r\nUnder franchised quantum money, untrusted users receive unique secret verification keys. With their key, a user can verify banknotes without the mint involved, but they cannot create counterfeit money that would fool another user. This is different from public key quantum money because the verification key may actually enable counterfeiting, but the only person that the counterfeiter can fool is themselves.\r\n\r\nHere is how franchised quantum money might be useful: consider a group of large corporations, mutually distrustful, that nevertheless want to make transactions with each other. Further, a trusted third party, the mint, will administer the money system. While the mint cannot make verification public-key, it can franchise the ability to verify banknotes to the group of untrusted corporations. The mint gives each corporation a unique secret verification key that allows them to verify banknotes from another corporation.\r\n\r\nNow what if one corporation decides to start using its key to copy money? Since each corporation gets a different key, any banknotes that the corporation produces will fail to verify when a different key is used. Therefore the dishonest corporation will not be able to fool anyone but themselves.\r\n\r\nPublic key quantum money has eluded sophisticated attempts to construct it directly, so franchised quantum money is useful as a stepping stone. Although franchised quantum money is not public-key, it still enables verification without the mint involved, which is the main feature of interest for public key quantum money. Further, we give a construction of franchised quantum money with a proof of security based on widely-held assumptions about the SIS problem. Franchised quantum money offers greater security than existing constructions of quantum money, and brings us closer to public-key verification.",
    "options": {
      "student-paper": true,
      "name-main-presenter": "Bhaskar Roberts",
      "morning-session": false,
      "afternoon-session": true
    }
  },
  {
    "pid": 121,
    "title": "Communicating using non-maximally entangled states",
    "authors": [
      {
        "email": "sujankvr@gmail.com",
        "first": "Sujan",
        "last": "Vijayaraj",
        "affiliation": "Vellore Institute of Technology, Vellore, India",
        "contact": true
      },
      {
        "email": "physicsbalki@gmail.com",
        "first": "S.",
        "last": "Balakrishnan",
        "affiliation": "Vellore Institute of Technology, Vellore, India",
        "contact": true
      },
      {
        "email": "senthee@gmail.com",
        "first": "K.",
        "last": "Senthilnathan",
        "affiliation": "Vellore Institute of Technology, Vellore, India",
        "contact": true
      }
    ],
    "abstract": "Quantum communication in general helps deter potential eavesdropping in the course of transmission of bits to enable secure communication between two or more parties. In this paper, we propose a novel quasi-quantum secure direct communication scheme using non-maximally entangled states. The proposed scheme is simple to implement using existing techniques and significantly reduces the number of leaked bits. As a result long sequences or the whole sequence of data can be communicated at once before error checking for a potential eavesdropper. Also a cipher can be used in the protocol for retrieving the bits that are lost due to security. The qubit efficiency of the proposed protocol is found to be 40 %.",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-5c98d672233cfaf2b06aca97d9b8e8f173391c6df38eec4709947070c9836030",
        "timestamp": 1592060658,
        "size": 546160,
        "filename": "manuscript2.pdf"
      },
      "student-paper": true,
      "name-main-presenter": "Sujan Vijayaraj",
      "arxiv-id": "1912.03498",
      "morning-session": false,
      "afternoon-session": true
    }
  },
  {
    "pid": 122,
    "title": "Vulnerabilities of Quantum Lightning",
    "authors": [
      {
        "email": "bhaskarr@berkeley.edu",
        "first": "Bhaskar",
        "last": "Roberts",
        "affiliation": "UC Berkeley, Princeton University",
        "contact": true
      }
    ],
    "abstract": "Zhandry recently defined a new cryptographic object called quantum lightning, which has a number of useful applications, including a strong form of quantum money. Further, Zhandry proposed a construction of quantum lightning based on superpositions of low-rank matrices. \r\n\r\nThe scheme is unusual, so it is difficult to analyze whether the scheme is secure and difficult to base the scheme’s security on any widespread computational assumptions. Instead, Zhandry proposed a new hardness assumption that, if true, could be used to prove security. While the new hardness assumption is plausible, it has not been rigorously analyzed.\r\n\r\nIn this work, we analyze the hardness assumption to determine how, if at all, it can be justified. We show that Zhandry’s hardness assumption is in fact false, so the proof of security for Zhandry’s scheme does not hold. While the scheme itself has not been proven insecure, our analysis suggests an approach to developing attacks that might prove the scheme insecure.",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-1764f12bc1c23535997c9494d5410e6218c6987f14d91f0fd0b48980637ccf85",
        "timestamp": 1592304024,
        "size": 204162,
        "filename": "Vulnerabilities_of_Quantum_Lightning.pdf"
      },
      "student-paper": true,
      "name-main-presenter": "Bhaskar Roberts",
      "morning-session": false,
      "afternoon-session": true
    }
  },
  {
    "pid": 123,
    "title": "Hong-Ou-Mandel interference between heralded pulsed photon sources with PPKTP",
    "authors": [
      {
        "email": "libo1989@mail.ustc.edu.cn",
        "first": "Bo",
        "last": "Li",
        "affiliation": "University of Science and Technology of China",
        "contact": true
      }
    ],
    "abstract": "Heralded single photons with a wavelength of 780 nm were generated from 30-mm long PPKTP crystals. The spectral correlation was eliminated under narrow band-pass filtering, and Hong-Ou-Mandel interference between two heralded single-photon sources was demonstrated.",
    "options": {
      "student-paper": false,
      "name-main-presenter": "Bo Li",
      "morning-session": false,
      "afternoon-session": true
    }
  },
  {
    "pid": 124,
    "title": "The loss tolerant protocol with a twist",
    "authors": [
      {
        "email": "eli.bourassa@mail.utoronto.ca",
        "first": "J. Eli",
        "last": "Bourassa",
        "affiliation": "University of Toronto",
        "contact": true
      },
      {
        "email": "william_primaatmaja@u.nus.edu",
        "first": "Ignatius William",
        "last": "Primaatmaja",
        "affiliation": "National University of Singapore",
        "contact": true
      },
      {
        "email": "charles.lim@nus.edu.sg",
        "first": "Charles Ci Wen",
        "last": "Lim",
        "affiliation": "National University of Singapore",
        "contact": true
      },
      {
        "email": "hklo@ece.utoronto.ca",
        "first": "Hoi-Kwong",
        "last": "Lo",
        "affiliation": "University of Toronto"
      }
    ],
    "abstract": "The security of measurement device-independent quantum key distribution (MDI QKD) relies on a thorough characterization of one's optical source output, especially any noise in the state preparation process. Here, we provide an extension of the loss-tolerant protocol [Phys. Rev. A 90, 052314 (2014)], a leading proof technique for analyzing the security of QKD, to MDI QKD protocols that employ mixed signal states. We first reframe the core of the proof technique, noting its generalization to treat d-dimensional signal encodings. Concentrating on the qubit signal state case, we find that the mixed states can be interpreted as providing Alice and Bob with a virtual shield system they can employ to reduce Eve's knowledge of the secret key. We then introduce a simple semidefinite programming method for optimizing the virtual twisting operations they can perform on the shield system to yield a higher key rate, along with an example calculation of fundamentally achievable key rates in the case of random polarization modulation error.",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-06d2acd3f59d7562e399821cc8e2d4c89edb83a34f1c42f59737b208f577e22d",
        "timestamp": 1595624652,
        "size": 531144,
        "filename": "2007.08299.pdf"
      },
      "student-paper": true,
      "name-main-presenter": "J. Eli Bourassa",
      "arxiv-id": "2007.08299",
      "morning-session": false,
      "afternoon-session": true
    }
  },
  {
    "pid": 125,
    "title": "Noisy pre-processing facilitating a photonic realisation of device-independent quantum key distribution",
    "authors": [
      {
        "email": "mel.in.a.well@gmail.com",
        "first": "Melvyn",
        "last": "Ho",
        "affiliation": "University of Basel"
      },
      {
        "email": "pavel.sekatski@gmail.com",
        "first": "Pavel",
        "last": "Sekatski",
        "affiliation": "University of Basel"
      },
      {
        "email": "ernesttyz@hotmail.com",
        "first": "Ernest Y-Z.",
        "last": "Tan",
        "affiliation": "ETHZ"
      },
      {
        "email": "renner@ethz.ch",
        "first": "Renato",
        "last": "Renner",
        "affiliation": "ETHZ"
      },
      {
        "email": "jdbancal.physics@gmail.com",
        "first": "Jean-Daniel",
        "last": "Bancal",
        "affiliation": "University of Geneva",
        "contact": true
      },
      {
        "email": "nicolas.sangouard@unibas.ch",
        "first": "Nicolas",
        "last": "Sangouard",
        "affiliation": "University of Basel"
      }
    ],
    "abstract": "Device-independent quantum key distribution provides security even when the equipment used to communicate over the quantum channel is largely uncharacterized. An experimental demonstration of device-independent quantum key distribution is however challenging. A central obstacle in photonic implementations is that the global detection efficiency, i.e., the probability that the signals sent over the quantum channel are successfully received, must be above a certain threshold. We here propose a method to significantly relax this threshold, while maintaining provable device-independent security. This is achieved with a protocol that adds artificial noise, which cannot be known or controlled by an adversary, to the initial measurement data (the raw key). Focusing on a realistic photonic setup using a source based on spontaneous parametric down conversion, we give explicit bounds on the minimal required global detection efficiency.",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-af0c7a635efd8440e94ec39cc3a82aeeed2d3c8049342e37c05d810df3b2b7ac",
        "timestamp": 1592210488,
        "size": 778238,
        "filename": "Finite_detection_efficiency_diqkd.pdf"
      },
      "student-paper": false,
      "name-main-presenter": "Jean-Daniel Bancal",
      "arxiv-id": "2005.13015",
      "morning-session": true,
      "afternoon-session": true
    }
  },
  {
    "pid": 128,
    "title": "Dissipative dynamics of quantum states in the fiber channel",
    "authors": [
      {
        "email": "andrewdgk@gmail.com",
        "first": "Andrei",
        "last": "Gaidash",
        "affiliation": "ITMO University",
        "contact": true
      },
      {
        "email": "avkozubov@itmo.ru",
        "first": "Anton",
        "last": "Kozubov",
        "affiliation": "ITMO University",
        "contact": true
      },
      {
        "email": "gpmirosh@gmail.com",
        "first": "George",
        "last": "Miroshnichenko",
        "affiliation": "ITMO University"
      }
    ],
    "abstract": "In this paper we consider the Liouville equation that describes the quantum non-unitary dynamics of quantum states in optical fiber.We consider particular case of thermalization aiming to applications related to various quantum information protocols; however the model can be generalized in various ways taking into account more features (external pump, nonlinear interactions, continuous spectra, free space propagation, etc.). In order to obtain the appropriate evolution models for states in the channel we use the SU(1,1) algebra formalism in the Liouville representation. Developed model is applied in cases of two different initial states as an example. The first is single- and multi-frequency-mode (e.g. wavelength-division-multiplexed) weak coherent states in quantum notation as rather simple but useful example. This particular example is of interest since weak coherent states are commonly used tool in various fields of optics, e.g. optical communication, quantum key distribution, etc. Results for coherent states are well agreed with classical theories however in order to highlight quantum features of developed theory we also consider the case of non-classical light, in particular Fock states. Considered implementation of model takes into account dichroism, retardance, thermalization, dispersion, decoherence in polarization domain. We derive expressions of evolved states, mean photon number and estimate the Stokes parameters as well as degree of polarization. Considered examples explicitly demonstrates all the features and effects of developed approach. Described approach allows to connect the information properties of quantum channels with its physical ones. In order to illustrate this statement we consider BB84 quantum key distribution protocol and investigate behavior of quantum bit error rate affected by considered physical phenomena in optical fiber.",
    "options": {
      "student-paper": false,
      "name-main-presenter": "Andrei Gaidash",
      "morning-session": false,
      "afternoon-session": true
    }
  },
  {
    "pid": 129,
    "title": "Complete Bell state analyser for photonic qubits using semi-demolition or entangled non-demolition measurements",
    "authors": [
      {
        "email": "avkozubov@itmo.ru",
        "first": "Anton",
        "last": "Kozubov",
        "affiliation": "ITMO University",
        "contact": true
      },
      {
        "email": "andrewgdk@gmail.com",
        "first": "Andrei",
        "last": "Gaidash",
        "affiliation": "ITMO University"
      },
      {
        "email": "gpmirosh@gmail.com",
        "first": "George",
        "last": "Miroshnichenko",
        "affiliation": "ITMO University"
      }
    ],
    "abstract": "In this paper we present for the first time two possible techniques for deterministic two-step complete Bell state analyzer of optical (polarization) qubits using semi-demolition or entangled non-demolition measurements. Main difference to a prior studies in the field is that we do not use hyperentanglement or representation of the Bell states as concatenated Greenber–Horne–Zeilinger (C-GHZ) state to provide the discrimination. We demonstrate two different approaches for complete Bell state measurement based on different types of filtration. In entangled non-demolition measurement we allocate two pairs of the states from each other as the filtration process. The approach can be based on the utilization of cubic (Kerr) nonlinearity and auxiliary mode.  In semi-demolition measurement two states are unambiguously discriminated and hence destroyed; however two other states passes the filter without modification. The measurement destroys the single photon subspace in every mode and preserves the superposition of zero and two photons.  It can be realized with discrete photodetection based on microresonator with atoms. Such filtration can be considered as quadratic nonlinearity just as any measurement. The most significant about this approach is that we do not transform the initial states using any type of filtration based on different nonlinearities.",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-c713d6878d604fa5c022c416056867fbd40581b5be5038e36d9aed1dfaedb667",
        "timestamp": 1592229497,
        "size": 331807,
        "filename": "Complete_Bell_state_analyser_josa_b.pdf"
      },
      "student-paper": false,
      "morning-session": false,
      "afternoon-session": true
    }
  },
  {
    "pid": 130,
    "title": "Twin-field quantum key distribution with discrete phase randomization",
    "authors": [
      {
        "email": "eengjc@leeds.ac.uk",
        "first": "Guillermo Curras",
        "last": "Lorenzo",
        "affiliation": "University of Leeds",
        "contact": true
      },
      {
        "email": "el17lw@leeds.ac.uk",
        "first": "Lewis",
        "last": "Wooltorton",
        "affiliation": "University of Leeds"
      },
      {
        "email": "m.razavi@leeds.ac.uk",
        "first": "Mohsen",
        "last": "Razavi",
        "affiliation": "University of Leeds"
      }
    ],
    "abstract": "Twin-field (TF) quantum key distribution (QKD) can overcome fundamental secret-key-rate  bounds on point-to-point QKD links, allowing us to reach longer distances than ever before. Since its introduction, several practical TF-QKD variants have been proposed, and some of them have already been implemented experimentally. All of them assume that the users can emit weak coherent pulses with a continuous random phase, either to generate the key, or to prove its security. In practice, this assumption is often not satisfied, which could open up security loopholes in their implementations. Here, we propose and prove the security of a TF-QKD variant that relies exclusively on discrete phase randomisation, which is easier to achieve in practice. Remarkably, our results show that it can also provide higher secret-key rates than other variants.",
    "options": {
      "student-paper": true,
      "name-main-presenter": "Guillermo Currás Lorenzo",
      "morning-session": true,
      "afternoon-session": true
    }
  },
  {
    "pid": 131,
    "title": "Two MET-LDPC codes designed for long distance CV-QKD",
    "authors": [
      {
        "email": "hosma@fysik.dtu.dk",
        "first": "Hossein",
        "last": "Mani",
        "affiliation": "Technical University of Denmark",
        "contact": true
      },
      {
        "email": "bernhard.oemer@ait.ac.at",
        "first": "Bernhard",
        "last": "Ömer",
        "affiliation": "Austrian Institute of Technology",
        "contact": true
      },
      {
        "email": "ulrik.andersen@fysik.dtu.dk",
        "first": "Ulrik Lund",
        "last": "Andersen",
        "affiliation": "Technical University of Denmark",
        "contact": true
      },
      {
        "email": "tobias.gehring@fysik.dtu.dk",
        "first": "Tobias",
        "last": "Gehring",
        "affiliation": "Technical University of Denmark",
        "contact": true
      },
      {
        "email": "christoph.pacher@ait.ac.at",
        "first": "Christoph",
        "last": "Pacher",
        "affiliation": "Austrian Institute of Technology",
        "contact": true
      }
    ],
    "abstract": "Here in this poster we present two new MET-LDPC codes designed for rates 0.02 and 0.01 with even higher efficiency: β = 99.2% and β = 98.7% , respectively. We will present simulation results to demonstrate their performance. The presented codes can be used by different reconciliation strategies to increase the distance of CV-QKD.",
    "options": {
      "student-paper": true,
      "name-main-presenter": "Hossein Mani",
      "arxiv-id": "https://arxiv.org/abs/1812.05867",
      "morning-session": true,
      "afternoon-session": true
    }
  },
  {
    "pid": 132,
    "title": "AIT QKD Post Processing and Network Software",
    "authors": [
      {
        "email": "oliver.maurhart@ait.ac.at",
        "first": "Oliver",
        "last": "Maurhart",
        "affiliation": "AIT Austrian Institute of Technology GmbH",
        "contact": true
      },
      {
        "email": "stefan.petscharnig@ait.ac.at",
        "first": "Stefan",
        "last": "Petscharnig",
        "affiliation": "AIT Austrian Institute of Technology GmbH"
      },
      {
        "email": "thomas.grafenauer@ait.ac.at",
        "first": "Thomas",
        "last": "Grafenauer",
        "affiliation": "AIT Austrian Institute of Technology GmbH"
      },
      {
        "email": "michael.hentschel@ait.ac.at",
        "first": "Michael",
        "last": "Hentschel",
        "affiliation": "AIT Austrian Institute of Technology GmbH"
      },
      {
        "email": "bernhard.oemer@ait.ac.at",
        "first": "Bernhard",
        "last": "Ömer",
        "affiliation": "AIT Austrian Institute of Technology GmbH",
        "contact": true
      },
      {
        "email": "Philipp.Vogt.fl@ait.ac.at",
        "first": "Philipp-Sebastian",
        "last": "Vogt",
        "affiliation": "AIT Austrian Institute of Technology GmbH"
      },
      {
        "email": "christoph.pacher@ait.ac.at",
        "first": "Christoph",
        "last": "Pacher",
        "affiliation": "AIT Austrian Institute of Technology GmbH",
        "contact": true
      }
    ],
    "abstract": "Since 2004 AIT has developed a software suite for QKD post processing and key routing in trusted repeater networks. This software provides a set of building blocks to integrate sifting, error estimation, error correction, confirmation, privacy amplification and information-theoretically secure message authentication. Accompanying the QKD post-processing is the Quantum Point-to-Point Protocol (Q3P) node which enforces information-theoretically secure network peer-to-peer communication for classical applications. We already reported on the support for different DV and CV-QKD protocols, and high-performance error correction using GPUs for terrestrial QKD.\r\nHere we will discuss the following new capabilities of the software\r\n* a low dependency footprint for future use on satellites, \r\n* hibernation of QKD post-processing pipelines and switching between them for key establishment with different ground terminals and satellites,\r\n* CoAP interfaces to cover demands of the control and management plane in today’s network environment, and\r\n* the port to ARM/FPGA SoC boards.\r\nThe CoAP interfaces allow rapid scripting of QKD modules or AIT QKD based applications with Python or even Bash. Utilities and tools, as well as a boilerplate setup for QKD module coding projects, also support the creation of new QKD post-processing modules or QKD based user applications.  The AIT QKD software is bundled with management tools, partly GUI oriented.\r\nThe software is available under different license options and AIT welcomes suggestions from academic groups or industry to co-operate.",
    "options": {
      "student-paper": false,
      "name-main-presenter": "Oliver Maurhart",
      "morning-session": true,
      "afternoon-session": true
    }
  },
  {
    "pid": 134,
    "title": "A quantum random number generator based on a polymer photonic-integration platform",
    "authors": [
      {
        "email": "Martin.Achleitner@ait.ac.at",
        "first": "Martin",
        "last": "Achleitner",
        "affiliation": "AIT Austrian Institute of Technology"
      },
      {
        "email": "lena.hansen@hhi.fraunhofer.de",
        "first": "Lena",
        "last": "Hansen",
        "affiliation": "Fraunhofer Heinrich Hertz Institute"
      },
      {
        "email": "hauke.conradi@hhi.fraunhofer.de",
        "first": "Hauke",
        "last": "Conradi",
        "affiliation": "Fraunhofer Heinrich Hertz Institute"
      },
      {
        "email": "moritz.kleinert@hhi.fraunhofer.de",
        "first": "Moritz",
        "last": "Kleinert",
        "affiliation": "Fraunhofer Heinrich Hertz Institute"
      },
      {
        "email": "Christoph.Pacher@ait.ac.at",
        "first": "Christoph",
        "last": "Pacher",
        "affiliation": "AIT Austrian Institute of Technology",
        "contact": true
      },
      {
        "email": "hannes.huebel@ait.ac.at",
        "first": "Hannes",
        "last": "Hübel",
        "affiliation": "AIT Austrian Institute of Technology",
        "contact": true
      }
    ],
    "abstract": "Quantum random number generators (QRNG) are a well-studied quantum resource for information and communication technologies. Offering the randomness derived from quantum mechanical principles, QRNGs will replace current technologies of pseudo random number generation. However, prices and form factors must come down, if this technology is to feed mobile or IoT devices in the future. We present a step in this direction by realizing a QRNG in the polymer-based photonic integration platform PolyBoard.",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-af97621262255a11f469428c45cc6c3a2dc294cad2340e76c6bae425b3d6ed32",
        "timestamp": 1596464193,
        "size": 1218383,
        "filename": "Poster_QRNG_QCrypt2020_v4.pdf"
      },
      "student-paper": true,
      "name-main-presenter": "Martin Achleitner",
      "morning-session": false,
      "afternoon-session": true
    }
  },
  {
    "pid": 136,
    "title": "Parallelizing Single-Photon Detection for Ultra-Fast Quantum Key Distribution",
    "authors": [
      {
        "email": "matthias.haeussler@wwu.de",
        "first": "Matthias",
        "last": "Häußler",
        "affiliation": "Institute of Physics, University of Münster, Heisenbergstraße 11, 48149 Münster, Germany",
        "contact": true
      },
      {
        "email": "martin.wolff@wwu.de",
        "first": "Martin A.",
        "last": "Wolff",
        "affiliation": "Institute of Physics, University of Münster, Heisenbergstraße 11, 48149 Münster, Germany",
        "contact": true
      },
      {
        "email": "fabian.beutel@wwu.de",
        "first": "Fabian",
        "last": "Beutel",
        "affiliation": "Institute of Physics, University of Münster, Heisenbergstraße 11, 48149 Münster, Germany"
      },
      {
        "email": "helge.gehring@wwu.de",
        "first": "Helge",
        "last": "Gehring",
        "affiliation": "Institute of Physics, University of Münster, Heisenbergstraße 11, 48149 Münster, Germany"
      },
      {
        "email": "robin.stegmueller@wwu.de",
        "first": "Robin",
        "last": "Stegmüller",
        "affiliation": "Institute of Physics, University of Münster, Heisenbergstraße 11, 48149 Münster, Germany"
      },
      {
        "email": "nicolai.walter@wwu.de",
        "first": "Nicolai",
        "last": "Walter",
        "affiliation": "Institute of Physics, University of Münster, Heisenbergstraße 11, 48149 Münster, Germany"
      },
      {
        "email": "wladick.hartmann@wwu.de",
        "first": "Wladick",
        "last": "Hartmann",
        "affiliation": "Institute of Physics, University of Münster, Heisenbergstraße 11, 48149 Münster, Germany"
      },
      {
        "email": "tillmann@picoquant.com",
        "first": "Max",
        "last": "Tillmann",
        "affiliation": "PicoQuant GmbH, Rudower Chaussee 29, 12489 Berlin, Germany"
      },
      {
        "email": "wahl@picoquant.com",
        "first": "Michael",
        "last": "Wahl",
        "affiliation": "PicoQuant GmbH, Rudower Chaussee 29, 12489 Berlin, Germany"
      },
      {
        "email": "roehlicke@picoquant.com",
        "first": "Tino",
        "last": "Röhlicke",
        "affiliation": "PicoQuant GmbH, Rudower Chaussee 29, 12489 Berlin, Germany"
      },
      {
        "email": "buelter@picoquant.com",
        "first": "Andreas",
        "last": "Bülter",
        "affiliation": "PicoQuant GmbH, Rudower Chaussee 29, 12489 Berlin, Germany"
      },
      {
        "email": "d.wernicke@entropy-gmbh.de",
        "first": "Doreen",
        "last": "Wernicke",
        "affiliation": "Entropy GmbH, Gmunder Straße 37a, 81379 München, Germany"
      },
      {
        "email": "nicolas.perlot@hhi.fraunhofer.de",
        "first": "Nicolas",
        "last": "Perlot",
        "affiliation": "Fraunhofer Heinrich Hertz Institute, Einsteinufer 37, 10587 Berlin, Germany"
      },
      {
        "email": "jasper.roediger@hhi.fraunhofer.de",
        "first": "Jasper",
        "last": "Rödiger",
        "affiliation": "Fraunhofer Heinrich Hertz Institute, Einsteinufer 37, 10587 Berlin, Germany"
      },
      {
        "email": "wolfram.pernice@wwu.de",
        "first": "Wolfram H. P.",
        "last": "Pernice",
        "affiliation": "Institute of Physics, University of Münster, Heisenbergstraße 11, 48149 Münster, Germany"
      },
      {
        "email": "carsten.schuck@wwu.de",
        "first": "Carsten",
        "last": "Schuck",
        "affiliation": "Institute of Physics, University of Münster, Heisenbergstraße 11, 48149 Münster, Germany"
      }
    ],
    "abstract": "Emerging quantum technologies, such as quantum key distribution, increase the demand for reliable tools that enable single-photon generation, manipulation and sensing on an increasingly large scale. In the framework of integrated photonics, these needs can be fulfilled by patterning highly stable photonic devices on monolithic silicon chips in CMOS compatible processes. In this work we show how advanced single-photon detection capabilities are achieved on a silicon chip, realizing a 4x4 array of waveguide-integrated superconducting nanowire single-photon detectors (SNSPDs). \r\nOur detectors are fabricated from highly uniform superconducting NbTiN thin films in a U-shape geometry atop of silicon nitride strip waveguides [1]. The nanophotonic circuitry is interfaced with scalable 3D polymeric out-of-plane fiber-to-chip couplers [2] featuring high broadband transmission in the telecom regime. In order to address each detector individually via a separate fiber-optic channel, we precisely align a 16-channel 2D fiber array to the 4x4 coupler matrix. We evaluate the performance of our waveguide-integrated SNSPD array in a cost-efficient closed-cycle cryostat at 3.5 K. We find dark count rates below 10 Hz combined with a superior system detection efficiency of up to 50 % at 30 MHz count rate for telecom-wavelength photons. In addition, we achieve 120 ps timing jitter with a simple two-stage room-temperature amplification approach.\r\nOur detector arrays pave the way for parallelized multi-channel single-photon detection and will therewith enable ultra-fast quantum key distribution. Furthermore, our approach allows for integrating sophisticated nanophotonic devices with waveguide-coupled single-photon detectors providing additional variability and functionality.",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-206281bbada8d8602793f2352076c1c226d5adee90e13605cd7ce8bdf5cf37d0",
        "timestamp": 1596460122,
        "size": 6046140,
        "filename": "qcrypt_haeussler.pdf"
      },
      "student-paper": false,
      "name-main-presenter": "Matthias Häußler",
      "morning-session": true,
      "afternoon-session": true
    }
  },
  {
    "pid": 137,
    "title": "The QKD Testbed project OPENQKD",
    "authors": [
      {
        "email": "hannes.huebel@ait.ac.at",
        "first": "Hannes",
        "last": "Hübel",
        "affiliation": "AIT Austian Institute of Technology",
        "contact": true
      }
    ],
    "abstract": "The OPENQKD project is currently the largest QKD-focused initiative in Europe comprising of 38 partners. The project brings together a multidisciplinary team of the leading European telecommunication equipment manufacturers, end-users and critical infrastructure providers, network operators, QKD equipment providers, digital security professionals and scientists from 13 countries to reinforce Europe’s position at the forefront of quantum communication capabilities globally. We present here the first deployment results from selected testbeds, list the demonstration sites and associated use cases. We will also provide an overview of the QKD devices built for the project and a timetable for the future deployments.",
    "options": {
      "student-paper": false,
      "name-main-presenter": "Hannes Hübel",
      "morning-session": false,
      "afternoon-session": true
    }
  },
  {
    "pid": 138,
    "title": "Security Proof for Discrete-Modulated Continuous-Variable Quantum Key Distribution without Photon-Number Cut-off Assumption",
    "authors": [
      {
        "email": "twesh.upadhyaya@uwaterloo.ca",
        "first": "Twesh",
        "last": "Upadhyaya",
        "affiliation": "Institute for Quantum Computing and Department of Physics and Astronomy, University of Waterloo",
        "contact": true
      },
      {
        "email": "thomas.vanhimbeeck@utoronto.ca",
        "first": "Thomas",
        "last": "Van Himbeeck",
        "affiliation": "Institute for Quantum Computing, University of Waterloo, University of Toronto",
        "contact": true
      },
      {
        "email": "jie.lin@uwaterloo.ca",
        "first": "Jie",
        "last": "Lin",
        "affiliation": "Institute for Quantum Computing and Department of Physics and Astronomy, University of Waterloo",
        "contact": true
      },
      {
        "email": "nlutkenhaus@uwaterloo.ca",
        "first": "Norbert",
        "last": "Lutkenhaus",
        "affiliation": "Institute for Quantum Computing and Department of Physics and Astronomy, University of Waterloo",
        "contact": true
      }
    ],
    "abstract": "In this work, we provide a complete, unconditional, asymptotic security analysis of DMCVQKD with four or more states. We do not need the photon-number cut-off assumption required in previous proofs. We derive inequalities that relate the result of a suitably chosen finite-dimensional optimization to the key rate. We solve the optimization numerically and utilize uniform continuity bounds to derive tight key rate lower bounds. We find that the key rates are comparable to previous conditional security proofs with the cut-off assumption, and to those achieved by Gaussian-modulated CVQKD.",
    "options": {
      "student-paper": true,
      "name-main-presenter": "Twesh Upadhyaya",
      "morning-session": true,
      "afternoon-session": true
    }
  },
  {
    "pid": 139,
    "title": "Towards an Open-source Software Platform for Numerical Key Rate Calculation of General Quantum Key Distribution Protocols",
    "authors": [
      {
        "first": "Jie",
        "last": "Lin",
        "affiliation": "Institute for Quantum Computing and Department of Physics and Astronomy, University of Waterloo, Waterloo, Ontario, Canada N2L 3G1"
      },
      {
        "first": "Ian",
        "last": "George",
        "affiliation": "Institute for Quantum Computing and Department of Physics and Astronomy, University of Waterloo, Waterloo, Ontario, Canada N2L 3G1"
      },
      {
        "first": "Kai-Hong",
        "last": "Li",
        "affiliation": "Institute for Quantum Computing and Department of Physics and Astronomy, University of Waterloo, Waterloo, Ontario, Canada N2L 3G1"
      },
      {
        "first": "Kun",
        "last": "Fang",
        "affiliation": "Institute for Quantum Computing and Department of Physics and Astronomy, University of Waterloo, Waterloo, Ontario, Canada N2L 3G1"
      },
      {
        "first": "Twesh",
        "last": "Upadhyaya",
        "affiliation": "Institute for Quantum Computing and Department of Physics and Astronomy, University of Waterloo, Waterloo, Ontario, Canada N2L 3G1"
      },
      {
        "first": "Natansh",
        "last": "Mathur",
        "affiliation": "India Institute of Technology Roorkee, Roorkee, India, 247667"
      },
      {
        "first": "Max",
        "last": "Chemtov",
        "affiliation": "Institute for Quantum Computing and Department of Physics and Astronomy, University of Waterloo, Waterloo, Ontario, Canada N2L 3G1"
      },
      {
        "first": "Slock A.",
        "last": "Nahar",
        "affiliation": "Institute for Quantum Computing and Department of Physics and Astronomy, University of Waterloo, Waterloo, Ontario, Canada N2L 3G1"
      },
      {
        "first": "Shahabeddin M.",
        "last": "Aslmarand",
        "affiliation": "Institute for Quantum Computing and Department of Physics and Astronomy, University of Waterloo, Waterloo, Ontario, Canada N2L 3G1"
      },
      {
        "first": "Thomas",
        "last": "Van Himbeeck",
        "affiliation": "Institute for Quantum Computing and Department of Physics and Astronomy, University of Waterloo, Waterloo, Ontario, Canada N2L 3G1"
      },
      {
        "first": "Yanbao",
        "last": "Zhang",
        "affiliation": "Institute for Quantum Computing and Department of Physics and Astronomy, University of Waterloo, Waterloo, Ontario, Canada N2L 3G1; NTT Basic Research Laboratories and NTT Research Center for Theoretical Quantum Physics, NTT Corporation, 3-1 Morinosato-Wakamiya, Atsugi, Kanagawa, Japan 243-0198"
      },
      {
        "first": "Christopher",
        "last": "Boehm",
        "affiliation": "University of Freiburg, Freiburg im Breisgau, Germany 79085"
      },
      {
        "first": "Patrick",
        "last": "Coles",
        "affiliation": "Institute for Quantum Computing and Department of Physics and Astronomy, University of Waterloo, Waterloo, Ontario, Canada N2L 3G1; Theoretical Division, Los Alamos National Laboratory, Los Alamos, NM 87545, US"
      },
      {
        "first": "Adam",
        "last": "Winick",
        "affiliation": "Institute for Quantum Computing and Department of Physics and Astronomy, University of Waterloo, Waterloo, Ontario, Canada N2L 3G1"
      },
      {
        "email": "wenyuan.wang@uwaterloo.ca",
        "first": "Wenyuan",
        "last": "Wang",
        "affiliation": "Institute for Quantum Computing and Department of Physics and Astronomy, University of Waterloo, Waterloo, Ontario, Canada N2L 3G1",
        "contact": true
      },
      {
        "email": "nlutkenhaus@uwaterloo.ca",
        "first": "Norbert",
        "last": "Lütkenhaus",
        "affiliation": "Institute for Quantum Computing and Department of Physics and Astronomy, University of Waterloo, Waterloo, Ontario, Canada N2L 3G1",
        "contact": true
      }
    ],
    "abstract": "A numerical approach for the calculation of QKD key rates allows a uniform framework to be applied to general QKD protocols. Based on our group's previous work, we would like to build a universal software platform that is fully modularized and user-friendly, where one can easily swap in and out different QKD protocol descriptions, channel simulation models or experimental data, backend numerical solvers, and parameter optimization algorithms. Our goal is to build an open-source platform that can be both useful for theorists testing new protocols as well as experimentalists looking for optimal parameters or analyzing their experimental data.",
    "options": {
      "student-paper": false,
      "name-main-presenter": "Wenyuan Wang",
      "morning-session": false,
      "afternoon-session": true
    }
  },
  {
    "pid": 141,
    "title": "Field Test of QKD Secured Video Conference System for Clinical Use",
    "authors": [
      {
        "email": "ririka.takahashi@toshiba.co.jp",
        "first": "Ririka",
        "last": "Takahashi",
        "affiliation": "Corporate Research and Development Center, Toshiba Corporation",
        "contact": true
      },
      {
        "first": "Yoshimichi",
        "last": "Tanizawa",
        "affiliation": "Corporate Research and Development Center, Toshiba Corporation"
      },
      {
        "first": "Alexander R.",
        "last": "Dixon",
        "affiliation": "Corporate Research and Development Center, Toshiba Corporation"
      },
      {
        "first": "Akira",
        "last": "Murakami",
        "affiliation": "Corporate Research and Development Center, Toshiba Corporation"
      },
      {
        "first": "Kazuaki",
        "last": "Doi",
        "affiliation": "Corporate Research and Development Center, Toshiba Corporation"
      },
      {
        "first": "Mamiko",
        "last": "Kujiraoka",
        "affiliation": "Corporate Research and Development Center, Toshiba Corporation"
      },
      {
        "first": "Hideaki",
        "last": "Sato",
        "affiliation": "Corporate Research and Development Center, Toshiba Corporation"
      },
      {
        "first": "Muneaki",
        "last": "Shimada",
        "affiliation": "Tohoku University Hospital, Tohoku University"
      },
      {
        "first": "Inaho",
        "last": "Danjoh",
        "affiliation": "Tohoku Medical Megabank Organization, Tohoku University"
      },
      {
        "first": "Fumiki",
        "last": "Katsuoka",
        "affiliation": "Tohoku Medical Megabank Organization, Tohoku University and Advanced Research Center for Innovations in Next-Generation Medicine, Tohoku University"
      },
      {
        "first": "Yasunobu",
        "last": "Okamura",
        "affiliation": "Tohoku Medical Megabank Organization, Tohoku University and Advanced Research Center for Innovations in Next-Generation Medicine, Tohoku University"
      },
      {
        "first": "Fuji",
        "last": "Nagami",
        "affiliation": "Tohoku Medical Megabank Organization, Tohoku University and Advanced Research Center for Innovations in Next-Generation Medicine, Tohoku University"
      }
    ],
    "abstract": "To realize highly secure communication required for sensitive personal information, quantum key distribution (QKD) was applied to a video conference system for clinical use in a field trial. We demonstrated that the system provides a QKD secured environment for discussion and for sharing screens of patient cases among medical experts. The results indicated that our QKD system’s secure key rate is sufficient for a video conference in real time. This demonstrated that QKD is applicable to video conference systems for practical use.",
    "options": {
      "student-paper": false,
      "name-main-presenter": "Ririka Takahashi",
      "morning-session": true,
      "afternoon-session": true
    }
  },
  {
    "pid": 145,
    "title": "Improving the performance of CV-QKD with multi-mode signals",
    "authors": [
      {
        "email": "rupesh.kumar@york.ac.uk",
        "first": "Rupesh",
        "last": "Kumar",
        "affiliation": "Department of Physics, University of York",
        "contact": true
      },
      {
        "email": "igor.konieczniak@york.ac.uk",
        "first": "Igor",
        "last": "Konieczniak",
        "affiliation": "Department of Physics, University of York",
        "contact": true
      },
      {
        "email": "timothy.spiller@york.ac.uk",
        "first": "Tim",
        "last": "Spiller",
        "affiliation": "Department of Physics, University of York",
        "contact": true
      }
    ],
    "abstract": "Continuous variable quantum key distribution (CV-QKD) uses shot-noise limited detection for measuring the quadratures of the signal sent by Alice over the quanutm channel. Typically, the signal transmission rate is limited by the bandwidth of the detection. One of the drawbacks of\r\nCV-QKD systems is low secure key generation rate at longer transmission distances. High bandwidth detectors—which allow higher signal transmission rates—cannot improve the key generation rate as these increase the electronic noise variance. Electronic noise variance in CV-QKD systems is considered as a trusted noise source and so theoretically, it does not have a great impact on the final key rate. However, from the practical point of view, there is impact on the performance of error correction codes—such as low density parity codes (LDPC). Increased electronic noise decreases the signalto-noise ratio (SNR). Constructing LDPC at lower SNR is a bottleneck for achieving long distance CV-QKD. Multi-mode signals can improve the SNR of CV-QKD system to a significant extent. In this work, we consider a multi-mode signal based CV-QKD system where signal modes are jointly measured in order to reduce the impact of electronic noise on the SNR.",
    "options": {
      "student-paper": false,
      "name-main-presenter": "Rupesh Kumar",
      "morning-session": false,
      "afternoon-session": true
    }
  },
  {
    "pid": 147,
    "title": "Influence of birefringent fiber joints on the visibility drift in a Mach–Zehnder interferometer",
    "authors": [
      {
        "email": "g.krylov@goqrate.com",
        "first": "G M",
        "last": "Krylov",
        "affiliation": "QRate, Moscow, Russia",
        "contact": true
      },
      {
        "email": "o.fatyanov@goqrate.com",
        "first": "O V",
        "last": "Fat'yanov",
        "affiliation": "QRate, Moscow, Russia",
        "contact": true
      },
      {
        "email": "a.duplinsky@goqrate.com",
        "first": "A V",
        "last": "Duplinskii",
        "affiliation": "QRate, Moscow, Russia",
        "contact": true
      },
      {
        "email": "yk@goqrate.com",
        "first": "Y V",
        "last": "Kurochkin",
        "affiliation": "QRate, Moscow, Russia"
      }
    ],
    "abstract": "It is shown that imperfect joints of linear birefringent fibers in a fiber interferometer may result in an uncontrolled visibility drift under varying environmental conditions even with a standard\r\nphase matching device. As an example, a double Mach –Zehnder interferometer is considered, which is employed in schemes of quantum key distribution. Results of numerical simulation demonstrate the standard deviation of QBER, which is comparable to an\r\naverage QBER.",
    "options": {
      "full-version": {
        "mimetype": "application/pdf",
        "hash": "sha2-12ba19f5c32567e56a28e70bdc208ee04a73d4384bd6b42a7f6dff0088118f6c",
        "timestamp": 1592305590,
        "size": 323282,
        "filename": "Poster only .pdf"
      },
      "student-paper": true,
      "name-main-presenter": "Georgii Krylov",
      "morning-session": false,
      "afternoon-session": true
    }
  }
]
